             PGM        PARM(&FILENM)
     /* Declear Field */
             DCL        VAR(&FILENM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&OUTFIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PATH)   TYPE(*CHAR) LEN(50)

             CHGVAR     VAR(&OUTFIL) VALUE('XX' *CAT &FILENM)
     /* Delete Object */
             DLTOBJ     OBJ(QTEMP/&OUTFIL) OBJTYPE(*FILE)
             MONMSG     MSGID(CPF2105 CPF9801)

     /* Field Info */
             DSPFFD     FILE(&FILENM) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/&OUTFIL)
             CHGOBJD    OBJ(QTEMP/&OUTFIL) OBJTYPE(*FILE) +
                          TEXT('Output file for DSPFFD')

     /* Override File */
             OVRDBF     QADSPFFD QTEMP/&OUTFIL

     /* Clear Physical File Member */
             CLRPFM     ZZHEAD

     /* Call Program */
             CALL       ZZHEAD

             CHGVAR     VAR(&PATH) VALUE('\QDLS\XML\ZZHEAD.XML')
             CPYTOIMPF  FROMFILE(&FILENM) TOSTMF(&PATH) +
                          MBROPT(*REPLACE) STMFCODPAG(*STDASCII) +
                          RCDDLM(*CRLF) STRDLM(*NONE) FLDDLM(X'05') +
                          DATFMT(*USA)
             CHGAUT     OBJ(&PATH) USER(*PUBLIC) DTAAUT(*RWX) +
                          OBJAUT(*ALL)

     /* Delete Override */
             DLTOVR     QADSPFFD

     /* End Program */
             ENDPGM
