     A*
     A* LOAN FIELD REFERENCE FILE
     A*
     A***********************************************************
     A*                                                         *
     A*  LNFREF     is a part of Silverlake System (R)          *
     A*  (C) Copyright 1993, 1994                               *
     A*                 By:  Silverlake System Sdn. Bhd.        *
     A*                      50050 Kuala Lumpur Malaysia        *
     A*                                                         *
     A***********************************************************
     F* LAST CHANGED
     F*REF#  DATE     DESCRIPTION OF CHANGE         IR No/Change No.
     F*---   ----     ---------------------         ----------------
     A***********************************************************
     F* LAST CHANGED IN AM BANK
     F*REF#  DATE     DESCRIPTION OF CHANGE         IR No/Change No.
     F*---   ----     ---------------------         ----------------
     A**************************************************************************
     A                                      REF(SILVERLAKE)
     A          R RLNFREF                   TEXT('Loan field reference file')
     A* WORK FIELDS
     A            SEARCH    R               COLHDG('Search' 'string')
     A                                      TEXT('Search srting')
     A                                      REFFLD(SSDESS)
     A            RTDESC    R               COLHDG('Rate' 'description')
     A                                      TEXT('Rate description')
     A                                      REFFLD(SSDESS)
     A            TYPDES    R               COLHDG('Type' 'description')
     A                                      TEXT('Type description')
     A                                      REFFLD(SSDESS)
     A            MESSAG    R               COLHDG('Message' 'text')
     A                                      TEXT('Message text')
     A                                      REFFLD(SSDESS)
     A            MSGLIN    R               COLHDG('Message' 'line')
     A                                      REFFLD(SSMSGA)
     A            PMTDES    R               COLHDG('Payment' 'description')
     A                                      REFFLD(SSDESS)
     A            ZIP10     R               COLHDG('Zip code' 'formatted')
     A                                      REFFLD(SSCODA)
     A            BASDES    R               COLHDG('Year base' 'description')
     A                                      REFFLD(SSCODA)
     A            YORN      R               COLHDG('Yes or no')
     A                                      REFFLD(SSCOD3)
     A            LCDUE     R               COLHDG('Late charges')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            ACCI92    R               COLHDG('Acc int' 'rounded')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            SECA92    R               COLHDG('Sec acc' 'rounded')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            DLRA92    R               COLHDG('Dlr acc' 'rounded')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LHBR      R               COLHDG('Branch' 'Code')
     A                                      REFFLD(SSBRAN)
     A            LHPCDE    R               COLHDG('Payment' 'Code')
     A                                      REFFLD(SSCOU1)
     A            DSPPCT    R               COLHDG('Display' 'percent')
     A                                      REFFLD(SSPERP)
     A*************************************************************************
     A* MAINTENANCE LOG STRUCTURE
     A*************************************************************************
SS26 A            MNLUID    R               REFFLD(MNLUID SSFREF)
SS26 A            MNLWID    R               REFFLD(MNLWID SSFREF)
SS26 A            MNLDT8    R               REFFLD(MNLDT8 SSFREF)
SS26 A            MNLTIM    R               REFFLD(MNLTIM SSFREF)
M2002A            MNLSRC    R               REFFLD(MNLSRC SSFREF)
SS26 A            MNCUID    R               REFFLD(MNCUID SSFREF)
SS26 A            MNCWID    R               REFFLD(MNCWID SSFREF)
SS26 A            MNCDT8    R               REFFLD(MNCDT8 SSFREF)
SS26 A            MNCTIM    R               REFFLD(MNCTIM SSFREF)
M2002A            MNCSRC    R               REFFLD(MNCSRC SSFREF)
     A*************************************************************************
     A** Coorperative Registration File - LNANRG
     A*************************************************************************
SS27 A            ACCNUM    R               COLHDG('Account Number')
SS27 A                                      REFFLD(SSACCN)
SS27 A            ACCTYP    R               COLHDG('Account Type')
SS27 A                                      REFFLD(SSACCT)
SS27 A            CIFNUM    R               COLHDG('CIF Number')
SS27 A                                      REFFLD(SSCIFN)
SS27 A            ANGTYP    R               COLHDG('Angkasa Account Type')
SS27 A                                      REFFLD(SSCOU4)
     A*************************************************************************
     A** LOAN DEALER PARAMETER FILE - LNDEAL
     A*************************************************************************
     A            LDLNUM    R               COLHDG('Dealer' 'Number')
     A                                      REFFLD(SSCOUB)
     A            LDNAME    R               COLHDG('Dealer' 'Name')
     A                                      REFFLD(SSNAML)
     A            LDSNM     R               COLHDG('Dealer Short' 'Name')
     A                                      REFFLD(SSNAMS)
     A            LDFSNM    R               REFFLD(SSNAMS)
SS27 A                                      COLHDG('Formatted' 'short name')
     A            LDCIFN    R               COLHDG('Dealer' 'CIF Number')
     A                                      REFFLD(SSCIFN)
     A            LDADDR    R               COLHDG('Dealer' 'Address Line 1')
     A                                      REFFLD(SSNAML)
     A            LDCTST    R               COLHDG('Dealer' 'Address Line 2')
     A                                      REFFLD(SSNAML)
     A            LDCOUN    R               COLHDG('Dealer' 'Address Line 3')
     A                                      REFFLD(SSNAML)
     A            LDFONE    R               COLHDG('Dealer' 'Phone')
     A                                      REFFLD(SSTELE)
     A            LDFON2    R               COLHDG('Dealer' 'Phone 2')
     A                                      REFFLD(SSTELE)
     A*R1037      LDLIMT    R               COLHDG('Dealer' 'limit')
R1037A            LDDLMT    R               COLHDG('Dealer' 'limit')
     A                                      REFFLD(SSAMT4)
     A            LDRAMT    R               COLHDG('Dealer' 'Reserve' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LDUAMT    R               COLHDG('Dealer' 'Amount' 'Utilised')
     A                                      REFFLD(SSAMT4)
     A            LDTYPE    R               COLHDG('Dealer' 'Plan')
     A                                      REFFLD(SSCOD1)
     A            LDGRUP    R               COLHDG('Dealer' 'group')
H001 A*                                     REFFLD(SSCOU3)
H001 A                                      REFFLD(SSCODA)
     A            LDSCHD    R               COLHDG('Schedule' 'Non-Schedule')
     A                                      REFFLD(SSCOD1)
     A            LDORAT    R               COLHDG('Overdue' 'Interest Rate')
     A                                      REFFLD(SSPERD)
     A            LDOFFR    R               COLHDG('Officer' 'Code')
     A                                      REFFLD(SSOFFC)
     A            LDEXP8    R               COLHDG('Dealer' 'Expiry Date')
     A                                      REFFLD(SSDAT8)
     A            LDREVL    R               COLHDG('Revolving' 'Non-Revolving')
     A                                      REFFLD(SSCOD1)
     A            LDACCP    R               COLHDG('Dealer Accrual' 'percent')
     A                                      REFFLD(SSPERD)
     A            LDSTAT    R               COLHDG('Dealer' 'status')
     A                                      REFFLD(SSCOD2)
A011 A            LDRVD8    R               COLHDG('Dealer Review Date')
A011 A                                      REFFLD(SSDAT8)
H001 A            LDRDT8    R               COLHDG('Date Recruited')
H001 A                                      REFFLD(SSDAT8)
H001 A            LDMIDY    R               COLHDG('Min Int Days')
H001 A                                      REFFLD(SSCOU3)
H001 A            LDSUBD    R               COLHDG('Int Subsidy' 'Days')
H001 A                                      REFFLD(SSCOU3)
H001 A            LDBRSV    R               COLHDG('Branch' 'Served')
H001 A                                      REFFLD(SSBRAN)
H001 A            LDPGRP    R               COLHDG('Product' 'Group')
H001 A                                      REFFLD(SSCOD2)
H001 A            LDGVAL    R               COLHDG('Gross Development' 'Value')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDGCOS    R               COLHDG('Gross Development' 'Cost')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDSECV    R               COLHDG('Security' 'Value')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDUFBR    R               COLHDG('Undertaking Limit' ' - FBR')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDUFBT    R               COLHDG('Undertaking Limit' ' - FBT')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDRCOD    R               COLHDG('Recond')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDUSED    R               COLHDG('Used')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDNEW     R               COLHDG('New')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDNNAT    R               COLHDG('New National')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDSTA2    R               COLHDG('Dealer' 'Status')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDSTA8    R               COLHDG('Dealer' 'Status Date')
H001 A                                      REFFLD(SSDAT8)
H001 A            LDRSCH    R               COLHDG('Rescheduled' 'Ind')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDDRAT    R               COLHDG('Delinquency' 'Rate')
H001 A                                      REFFLD(SSPERD)
H001 A            LDFSMB    R               COLHDG('FIS' 'Member' '(Y/N)')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDFSDC    R               COLHDG('FIS' 'Dealer' 'Code')
H001 A                                      REFFLD(SSCODA)
H001 A            LDREMK    R               COLHDG('Remarks')
H001 A                                      REFFLD(SSDESC)
M006 A            LDCART    R               COLHDG('CAR' 'Type')
M006 A                                      REFFLD(SSCOD1)
SS07 A            LDBKSV    R               COLHDG('Bank' 'Served')
SS07 A                                      REFFLD(SSBANK)
SS07 A            LDDRGL    R               COLHDG('Settlement' 'Debit GL')
SS07 A                                      REFFLD(SSACGL)
SS07 A            LDCRGL    R               COLHDG('Settlement' 'Credit GL')
SS07 A                                      REFFLD(SSACGL)
SS07 A            LDSCYC    R               COLHDG('Settlement' 'Cycle')
SS07 A                                      REFFLD(SSTERM)
SS07 A            LDSBNK    R               COLHDG('Settlement' 'Bank')
SS07 A                                      REFFLD(SSNAML)
SS07 A            LDSBAC    R               COLHDG('Settlement' 'Bank Account')
SS07 A                                      REFFLD(SSNAMS)
SS07 A            LDMTDA    R               COLHDG('Month to Date' 'Approved')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDMTDR    R               COLHDG('Month to Date' 'Rejected')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDMTDC    R               COLHDG('Month to Date' 'Cancelled')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDYTDA    R               COLHDG('Year to Date' 'Approved')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDYTDR    R               COLHDG('Year to Date' 'Rejected')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDYTDC    R               COLHDG('Year to Date' 'Cancelled')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDLTDA    R               COLHDG('Life to Date' 'Approved')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDLTDR    R               COLHDG('Life to Date' 'Rejected')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDLTDC    R               COLHDG('Life to Date' 'Cancelled')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDPSTL    R               COLHDG('Total Past Due' 'Loan')
SS07 A                                      REFFLD(SSAMT4)
SS12 A            LDDTYP    R               COLHDG('Dealer Type')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDMDLR    R               COLHDG('Main Dealer Number')
SS12 A                                      REFFLD(SSCOUB)
SS12 A            LDADRS    R               COLHDG('Dealer Address Seq #')
SS12 A                                      REFFLD(SSCOU5)
SS12 A            LDINN1    R               COLHDG('Insurance Co. No 1')
SS12 A                                      REFFLD(SSCOU3)
SS12 A            LDTPC1    R               COLHDG('Type of Coverage ' +
SS12 A                                                'Co Ins# 1')
SS12 A                                      REFFLD(SSDESS)
SS12 A            LDPOL1    R               COLHDG('Policy No Co Ins# 1#')
SS12 A                                      REFFLD(SSDESS)
SS12 A            LDC1SI    R               COLHDG('Amount Insured ' +
SS12 A                                                'Co Ins# 1')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDC1D8    R               COLHDG('Ins Exp date' 'Co ins# 1')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDINN2    R               COLHDG('Insurance Co. No 2 #')
SS12 A                                      REFFLD(SSCOU3)
SS12 A            LDTPC2    R               COLHDG('Type of Coverage ' +
SS12 A                                                'Co Ins# 2')
SS12 A                                      REFFLD(SSDESS)
SS12 A            LDPOL2    R               COLHDG('Policy No Co Ins# 2#')
SS12 A                                      REFFLD(SSDESS)
SS12 A            LDC2SI    R               COLHDG('Amount Insured' 'Co ins# 2')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDC2D8    R               COLHDG('Ins Exp date' 'Co ins# 2')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDOSPR    R               COLHDG('O/S Pure' 'Principal Amt')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDOSBL    R               COLHDG('Outstanding Balance')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDCBAL    R               COLHDG('O/S Current Balance')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDACRI    R               COLHDG('O/S Accrue Interest')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDLCD7    R               COLHDG('O/S Late Charges')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDOCD7    R               COLHDG('O/S Other Charges')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDMCD7    R               COLHDG('O/S Misc Charges')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDMEXR    R               COLHDG('Max Excess ' +
SS12 A                                                'Credit Limit in %')
SS12 A                                      REFFLD(SSPERD)
SS12 A            LDMCRL    R               COLHDG('Max Excess' 'Credit Limit')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDGSTN    R               COLHDG('Dealer GST' 'Reg No')
SS12 A                                      REFFLD(SSCODF)
SS12 A            LDPINS    R               COLHDG('Print Ins' 'Letter Ind')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDCOMF    R               COLHDG('Commission Flag')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDDLD8    R               COLHDG('Dealer Limit' 'Eff date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDLEX8    R               COLHDG('Last Excess date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDLFM8    R               COLHDG('Last Maintenance' 'Date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDMCOM    R               COLHDG('MTD -Commission Amts')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDYCOM    R               COLHDG('YTD -Commission Amts')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDACOM    R               COLHDG('LTD -Commission Amts')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDMTDX    R               COLHDG('MTD -Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDYTDX    R               COLHDG('YTD -Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDLTDX    R               COLHDG('LTD -Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDCDPY    R               COLHDG('Commission Due' '& Payable')
SS12 A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A* MASTER FILE - LNMAST  (LNAAMAST)
     A*************************************************************************
     A*** General ***
M001 A            ARECID    R               COLHDG('Record' 'Identifier')
M001 A                                      REFFLD(SSCOD1)
V001 A            BKN       R               COLHDG('Bank' 'Number')
V001 A                                      REFFLD(SSBANK)
     A            BRN       R               COLHDG('Branch' 'Number')
     A                                      REFFLD(SSBRAN)
     A            RBRN      R               COLHDG('Reporting' 'Branch')
     A                                      REFFLD(SSBRAN)
     A            ACCTNO    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            ACTYPE    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            SNAME     R               COLHDG('Short' 'Name')
     A                                      REFFLD(SSNAMS)
     A            FSNAME    R               COLHDG('Formatted' 'short name')
     A                                      REFFLD(SSNAMS)
     A            ACNAME    R               COLHDG('Account' 'Name')
     A                                      REFFLD(SSNAML)
M001 A            LNACN1    R               COLHDG('Account' 'Name 1')
M001 A                                      REFFLD(SSNAML)
M001 A            LNACN2    R               COLHDG('Account' 'Name 2')
M001 A                                      REFFLD(SSNAML)
M001 A            LNCARE    R               COLHDG('Care of')
M001 A                                      REFFLD(SSNAML)
     A            CIFNO     R               COLHDG('CIF' 'Number')
     A                                      REFFLD(SSCIFN)
CI04 A            ACTMNO    R               COLHDG('Main Account' 'Number')
SS23 A                                      REFFLD(SSTMNO)
  |  A            ACTLLL    R               COLHDG('Lender In' 'Syndication Ln')
SS23 A                                      REFFLD(SSTLLL)
  |  A            ACTDDD    R               COLHDG('Drawdown' 'Sequence Number')
SS23 A                                      REFFLD(SSTDDD)
     A*SS01       AANO      R               COLHDG('A/A No.')
SS01 A            AANO      R               COLHDG('Facility ID')
     A                                      REFFLD(SSACCN)
     A**          FCODE     R               COLHDG('Facility' 'Code')
SS01 A**                                    REFFLD(SSCODA)
     A**          FSEQ      R               COLHDG('Seq No.')
SS01 A**                                    REFFLD(SSASEQ)
M038 A            PLBGL     R               COLHDG('Post Lender Bank GL')
M038 A                                      REFFLD(SSCOD1)
M001 A            MCLNID    R               COLHDG('Multi CCY' 'Loan Code')
M001 A                                      REFFLD(SSCOD1)
AM05 A            SYNLN     R               COLHDG('Syndication Loan')
AM05 A                                      REFFLD(SSCOD1)
R1006A            CLUBL     R               COLHDG('Club Loan')
R1006A                                      REFFLD(SSCOD1)
     A            LNNUM     R               COLHDG('Account' 'Group Number')
     A                                      REFFLD(SSACCN)
     A            APTYPE    R               COLHDG('Application Type')
     A                                      REFFLD(SSACCT)
CS01 A            APRELN    R               COLHDG('Related' 'Account Number')
CS01 A                                      REFFLD(SSACCN)
     A            TYPE      R               COLHDG('Loan' 'Type')
     A                                      REFFLD(SSPROD)
     A            CURTYP    R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A            CURDEC    R               COLHDG('Currency' 'Decimals')
     A                                      REFFLD(SSCOD1)
     A            SHDSC     R               COLHDG('Short' 'description')
     A                                      REFFLD(SSCODA)
     A            GROUP     R               COLHDG('Group' 'Code')
     A                                      REFFLD(SSGRUP)
     A            LONGRP    R               COLHDG('Loan' 'Group')
     A                                      REFFLD(SSCOU3)
     A            LMCOST    R               COLHDG('Cost center')
H001 A                                      REFFLD(SSCOST)
     A*SS26       LMPRDC    R               COLHDG('Product code')
SS26 A*R1025      LMPRDC    R               COLHDG('Business' 'Unit/Product' -
SS26 A*R1025                                'Code')
R1025A            LMPRDC    R               COLHDG('Category' 'Code')
H001 A                                      REFFLD(SSPROC)
V001 A            GLBOOK    R               COLHDG('GL Book')
V001 A                                      REFFLD(SSCOD1)
R1025A            RESIND    R               COLHDG('Resident Indicator')
R1025A                                      REFFLD(SSCOD2)
R1025A            CUSCAT    R               COLHDG('Customer Category')
R1025A                                      REFFLD(SSCOD2)
R1025A            GLACST    R               COLHDG('GL Account Status')
R1025A                                      REFFLD(SSCOD2)
R1025A            SUBLDG    R               COLHDG('Sub Ledger Code')
R1025A                                      REFFLD(SSCOU5)
     A            STATUS    R               COLHDG('Status')
     A                                      REFFLD(SSACCS)
H001 A            LNSPTF    R               COLHDG('SPTF loan type')
H001 A                                      REFFLD(SSCOD1)
M001 A            SPMGST    R               COLHDG('Split/Merge' 'Status')
M001 A                                      REFFLD(SSCOD1)
     A            IBASE     R               COLHDG('Interest' 'Base')
     A                                      REFFLD(SSCOU1)
     A            IFREQ     R               COLHDG('Interest' 'Freq.')
     A                                      REFFLD(SSCOD1)
     A            YBASE     R               COLHDG('Year' 'Base')
     A                                      REFFLD(SSCOU1)
     A*** Amount  ***
     A            ORGAMT    R               COLHDG('Original' 'Balance')
     A                                      REFFLD(SSAMT4)
CI41 A            TCHAMT    R               COLHDG('Tranche' 'Amount')
CI41 A                                      REFFLD(SSAMT4)
     A            DRLIMT    R               COLHDG('Drawing' 'Limit')
     A                                      REFFLD(SSAMT4)
R1043A            IDLIMT    R               COLHDG('Intra-day' 'Limit')
R1043A                                      REFFLD(SSAMT4)
     A            CBAL      R               COLHDG('Current' 'Balance')
     A                                      REFFLD(SSAMT4)
     A            ACCINT    R               COLHDG('Accrued' 'Interest')
     A                                      REFFLD(SSAMTG)
     A            ACCIN2    R               COLHDG('Secondary' 'Accrued Int')
     A                                      REFFLD(SSAMTG)
     A            DLRACC    R               COLHDG('Dealer' 'Accrued Int')
     A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
     A            COMACC    R               COLHDG('Commitment fee' 'Accr Int')
     A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
     A            PENINT    R               COLHDG('Accrued' 'Penalty Interest')
     A                                      REFFLD(SSAMTG)
     A            OTHCHG    R               COLHDG('Other' 'Charges')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MISCD     R               COLHDG('Miscellaneous Cost')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
AM15 A            ASSINT    R               COLHDG('Assessed' 'Interest')
AM15 A                                      REFFLD(SSAMT4)
AM15 A            PAIDIN    R               COLHDG('Paid' 'Interest')
AM15 A                                      REFFLD(SSAMT4)
     A            ASSLC     R               COLHDG('Assessed' 'Late' 'Charges')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            PAIDLC    R               COLHDG('Paid' 'Late' 'Charges')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A006 A            RESINT    R               COLHDG('Restructured' 'Interest')
A006 A                                      REFFLD(SSAMT4)
SS26 A            MORINT    R               COLHDG('Accrued' 'Moratorium' -
     A                                      'Interest')
SS26 A                                      REFFLD(SSAMTG)
M018 A            RESLC     R               COLHDG('Restructured' 'Late Charge')
M018 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            INTPAY    R               COLHDG('Interest'  'Payable')
     A                                      REFFLD(SSAMT4)
     ** Discount and Rebates
     A            BKDISC    R               COLHDG('Bank' 'Discount')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            DLRDSC    R               COLHDG('Dealer' 'Discount')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            CLPREM    R               COLHDG('Credit Life' 'Premium')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            AHPREM    R               COLHDG('A & H Ins' 'Premium')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MIPREM    R               COLHDG('Misc Ins' 'Premium')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BKDSC2    R               COLHDG('Bank' 'Discount 2')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            INTREB    R               COLHDG('Interest' 'Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M033 A            REBWRK    R               COLHDG('Int Rebate' 'Work field')
     A                                      REFFLD(SSAMTR)
     A            INTRE2    R               COLHDG('Interest' 'Rebate N2')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            DLRREB    R               COLHDG('Dealer' 'Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            CLREB     R               COLHDG('Cr Life Ins' 'Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            AHREB     R               COLHDG('A&H Ins' 'Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MIREB     R               COLHDG('Misc Ins' 'Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS12 A            PUCOMM    R               COLHDG('Partial Up-front' 'Comm')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            DRPREM    R               COLHDG('Dealer Commission')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            DRREB     R               COLHDG('Dealer Comm Rebate')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            SDPREM    R               COLHDG('Sub-Dealer Comm')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            SDREB     R               COLHDG('Sub-Dealer' 'Comm Rebate')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            SMPREM    R               COLHDG('Salesman Commission')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            SMREB     R               COLHDG('Salesman Comm Rebate')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            SMCOPD    R               COLHDG('Salesman Comm Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            COMGST    R               COLHDG('Commission' 'GST Payable')
SS12 A                                      REFFLD(SSAMT4)
     ** VAT
SS26 A            TOTVAT    R               COLHDG('Total VAT')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            REMVAT    R               COLHDG('Remaining VAT')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            POBVAT    R               COLHDG('Paid on behalf' 'VAT')
SS26 A                                      REFFLD(SSAMT4)
SS32 A            HPPMTV    R               COLHDG('Payment Amount' 'For VAT')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            HPFPMV    R               COLHDG('VAT Final' 'Payment Amt')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            HPMINV    R               COLHDG('Close Acct' 'Accor. to' -
SS32 A                                             'Minimum VAT')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            HPPRTV    R               COLHDG('VAT Partial' 'Payment')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            HPRED8    R               COLHDG('Last VAT Bill' 'Gen Dt')
SS32 A                                      REFFLD(SSDAT8)
     ** Other Balances
     A            AMTREL    R               COLHDG('Amount' 'Release')
     A                                      REFFLD(SSAMT4)
OS02 A            HTAMRL    R               COLHDG('Higher Tranche' 'Amount' -
     A                                      'Release')
OS02 A                                      REFFLD(SSAMT4)
M004 A            HOLD      R               COLHDG('Earmark Amount')
M004 A                                      REFFLD(SSAMT4)
     A            MEMAMT    R               COLHDG('Memo Post' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            CURPO     R               COLHDG('Current' 'Month' 'Payoff')
     A                                      REFFLD(SSAMT4)
     A            NXTPO     R               COLHDG('Next' 'Month' 'Payoff')
     A                                      REFFLD(SSAMT4)
     A            PREBAL    R               COLHDG('Prev Rest' 'Balance')
     A                                      REFFLD(SSAMT4)
     A            ACBAL     R               COLHDG('Accrual' 'Balance')
     A                                      REFFLD(SSAMT4)
M004 A            LEXCDA    R               COLHDG('Last Excess Amount')
M004 A                                      REFFLD(SSAMT4)
SS31 A            LINCPA    R               COLHDG('Last Interest' -
SS31 A                                      'Capitalised Amount')
SS31 A                                      REFFLD(SSAMT4)
SS31 A            LLCCPA    R               COLHDG('Last Late Charge' -
SS31 A                                      'Capitalised Amount')
SS31 A                                      REFFLD(SSAMT4)
SS31 A            LCMCPA    R               COLHDG('Last Commit Fee' -
SS31 A                                      'Capitalised Amount')
SS31 A                                      REFFLD(SSAMT4)
AM01 A            AVBLOW    R               COLHDG('Lowest Avail. Bal' -
     A                                      'Work Field')
     A                                      REFFLD(SSAMT4)
AM01 A            AVBAPW    R               COLHDG('Apport. Avail. Bal' -
     A                                      'Work Field')
     A                                      REFFLD(SSAMT4)
     A*** Rate Information ***
     **     F=Fixed, L=Floating, M=Mix (LN555AB)
M004 A            ITYPE     R               COLHDG('Interest' 'Type')
     A*M024                                 REFFLD(SSCOD5)
M024 A                                      REFFLD(SSCODA)
     A            RATE      R               COLHDG('Loan' 'interest rate')
     A                                      REFFLD(SSPERD)
M038 A            RFLOR     R               COLHDG('Rate' 'floor')
M038 A                                      REFFLD(SSPERD)
M038 A            RCEIL     R               COLHDG('Rate' 'ceiling')
M038 A                                      REFFLD(SSPERD)
     A            DLRATE    R               COLHDG('Dealer' 'Rate')
     A                                      REFFLD(SSPERD)
     A            PRATEN    R               COLHDG('Prime Rate' 'Number')
     A                                      REFFLD(SSRATE)
     A            PVARI     R               COLHDG('Prime' 'Variance')
     A                                      REFFLD(SSPERD)
     A            PVCODE    R               COLHDG('Prime Variance' 'Code')
     A                                      REFFLD(SSCOD1)
     A            PFLOOR    R               COLHDG('Prime Rate' 'Floor')
     A                                      REFFLD(SSPERD)
     A            PCEIL     R               COLHDG('Prime Rate' 'Ceiling')
     A                                      REFFLD(SSPERD)
M001 A            VCEIL     R               COLHDG('Rate' 'Var. Ceiling')
M001 A                                      REFFLD(SSPERD)
M001 A            VFLOR     R               COLHDG('Rate' 'Var. Floor')
M001 A                                      REFFLD(SSPERD)
     A            PREVD8    R               COLHDG('Prime' 'Review Date')
     A                                      REFFLD(SSDAT8)
     A            PRVDAY    R               COLHDG('Prime' 'Review Day')
     A                                      REFFLD(SSDAT2)
     A            PRTERM    R               COLHDG('Prime' 'Review Term')
     A                                      REFFLD(SSTERM)
     A            PRCODE    R               COLHDG('Prime Review' 'Term Code')
     A                                      REFFLD(SSCOD1)
M003 A            RREVD8    R               COLHDG('Rate User Manual' 'Review -
M003 A                                      Date')
M003 A                                      REFFLD(SSDAT8)
M003 A            RRVDAY    R               COLHDG('Rate User Manual' 'Review -
M003 A                                      Day')
M003 A                                      REFFLD(SSDAT2)
M001 A            RRTERM    R               COLHDG('Rate User Manual' 'Review -
M001 A                                      Term')
M001 A                                      REFFLD(SSTERM)
M001 A            RRCODE    R               COLHDG('Rate User Manual' 'Review -
M001 A                                      Term Code')
M001 A                                      REFFLD(SSCOD1)
     A            MATRAT    R               COLHDG('Maturity' 'Rate')
     A                                      REFFLD(SSPERD)
AM01 A            MATDLR    R               COLHDG('Maturity' 'Dealer Rate')
     A                                      REFFLD(SSPERD)
M024 A            MATRTN    R               COLHDG('Mat. Rate' 'Number')
M024 A                                      REFFLD(SSRATE)
M024 A            MATPVR    R               COLHDG('Mat. Rate' 'Variance')
M024 A                                      REFFLD(SSPERD)
M024 A            MATPVC    R               COLHDG('Mat. Rate' 'Variance Code')
M024 A                                      REFFLD(SSCOD1)
     **AM01
     A            MATFLR    R               COLHDG('Mat. Rate' 'Floor')
     A                                      REFFLD(SSPERD)
     A            MATCEL    R               COLHDG('Mat. Rate' 'Ceiling')
     A                                      REFFLD(SSPERD)
     A            MATPD8    R               COLHDG('Mat. Rate' 'Review Date')
     A                                      REFFLD(SSDAT8)
     A            MATPDY    R               COLHDG('Mat. Rate' 'Review Day')
     A                                      REFFLD(SSDAT2)
     A            MATPRT    R               COLHDG('Mat. Rate' 'Review Term')
     A                                      REFFLD(SSTERM)
     A            MATPRC    R               COLHDG('Mat. Rate' 'Review TM Code')
     A                                      REFFLD(SSCOD1)
     **
     A            EFRATE    R               COLHDG('Effective' 'Rate')
     A                                      REFFLD(SSPERD)
A011 A            APRATE    R               COLHDG('Annualised Pct Rate')
A011 A                                      REFFLD(SSPERD)
     A            TIER      R               COLHDG('Two-tier' 'Rate')
     A                                      REFFLD(SSPERD)
     A            MINCG     R               COLHDG('Minimum' 'Charge')
     A                                      REFFLD(SSAMT1)
H001 A            MIDAYS    R               COLHDG('Minimum Int Days')
H001 A                                      REFFLD(SSCOU3)
M039 A            ACCMIN    R               COLHDG('Accrue Memo' 'Interest')
M039 A                                      REFFLD(SSCOD1)
H001 A            ERNAI     R               COLHDG('Earn Additional' 'Day Int')
H001 A                                      REFFLD(SSCOD1)
     A            CGRINT    R               COLHDG('Compounding Grace' -
     A                                      'Acc Int')
     A                                      REFFLD(SSCOD1)
     A            CPDPRD    R               COLHDG('Compounding Period')
     A                                      REFFLD(SSCOU3)
H001 A*R1006      POMFLG    R               COLHDG('Promotion Arrs' 'Flag')
R1006A            POMFLG    R               COLHDG('Default Rate' 'Flag')
H001 A                                      REFFLD(SSCOD1)
SS26 A            POMCLB    R               COLHDG('Clawback arrears' 'to last-
SS26 A                                       due date')
SS26 A                                      REFFLD(SSCOD1)
     **AM01
     A            POMARR    R               COLHDG('Arrs Mths/Days' 'To Switch')
     A                                      REFFLD(SSCOU3)
     A            POMATC    R               COLHDG('Arrears Grace' 'Prd Code')
     A                                      REFFLD(SSCOD1)
     A*R1006      POMRAT    R               COLHDG('Promotion' 'Arrs Rate')
R1006A            POMRAT    R               COLHDG('Default' 'Rate')
     A                                      REFFLD(SSPERD)
     A*R1006      POMRTN    R               COLHDG('Promotion' 'Arrs Rate No.')
R1006A            POMRTN    R               COLHDG('Default Rate' ' Number')
     A                                      REFFLD(SSRATE)
     A*R1006      POMVRI    R               COLHDG('Promotion' 'Arrs Variance')
R1006A            POMVRI    R               COLHDG('Default Rate' 'Variance')
     A                                      REFFLD(SSPERD)
     A*R1006      POMVRC    R               COLHDG('Promotion' 'Arrs Var Code')
R1006A            POMVRC    R               COLHDG('Default Rate' 'Var Code')
     A                                      REFFLD(SSCOD1)
R1002A            REINRT    R               COLHDG('Reinstate Normal ' +
R1002A                                      'Rate')
R1002A                                      REFFLD(SSCOD1)
R1032A            USEDFR    R               COLHDG('Use Default Rate')
R1032A                                      REFFLD(SSCOD1)
R1027A            DFTDT8    R               COLHDG('Use Default' 'Rate Date')
R1027A                                      REFFLD(SSDAT8)
     A*           AAVADY    R               COLHDG('Avail.' 'Period in Day')
     A*                                     REFFLD(SSCOU3)
     A*           AAVAMO    R               COLHDG('Avail.' 'Period in Mth')
     A*                                     REFFLD(SSCOU3)
     **===========
     A            ISTRD8    R               COLHDG('Interest' 'start date')
     A                                      REFFLD(SSDAT8)
V001 A            ACCEF8    R               COLHDG('Accrue Int' 'Eff date')
V001 A                                      REFFLD(SSDAT8)
     A            NACDT8    R               COLHDG('Nonaccrual' 'Date')
     A                                      REFFLD(SSDAT8)
     A            PDTOD8    R               COLHDG('Int Paid' 'to Date')
     A                                      REFFLD(SSDAT8)
     A            PPTOD8    R               COLHDG('Prev. Int Paid' 'to Date')
     A                                      REFFLD(SSDAT8)
     A* MORATORIUM RATE
SS26 A            MFRATE    R               COLHDG('Moratorium-' 'Fixed' -
SS26 A                                      'Interest Rate')
SS26 A                                      REFFLD(SSPERD)
SS26 A            MFMORT    R               COLHDG('Moratorium-' 'Fixed' -
SS26 A                                      'Moratorium Int Rate')
SS26 A                                      REFFLD(SSPERD)
SS26 A            MFMIAM    R               COLHDG('Moratorium-' 'Fixed Max' -
SS26 A                                      'Interest Amt')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MFMMAM    R               COLHDG('Moratorium-' 'Fixed Max' -
SS26 A                                      'Moratorium Int Amt')
SS26 A                                      REFFLD(SSAMT4)
     A* LATE CHARGES
     A            LCTYPE    R               COLHDG('Late Charge' 'Type')
     A                                      REFFLD(SSCOU3)
     A            LCRATE    R               COLHDG('Late Charge' 'Rate')
     A                                      REFFLD(SSPERD)
     A            LCGRC     R               COLHDG('Late Chg' 'Grace Period')
     A                                      REFFLD(SSCOU3)
SS12 A            LCGRCM    R               COLHDG('Late Charge ' +
SS12 A                                                'Grace Day (Maturity)')
SS12 A                                      REFFLD(SSCOU3)
     A            LCGRCI    R               COLHDG('LC Grace' 'Int Servicing')
     A                                      REFFLD(SSCOU3)
     A            ACCLCF    R               COLHDG('Accrue on' 'L/C rate Flag')
     A                                      REFFLD(SSCOD1)
M001 A            LCITYP    R               COLHDG('Int Late Charge' 'Type')
M001 A                                      REFFLD(SSCOU3)
M001 A            LCIRAT    R               COLHDG('Int Late Charge' 'Rate')
M001 A                                      REFFLD(SSPERD)
M001 A            LCIGRC    R               COLHDG('Int Late Charge' -
M001 A                                      'Grace Period')
M001 A                                      REFFLD(SSCOU3)
M001 A            LCIGRI    R               COLHDG('Int LC Grace' -
M001 A                                      'Int Servicing')
M001 A                                      REFFLD(SSCOU3)
     A            YBSEL     R               COLHDG('LC Accr' 'Year Base')
     A                                      REFFLD(SSCOU1)
     A            ACCMLC    R               COLHDG('Accrue Memo' 'Late charges')
     A                                      REFFLD(SSCOD1)
     A            MEMOLC    R               COLHDG('Memo' 'Late charges')
     A                                      REFFLD(SSAMTG)
SS26 A            LCLAD8    R               COLHDG('L/C Last accr date')
SS26 A                                      REFFLD(SSDAT8)
M038 A* LC DUE DATE
M038 A            LNLCS8    R               COLHDG('Late Charge' 'Sched' -
M038 A                                      'Pymt Date')
M038 A                                      REFFLD(SSDAT8)
M038 A            LNLCN8    R               COLHDG('Late Charge' 'Pymt' -
M038 A                                      'Date')
M038 A                                      REFFLD(SSDAT8)
M038 A            LNLCFR    R               COLHDG('Late Charge' 'Freq')
M038 A                                      REFFLD(SSCOU3)
M038 A            LNLCFC    R               COLHDG('Late Charge' 'Freq' -
M038 A                                      'code')
M038 A                                      REFFLD(SSCOD1)
M038 A            LNLCDY    R               COLHDG('Late Charge' 'Pymt' -
M038 A                                      'Day of Month')
M038 A                                      REFFLD(SSDAT2)
     A* COMMITMENT FEES
     A            SCHREL    R               COLHDG('Amt to be' 'released')
     A                                      REFFLD(SSAMT4)
     A            COMMIT    R               COLHDG('Commitment' 'Rate')
     A                                      REFFLD(SSPERD)
     A            COMRAT    R               COLHDG('Commitment' 'Rate No.')
H001 A                                      REFFLD(SSRATE)
     A            YBSEC     R               COLHDG('Com Fee Accr' 'Year Base')
     A                                      REFFLD(SSCOU1)
     A            MINUL     R               COLHDG('Minimum Usage Limit')
     A                                      REFFLD(SSAMT4)
     A            MULPC     R               COLHDG('Min Usage Lmt' '% Of Ln Am')
     A                                      REFFLD(SSPERD)
R1034A            COMFEB    R               COLHDG('CF Calculation' 'base on')
R1034A                                      REFFLD(SSCOD1)
     A            FUDRW     R               COLHDG('Undrawn' 'Limit')
     A                                      REFFLD(SSAMT4)
     A            FUDPC     R               COLHDG('% Of Total' 'Undrawn')
     A                                      REFFLD(SSPERD)
     A            FUDER     R               COLHDG('Undrawn lmt' 'excess rate')
     A                                      REFFLD(SSPERD)
     A            FUDAR     R               COLHDG('Undrawn %' 'If Above Lmt')
     A                                      REFFLD(SSPERD)
     A            UCEXD8    R               COLHDG('Available Start' 'Date')
     A                                      REFFLD(SSDAT8)
H001 A            AVAID8    R               COLHDG('Availability' 'End Date')
H001 A                                      REFFLD(SSDAT8)
M038 A* COMM FEE DUE DATE
M038 A            NSCFD8    R               COLHDG('Commitment Fee' 'Sched' -
     A                                      'Pymt Date')
M038 A                                      REFFLD(SSDAT8)
M038 A            NXCFD8    R               COLHDG('Commitment Fee' 'Pymt' -
     A                                      'Date')
M038 A                                      REFFLD(SSDAT8)
M038 A            NCFFRQ    R               COLHDG('Commitment Fee'  'Freq')
M038 A                                      REFFLD(SSCOU3)
M038 A            NCFFRC    R               COLHDG('Commitment Fee'  'Freq' -
     A                                      'code')
M038 A                                      REFFLD(SSCOD1)
M038 A            NCFDAY    R               COLHDG('Commitment Fee' 'Pymt' -
     A                                      'Day of Month')
M038 A                                      REFFLD(SSDAT2)
     ** Auto Set FPDT/MATDT
     A            FFPDT     R               COLHDG('Set FPDT' 'Upon 1st rel')
     A                                      REFFLD(SSCOD1)
     A            MTHBK     R               COLHDG('Nmth grace on' 'FPDT cal')
     A                                      REFFLD(SSCOU3)
SS26 A            DAYBK     R               COLHDG('Day grace on' 'FPDT cal')
SS26 A                                      REFFLD(SSCOU3)
     A            CFPDT     R               COLHDG('Cal 1st Instl' 'Date')
     A                                      REFFLD(SSCOD1)
R1029A            RCFPDT    R               COLHDG('Recal 1st Instl' 'Date')
R1029A                                      REFFLD(SSCOD1)
     A            UPDOB     R               COLHDG('Disburse' 'on/bef day')
     A                                      REFFLD(SSCOU2)
     A            DAFP      R               COLHDG('Day for auto' '1st pymt')
     A                                      REFFLD(SSCOU2)
     A            CNIPD     R               COLHDG('Auto set' 'NIPDT')
     A                                      REFFLD(SSCOD1)
     A            UPIOB     R               COLHDG('Disburse' 'on/bef day')
     A                                      REFFLD(SSCOU2)
     A            DANIP     R               COLHDG('Day for auto' 'NIPDT')
     A                                      REFFLD(SSCOU2)
M038 A            CLCD      R               COLHDG('Auto set' 'first LC dt')
M038 A                                      REFFLD(SSCOD1)
M038 A            UPLCB     R               COLHDG('Day for Auto' 'set on/b4')
M038 A                                      REFFLD(SSCOU2)
M038 A            DANLC     R               COLHDG('Day of mth' 'For auto set')
M038 A                                      REFFLD(SSCOU2)
M038 A            CCFD      R               COLHDG('Auto set' 'first CF dt')
M038 A                                      REFFLD(SSCOD1)
M038 A            UPCFB     R               COLHDG('Day for Auto' 'set on/b4')
M038 A                                      REFFLD(SSCOU2)
M038 A            DANCF     R               COLHDG('Day of mth' 'For auto set')
M038 A                                      REFFLD(SSCOU2)
     **AM01
     A            GFREL     R               COLHDG('Grace Period' 'FRELD6 cal')
     A                                      REFFLD(SSCOU3)
     A            GFRCD     R               COLHDG('Grace Period' 'FRELD6 cal')
     A                                      REFFLD(SSCOD1)
     A            GFUL      R               COLHDG('Grace Period' 'FULLD6 cal')
     A                                      REFFLD(SSCOU3)
     A            GFUCD     R               COLHDG('Grace Period' 'FULLD6 cal')
     A                                      REFFLD(SSCOD1)
     A            GAVAI     R               COLHDG('Grace Period' 'AVAIL. cal')
     A                                      REFFLD(SSCOU3)
     A            GAVCD     R               COLHDG('Grace Period' 'AVAIL. cal')
     A                                      REFFLD(SSCOD1)
     **AM01
     A            ASMAT     R               COLHDG('Auto set' 'maturity date?')
     A                                      REFFLD(SSCOD1)
     A            RUMATD    R               COLHDG('Auto extend' 'maturity dat')
     A                                      REFFLD(SSCOD1)
H001 A            RCMATD    R               COLHDG('Maturity' 'Calc Method')
H001 A                                      REFFLD(SSCOD1)
     A*---------------- REAMORTISATION ------------------------
     A            RQ1098    R               COLHDG('Requires' '1098')
     A                                      REFFLD(SSCOD1)
V001 A            ROASEX    R               COLHDG('Reamortize' 'Alt Sch Exp')
V001 A                                      REFFLD(SSCOD1)
     A            REAMOR    R               COLHDG('Reamortize' 'Pmt Upon Rate')
     A                                      REFFLD(SSCOD1)
     A            CPAMR     R               COLHDG('Reamortise' 'Pmt Upon CP')
     A                                      REFFLD(SSCOD1)
     A            RABKD     R               COLHDG('Reamortise' 'Pmt Upon Disb')
     A                                      REFFLD(SSCOD1)
SS22 A            RUEXI     R               COLHDG('Reamortize' 'Upon Exc Int ')
SS22 A                                      REFFLD(SSCOD1)
     A* REAMORTIZE OPTION
     A* C-REAMORTIZE ON CBAL, D-REAMORTIZE ON AMTREL, BLANK-REAMORTIZE ON ORGAMT
     A            ROREAM    R               COLHDG('Reamortize' 'Rate chg opt')
     A                                      REFFLD(SSCOD1)
     A            ROCPAM    R               COLHDG('Reamortize' 'Cap.Rep. opt')
     A                                      REFFLD(SSCOD1)
     A            ROABKD    R               COLHDG('Reamortize' 'Disburse opt')
     A                                      REFFLD(SSCOD1)
SS22 A            ROUEXI    R               COLHDG('Reamortize' 'Exc Int. opt')
SS22 A                                      REFFLD(SSCOD1)
     ** Update maturity date
     A            UMDRC     R               COLHDG('Update Mat date' '- Rate')
     A                                      REFFLD(SSCOD1)
     A            UMDCP     R               COLHDG('Update Mat date' '- C/P')
     A                                      REFFLD(SSCOD1)
M001 A            UMDDB     R               COLHDG('Update Mat date' '- Disb')
M001 A                                      REFFLD(SSCOD1)
     A*** Payment Codes/Term/Freq ***
     A            PMTCOD    R               COLHDG('Payment' 'Code')
     A                                      REFFLD(SSCOU1)
     A            UPPCD     R               COLHDG('Auto Update' 'Pymt Code')
     A                                      REFFLD(SSCOD1)
     A            DFPCD     R               COLHDG('Default' 'Pymt Code(Upt)')
     A                                      REFFLD(SSCOU1)
SS09 A            DFFRQ     R               COLHDG('Default' 'Pymt Freq(Upt)')
SS09 A                                      REFFLD(SSCOU5)
SS09 A            DFFRQC    R               COLHDG('Default' 'Pymt Freq' -
SS09 A                                      'Code(Upt)')
SS09 A                                      REFFLD(SSCOD1)
     A            SWRELS    R               COLHDG('Switch PMTCOD' 'X Amt Rel')
     A                                      REFFLD(SSAMT4)
     A            DOCSTS    R               COLHDG('Document Status')
     A                                      REFFLD(SSCOD2)
     A            NEARD     R               COLHDG('Cal Instl' 'Nearest Dollar')
     A                                      REFFLD(SSCOD1)
     A            TERM      R               COLHDG('Loan Term')
V007 A                                      REFFLD(SSTERM)
     A            TMCODE    R               COLHDG('Loan Term' 'Code')
     A                                      REFFLD(SSCOD1)
M003 A            PERMAN    R               COLHDG('Permanent' 'No Maturity')
     A                                      REFFLD(SSCOD1)
M001 A*R1006      ROTERM    R               COLHDG('Max Roll' 'Term')
R1006A            ROTERM    R               COLHDG('Main A/C Max Roll' 'Term')
M001 A                                      REFFLD(SSTERM)
M001 A*R1006      ROTMCD    R               COLHDG('Max Roll' 'Term Code')
R1006A            ROTMCD    R               COLHDG('Main A/C Max Roll' 'Tm Cd')
M001 A                                      REFFLD(SSCOD1)
R1002A            ROLTER    R               COLHDG('Tranche Maximum' +
R1002A                                      'Rollover Term')
R1002A                                      REFFLD(SSTERM)
R1002A            ROLTMC    R               COLHDG('Tranche Maximum' +
R1002A                                      'Rollover Term Code')
R1002A                                      REFFLD(SSCOD1)
     A            FREQ      R               COLHDG('Payment' 'Frequency')
     A                                      REFFLD(SSCOU3)
     A            FRCODE    R               COLHDG('Payment' 'Freq Code')
     A                                      REFFLD(SSCOD1)
     A            IPFREQ    R               COLHDG('Int Payment' 'Frequency')
     A                                      REFFLD(SSCOU3)
     A            IPCODE    R               COLHDG('Int Payment' 'Freq Code')
     A                                      REFFLD(SSCOD1)
     ** Payment Information
     A            PMTAMT    R               COLHDG('Payment' 'Amount')
     A                                      REFFLD(SSAMT4)
SS26 A            PPMTAM    R               COLHDG('Principal' 'Pymt Amount')
SS26 A                                      REFFLD(SSAMT4)
M031 A            IPMTAM    R               COLHDG('Interest' 'Pymt Amount')
M031 A                                      REFFLD(SSAMT4)
SS26 A            RIPMTA    R               COLHDG('Restructured' 'Interest' -
SS26 A                                      'Pymt Amount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MIPMTA    R               COLHDG('Moratorium' 'Interest' -
SS26 A                                      'Pymt Amount')
SS26 A                                      REFFLD(SSAMT4)
     A            FNLPMT    R               COLHDG('Final' 'Payment')
     A                                      REFFLD(SSAMT4)
     A            LSTPMT    R               COLHDG('Last Pymt' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            PRTPMT    R               COLHDG('Partial' 'Pymt Amount')
     A                                      REFFLD(SSAMT4)
SS26 A            PPRPMT    R               COLHDG('Partial' 'Principal' -
SS26 A                                      'Pymt Amount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            PINPMT    R               COLHDG('Partial' 'Interest' -
SS26 A                                      'Pymt Amount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            PMIPMT    R               COLHDG('Partial' 'Mora Int' -
SS26 A                                      'Pymt Amount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            PRIPMT    R               COLHDG('Partial' 'Rest. Int' -
SS26 A                                      'Pymt Amount')
SS26 A                                      REFFLD(SSAMT4)
OS04 A            AUADVP    R               COLHDG('Auto Uplift' -
OS04 A                                      'Advance Payment')
OS04 A                                      REFFLD(SSCOD1)
     A            ADVPMT    R               COLHDG('Advance' 'Payment')
     A                                      REFFLD(SSAMT4)
     A            CAPREP    R               COLHDG('Capital' 'Repayment')
     A                                      REFFLD(SSAMT4)
AM01 A            INTREP    R               COLHDG('Rebate due to' -
     A                                      'Capital Repayment')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            RESIDV    R               COLHDG('Residue' 'Value')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     **AM01
     A            IPMTPC    R               COLHDG('Interest Payment %')
     A                                      REFFLD(SSPERD)
     A            NEWIPM    R               COLHDG('New Int.' 'Payment Amt')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            NEWIPC    R               COLHDG('New Int.' 'Payment %')
     A                                      REFFLD(SSPERD)
     A            NWIPD8    R               COLHDG('New Int. Payment' -
     A                                      'Effective Date')
     A                                      REFFLD(SSDAT8)
     A            NEWPMT    R               COLHDG('New Payment' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            NWPMD8    R               COLHDG('New Pymt' 'Effective Date')
     A                                      REFFLD(SSDAT8)
R1054A            NWFREQ    R               COLHDG('New Pymt' 'Frequency')
R1054A                                      REFFLD(SSCOU3)
R1054A            NWFRCD    R               COLHDG('New Pymt' 'Freq Code')
R1054A                                      REFFLD(SSCOD1)
R1054A            NWIFRQ    R               COLHDG('New Int Pymt' 'Frequency')
R1054A                                      REFFLD(SSCOU3)
R1054A            NWIFRC    R               COLHDG('New Int Pymt' 'Freq Code')
R1054A                                      REFFLD(SSCOD1)
M001 A            OPMTAM    R               COLHDG('Original' 'payment amount')
M001 A                                      REFFLD(SSAMT4)
M001 A            OPMTCD    R               COLHDG('Original' 'payment code')
M001 A                                      REFFLD(SSCOU1)
M001 A            OPFREQ    R               COLHDG('Original' 'payment freq')
M001 A                                      REFFLD(SSCOU3)
     A            STMPAS    R               COLHDG('Reverted Back' 'Org PMTCOD')
     A                                      REFFLD(SSCOD1)
     A            COEXD8    R               COLHDG('Original' 'due date')
     A                                      REFFLD(SSDAT8)
     A            PAYMNO    R               COLHDG('No. of' 'instl/s paid')
     A                                      REFFLD(SSCOU3)
     A            NOADVP    R               COLHDG('No. of advance' 'instl due')
     A                                      REFFLD(SSCOU3)
     A            CURPNO    R               COLHDG('Current' 'Payment No.')
     A                                      REFFLD(SSCOU3)
     A            NOINSP    R               COLHDG('No. of' 'instalment paid')
     A                                      REFFLD(SSCOU3)
     A** BILLINGS
     A            BILPRN    R               COLHDG('Billed' 'Prin Amt')
     A                                      REFFLD(SSAMT4)
     A            BILINT    R               COLHDG('Billed' 'Int Amt')
     A                                      REFFLD(SSAMT4)
     A            BILESC    R               COLHDG('Billed' 'Escrow Amt')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BILLC     R               COLHDG('Billed' 'Late Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M008 A            BILCF     R               COLHDG('Billed' 'Com Fee')
M008 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BILOC     R               COLHDG('Billed' 'Other Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BILMC     R               COLHDG('Billed' 'Misc Cost')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A006 A            BILRIN    R               COLHDG('Billed' 'Restructure Int.')
A006 A                                      REFFLD(SSAMT4)
SS18 A            BILMIN    R               COLHDG('Billed' 'Moratorium Int.')
SS18 A                                      REFFLD(SSAMT4)
M018 A            BILRLC    R               COLHDG('Billed' 'Restructured LC')
M018 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            BILVAT    R               COLHDG('Billed' 'VAT')
SS26 A                                      REFFLD(SSAMT4)
     A            BILPNO    R               COLHDG('Billed' 'Prin Amt OD')
     A                                      REFFLD(SSAMT4)
     A            BILINO    R               COLHDG('Billed' 'Int Amt OD')
     A                                      REFFLD(SSAMT4)
     A            BILESO    R               COLHDG('Billed' 'Escrow Amt OD')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BILLCO    R               COLHDG('Billed' 'Late Chgs OD')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M008 A            BILCFO    R               COLHDG('Billed' 'Com Fee OD')
M008 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BILOCO    R               COLHDG('Billed' 'Other Chgs OD')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BILMCO    R               COLHDG('Billed' 'Misc Cost OD')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A006 A            BILRIO    R               COLHDG('Billed' 'Restruc. Int. O/D')
A006 A                                      REFFLD(SSAMT4)
SS18 A            BILMIO    R               COLHDG('Billed' 'Mora. Int. O/D')
SS18 A                                      REFFLD(SSAMT4)
M018 A            BILRLO    R               COLHDG('Billed' 'Restruc. LC O/D')
M018 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            BILVTO    R               COLHDG('Billed' 'VAT O/D')
SS26 A                                      REFFLD(SSAMT4)
     A            WRKBLP    R               COLHDG('Work Field' 'Bill Prin.')
     A                                      REFFLD(SSAMT4)
     A            WRKBLI    R               COLHDG('Work Field' 'Bill Int.')
     A                                      REFFLD(SSAMT4)
M008 A            WRKBCF    R               COLHDG('Work Field' 'Bill CF.')
M008 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M004 A            WRKBLC    R               COLHDG('Work Field' 'Bill LC.')
M004 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A006 A            WRKBRI    R               COLHDG('Work Field' 'Restruc. Int.')
A006 A                                      REFFLD(SSAMT4)
SS18 A            WRKBMI    R               COLHDG('Work Field' 'Mora. Int.')
SS18 A                                      REFFLD(SSAMT4)
M018 A            WRKBRL    R               COLHDG('Work Field' 'Restruc. LC')
M018 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS18 A            WRKBVT    R               COLHDG('Work Field' 'VAT')
SS18 A                                      REFFLD(SSAMT4)
M001 A            BILDAY    R               COLHDG('Nday for' 'billing')
M001 A                                      REFFLD(SSCOU3)
M001 A            REBILL    R               COLHDG('Rebilling')
M001 A                                      REFFLD(SSCOD1)
M001 A            REBGRC    R               COLHDG('Rebilling Grace Day')
M001 A                                      REFFLD(SSCOU3)
     ** --------------------- Date Fields ----------------------------
     ** Creation and disbursement date
     A            DATOP8    R               COLHDG('Date' 'Entered')
     A                                      REFFLD(SSDAT8)
     A            ORGDT8    R               COLHDG('Original' 'Loan Date')
     A                                      REFFLD(SSDAT8)
     A            FRELD8    R               COLHDG('1st Release' 'Date')
     A                                      REFFLD(SSDAT8)
M001 A            LRELD8    R               COLHDG('Last release' 'Date')
M001 A                                      REFFLD(SSDAT8)
M001 A            FTREL8    R               COLHDG('1st Tranche' 'Release Date')
M001 A                                      REFFLD(SSDAT8)
     A            FULLD8    R               COLHDG('Full Rel.' 'Date')
     A                                      REFFLD(SSDAT8)
     ** Payment Date
     A            NPDAY     R               COLHDG('Pymt Day' 'of Month')
     A                                      REFFLD(SSDAT2)
     A            FPDT8     R               COLHDG('1st Pymt' 'Date')
     A                                      REFFLD(SSDAT8)
     A            NSPDT8    R               COLHDG('Next Sched' 'Pymt Date')
     A                                      REFFLD(SSDAT8)
     A            NPDT8     R               COLHDG('Next Pymt' 'Due Date')
     A                                      REFFLD(SSDAT8)
     A            NIPDAY    R               COLHDG('Int Pymt Day' 'of Month')
     A                                      REFFLD(SSDAT2)
     A            NSIPD8    R               COLHDG('Nxt Sch Int' 'pymt due dt')
     A                                      REFFLD(SSDAT8)
     A            NIPDT8    R               COLHDG('Next Int. Pymt' 'Due Date')
     A                                      REFFLD(SSDAT8)
     A            LPDT8     R               COLHDG('Last Pymt' 'Date')
     A                                      REFFLD(SSDAT8)
     A            THRUD8    R               COLHDG('Pymt Good' 'Thru Date')
     A                                      REFFLD(SSDAT8)
R1024A            FFOSD8    R               COLHDG('First Forced' 'Sale date')
R1024A                                      REFFLD(SSDAT8)
     ** Maturity Date
     A            ORGMD8    R               COLHDG('Original' 'Maturity Date')
     A                                      REFFLD(SSDAT8)
     A            MATDT8    R               COLHDG('Maturity' 'Date')
     A                                      REFFLD(SSDAT8)
     A            INMDT8    R               COLHDG('Int Maturity' 'Date')
     A                                      REFFLD(SSDAT8)
V002 A            FMATD8    R               COLHDG('Final' 'Maturity Date')
V002 A                                      REFFLD(SSDAT8)
     ** Status Date
     A            STSDT8    R               COLHDG('Status' 'Date')
     A                                      REFFLD(SSDAT8)
     A            CHGDT8    R               COLHDG('Chg off' 'Date')
     A                                      REFFLD(SSDAT8)
     A            POFFD8    R               COLHDG('Payoff' 'Date')
     A                                      REFFLD(SSDAT8)
     ** Expiry Date for Rebate
     A            CLIEX8    R               COLHDG('CL Ins' 'Exp Date')
     A                                      REFFLD(SSDAT8)
     A            AHIEX8    R               COLHDG('A&H Ins' 'Exp Date')
     A                                      REFFLD(SSDAT8)
M009 A            MIIEX8    R               COLHDG('Misc Int.' 'Exp Date')
M009 A                                      REFFLD(SSDAT8)
     ** Restructuring/Rescheduling/Extension Date
     A            RENDT8    R               COLHDG('Date' 'Extended')
     A                                      REFFLD(SSDAT8)
     A            RESDT8    R               COLHDG('Reschedule' 'Date')
     A                                      REFFLD(SSDAT8)
     A            VARDT8    R               COLHDG('Restructuring' 'Date')
     A                                      REFFLD(SSDAT8)
     ** Other Dates
     A            NREVD8    R               COLHDG('Next Review' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LREBD8    R               COLHDG('Last Rebate' 'Date')
     A                                      REFFLD(SSDAT8)
     A            NREBD8    R               COLHDG('Next Rebate' 'Date')
     A                                      REFFLD(SSDAT8)
     A            REFND8    R               COLHDG('Date of' 'Refund')
     A                                      REFFLD(SSDAT8)
SS31 A            EXCDT8    R               COLHDG('Excess date')
SS31 A                                      REFFLD(SSDAT8)
M001 A            LEXCD8    R               COLHDG('Last' 'excess date')
M001 A                                      REFFLD(SSDAT8)
SS31 A            LINCP8    R               COLHDG('Last Interest' -
SS31 A                                      'Capitalised Date')
SS31 A                                      REFFLD(SSDAT8)
SS31 A            LLCCP8    R               COLHDG('Last Late Charge' -
SS31 A                                      'Capitalised Date')
SS31 A                                      REFFLD(SSDAT8)
SS31 A            LCMCP8    R               COLHDG('Last Commit Fee' -
SS31 A                                      'Capitalised Date')
SS31 A                                      REFFLD(SSDAT8)
M024 A            ROLEF8    R               COLHDG('Next Rollover' 'Eff date')
M024 A                                      REFFLD(SSDAT8)
M024 A            ROLSE8    R               COLHDG('Last Rollover' 'Eff date')
M024 A                                      REFFLD(SSDAT8)
     A*---------------- NOTICES FLAGS  ------------------------
     A            HMAIL     R               COLHDG('Hold Mail' 'Code')
     A                                      REFFLD(SSCOD1)
     A            WVHML     R               COLHDG('Waive' 'Hold Mail')
     A                                      REFFLD(SSCOD1)
     A            INCLUD    R               COLHDG('Include on' 'Stmt Code')
     A                                      REFFLD(SSCOD1)
     A            SENDCD    R               COLHDG('Print Billing' 'Notice')
     A                                      REFFLD(SSCOD1)
M001 A            SENDCL    R               COLHDG('Prt Confirmation' 'Letter')
M001 A                                      REFFLD(SSCOD1)
     A            PNFLAG    R               COLHDG('Past Due' 'Notice Code')
     A                                      REFFLD(SSCOU1)
     A            PHFLAG    R               COLHDG('Past Due' 'History Flag')
     A                                      REFFLD(SSCOD1)
     A            SENDPD    R               COLHDG('Send Past' 'Due Notice')
     A                                      REFFLD(SSCOD1)
     A            PDCODE    R               COLHDG('On Past' 'Due Report')
     A                                      REFFLD(SSCOD1)
     A            REMIND    R               COLHDG('Reminder' 'Code')
     A                                      REFFLD(SSCOD1)
AM01 A            REBNT     R               COLHDG('Generate Notice' -
     A                                      'Rebate to Customer')
     A                                      REFFLD(SSCOD1)
AM01 A            ROLNT     R               COLHDG('Rollover Notice')
     A                                      REFFLD(SSCOD1)
     A*---------------- SCHEDULE FLAGS ------------------------
     A            REVOLV    R               COLHDG('Revolving')
     A                                      REFFLD(SSCOD1)
     A            ROLM      R               COLHDG('Rollover' 'method')
     A                                      REFFLD(SSCOD1)
R1005A            ROLMB     R               COLHDG('Rollover' 'Bal. Method')
R1005A                                      REFFLD(SSCOD1)
     A            DRWSCH    R               COLHDG('Drawndown' 'Schd.')
     A                                      REFFLD(SSCOD1)
     A            ALTSCH    R               COLHDG('Alternate' 'Pymt Sched')
     A                                      REFFLD(SSCOD1)
H001 A            PRSCH     R               COLHDG('Prin Repaym' 'Schd')
H001 A                                      REFFLD(SSCOD1)
H001 A            INVRO     R               COLHDG('Prin' 'Inverse Order')
H001 A                                      REFFLD(SSCOD1)
     A            ALTRAT    R               COLHDG('Alternate' 'Rate')
     A                                      REFFLD(SSCOD1)
     A            TIERED    R               COLHDG('Tiered loan')
     A                                      REFFLD(SSCOD1)
R1037A            ALTTIR    R               COLHDG('Use Alternate and' -
R1037A                                      'Tier Rate')
R1037A                                      REFFLD(SSCOD1)
V001 A            AVGBKC    R               COLHDG('Rate Tied To' 'Avg Of Bks')
V001 A                                      REFFLD(SSCOD1)
SS26 A            AVGSD8    R               COLHDG('Average Bank Rate' 'Start-
SS26 A                                      Date')
SS26 A                                      REFFLD(SSDAT8)
     A            FDRATE    R               COLHDG('Cal RATE' 'Base on dep acc')
     A                                      REFFLD(SSCOD1)
     A* S = Savings
     A* T = Time deposit
     A* B = Both savings and time deposit
     A*' '= Not tied to deposit accounts
     A            COLTYP    R               COLHDG('Collteral' 'Type')
     A                                      REFFLD(SSCOD1)
     A* S = Fully secured by shares
     A* F = Fully secured by Fixed deposits
     A* O = Others or mixture
     A            SICODE    R               COLHDG('Standing' 'Inst Code')
     A                                      REFFLD(SSCOD1)
V001 A            GIRO      R               COLHDG('Giro')
V001 A                                      REFFLD(SSCOD1)
V001 A            CPF       R               COLHDG('CPF flag')
V001 A                                      REFFLD(SSCOD1)
     A            SUBSID    R               COLHDG('Subsidized by' '3rd party')
     A                                      REFFLD(SSCOD1)
R1025A            SLDCSC    R               COLHDG('Salary' 'Deduction Scheme')
R1025A                                      REFFLD(SSCOD1)
R1002A            EMPCOD    R               COLHDG('Employer Code')
R1002A                                      REFFLD(SSCODA)
     A            ESCROW    R               COLHDG('Escrow/Mortgage' 'Info?')
     A                                      REFFLD(SSCOD1)
     A            ESCPOF    R               COLHDG('Include escrow' 'In payoff')
     A                                      REFFLD(SSCOD1)
SS20 A            ANRGCD    R               COLHDG('Cooperative' 'Registration')
SS20 A                                      REFFLD(SSCOD1)
     A            HASARM    R               COLHDG('A.R.M. Info' 'Code')
     A                                      REFFLD(SSCOD1)
H001 A            LLSCHD    R               COLHDG('Loan Limit' 'Schd')
H001 A                                      REFFLD(SSCOD1)
H001 A            TWSCH     R               COLHDG('Tranche' 'Working Schd')
H001 A                                      REFFLD(SSCOD1)
H001 A            SSPSCH    R               COLHDG('S & P' 'Schd')
H001 A                                      REFFLD(SSCOD1)
     A*---------------- RELATED ACC    ------------------------
AM01 A            FRTBK     R               COLHDG('Fronting Bank')
     A                                      REFFLD(SSCOD1)
     A            PARTID    R               COLHDG('Participation' 'Code')
     A                                      REFFLD(SSCOD1)
     A            PRTPCT    R               COLHDG('Participation' 'Percent')
     A                                      REFFLD(SSPERD)
     A            PCACCN    R               COLHDG('Participation' 'Acct Num')
     A                                      REFFLD(SSACCN)
SS16 A            REDRAW    R               COLHDG('Redraw')
SS16 A                                      REFFLD(SSCOD1)
SS26 A            LNCSV     R               COLHDG('Link Loan to CA/SA')
SS26 A                                      REFFLD(SSCOD1)
SS31 A            CYCBIL    R               COLHDG('Use Cycle to Bill')
SS31 A                                      REFFLD(SSCOD1)
R1005A            GUASLN    R               COLHDG('Guarantee' 'Scheme Loan')
R1005A                                      REFFLD(SSCOD1)
SS16 A            CRDLIM    R               COLHDG('Cumulative' 'Redraw Limit')
SS16 A                                      REFFLD(SSAMT4)
SS16 A            CRDUTL    R               COLHDG('Cumulative' 'Redraw' -
SS16 A                                      'Utilisation')
SS16 A                                      REFFLD(SSAMT4)
SS16 A            ORDLIM    R               COLHDG('Original' 'Redraw' -
SS16 A                                      'Limit Ceiling')
SS16 A                                      REFFLD(SSAMT4)
SS16 A            RDLIMT    R               COLHDG('Current' 'Redraw' -
SS16 A                                      'Limit Ceiling')
SS16 A                                      REFFLD(SSAMT4)
SS16 A            APRDW8    R               COLHDG('Redraw' 'Limit' -
SS16 A                                      'Reduction Date')
SS16 A                                      REFFLD(SSDAT8)
SS16 A            ADAPRD    R               COLHDG('Additional Approved' -
SS16 A                                      'Redraw Limit')
SS16 A                                      REFFLD(SSAMT4)
SS16 A            RDEXP8    R               COLHDG('Additional Approved' -
SS16 A                                      'Redraw Limit Date')
SS16 A                                      REFFLD(SSDAT8)
R1002A            FRDT8     R               COLHDG('First Redraw Date')
R1002A                                      REFFLD(SSDAT8)
R1002A            PRERD8    R               COLHDG('Previous Redraw Date')
R1002A                                      REFFLD(SSDAT8)
M028 A            PWOFID    R               COLHDG('Part/Charge off' -
M028 A                                      'Indicator')
M028 A                                      REFFLD(SSCOD1)
M028 A            PWOFAC    R               COLHDG('Part/Charge off' 'Acct Num')
M028 A                                      REFFLD(SSACCN)
M001 A            DEALNO    R               COLHDG('Deal No')
M001 A                                      REFFLD(SSCOU5)
     A            CLCODE    R               COLHDG('Credit Line' 'Code')
     A                                      REFFLD(SSCOD1)
     A            CLACCN    R               COLHDG('Cr Line' 'Acct Num')
     A                                      REFFLD(SSACCN)
V008 A* A/U
V008 A            DLRMTD    R               COLHDG('Dealer' 'Cal Mathod')
V008 A                                      REFFLD(SSCOD1)
V008 A* U/M/E
V008 A            DLRPOP    R               COLHDG('Dealer' 'Com payment')
V008 A                                      REFFLD(SSCOD1)
     A            DLRNO     R               COLHDG('Dealer No.')
H001 A*R1002                                REFFLD(SSCOUB)
R1002A                                      REFFLD(SSCODA)
     A            DLRGP     R               COLHDG('Dealer' 'group')
H001 A                                      REFFLD(SSCODA)
SS12 A            SUBDLR    R               COLHDG('Sub-Dealer Number')
SS12 A*R1002                                REFFLD(SSCOUB)
R1002A                                      REFFLD(SSCODA)
     A* HP Enhancement Field
SS12 A            COMMCD    R               COLHDG('Commission' 'Scheme Code')
SS12 A                                      REFFLD(SSCOD5)
SS12 A            COMMTD    R               COLHDG('Comm Calc Method')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            SUBCOM    R               COLHDG('Subject to Commi' +
SS12 A                                                'ssion/Dealership')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            PMTDAY    R               COLHDG('Dealer Paym Day')
SS12 A                                      REFFLD(SSCOU2)
SS12 A            GENHPA    R               COLHDG('Auto Gen' 'HPA Form A/B')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            AGMDT8    R               COLHDG('Agreement date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            EARNDR    R               COLHDG('Subj to Dealer' +
SS12 A                                      'Comm Amortization')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            EARNSD    R               COLHDG('Subj to Sub-Dealer' +
SS12 A                                      'Comm Amortization')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            EARNSM    R               COLHDG('Subj to Salesman' +
SS12 A                                      'Comm Amortization')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            TERMDR    R               COLHDG('Dlr Comm Amor' 'Period')
SS12 A                                      REFFLD(SSCOU5)
SS12 A            TMCDDR    R               COLHDG('Dlr Comm Amor' +
SS12 A                                      'Period Term Cd')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            TERMSD    R               COLHDG('Sub-Dlr Comm Amor' 'Period')
SS12 A                                      REFFLD(SSCOU5)
SS12 A            TMCDSD    R               COLHDG('Sub-Dlr Comm Amor' +
SS12 A                                                'Period Term Cd')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            TERMSM    R               COLHDG('Salesman Comm Amor' +
SS12 A                                                'Period')
SS12 A                                      REFFLD(SSCOU5)
SS12 A            TMCDSM    R               COLHDG('Salesman Comm Amor' +
SS12 A                                                'Period Term Cd')
SS12 A                                      REFFLD(SSCOD1)
     A*
     A*---------------- MISC CODES ----------------------------
     A            CLSZRO    R               COLHDG('Close On' 'Zero Bal Code')
     A                                      REFFLD(SSCOD1)
R1021A            CAZBGR    R               COLHDG('Close On' 'Zero Bal Grace')
R1021A                                      REFFLD(SSCOU3)
R1021A            CAZBGC    R               COLHDG('Close On' 'Zero Bal Grace' -
R1021A                                      'Code')
R1021A                                      REFFLD(SSCOD1)
R1002A            CAREAN    R               COLHDG('Close Account Reason')
R1002A                                      REFFLD(SSCOD2)
R1002A            EMAMDT    R               COLHDG('Tranche Maturity' +
R1002A                                      'Date Checking')
R1002A                                      REFFLD(SSYON )
V001 A            LNINSC    R               COLHDG('Insider Code')
V001 A                                      REFFLD(SSCOD1)
     A            PURCOD    R               COLHDG('Purpose' 'Code')
     A                                      REFFLD(SSCOD2)
     A            CLASS     R               COLHDG('Class' 'Code')
     A                                      REFFLD(SSCLAS)
     A            CALREP    R               COLHDG('Call Report' 'Code')
V001 A                                      REFFLD(SSCOD6)
     A            TYPCLS    R               COLHDG('Classification' 'Type')
     A                                      REFFLD(SSCOD1)
     A            RATCOD    R               COLHDG('Credit Rating' 'Code')
     A*M001                                 REFFLD(SSCLAS)
M001 A                                      REFFLD(SSCOD6)
     A            DEPTCD    R               COLHDG('Department' 'Code')
     A                                      REFFLD(SSCOU3)
     A            OFFCR     R               COLHDG('Officer')
     A                                      REFFLD(SSOFFC)
R1002A            SBUCOD    R               COLHDG('SBU Code')
R1002A                                      REFFLD(SSCOD4)
R1002A            SUBCOD    R               COLHDG('Sub Code')
R1002A                                      REFFLD(SSCOD4)
R1002A            CFSEGC    R               COLHDG('Segment Code')
R1002A                                      REFFLD(SSCOD4)
R1002A            CFSSEG    R               COLHDG('Sub Segment' 'Code')
R1002A                                      REFFLD(SSCOD4)
R1002A            THPRID    R               COLHDG('3rd Party ID')
R1002A*R1011                                REFFLD(SSCOUB)
R1011A                                      REFFLD(SSCODA)
R1002A*R1015      RMCODE    R               COLHDG('Relationship' +
R1002A*R1015                                'Manager')
R1002A*R1015                                REFFLD(SSCODA)
R1002A            ASSESC    R               COLHDG('Assessment Code')
R1002A                                      REFFLD(SSCOD1)
R1002A            LEGSTA    R               COLHDG('Legal Status')
R1002A                                      REFFLD(SSCOD1)
R1002A            STISUP    R               COLHDG('Stop Interest' +
R1002A                                      'Suspend')
R1002A                                      REFFLD(SSCOD1)
R1002A            IDEIDC    R               COLHDG('Intraday' +
R1002A                                      'Excess Indicator')
R1002A                                      REFFLD(SSCOD1)
R1002A            LAEXBC    R               COLHDG('Ex-Bank Code')
R1002A                                      REFFLD(SSCOD2)
R1002A            BUNDLE    R               COLHDG('Bundle Code')
R1002A                                      REFFLD(SSCODA)
M004 A            REFFRM    R               COLHDG('Refinance From')
M004 A*R1002                                REFFLD(SSCODC)
R1002A                                      REFFLD(SSDESS)
M004 A            REFTO     R               COLHDG('Refinance To')
M004 A*R1002                                REFFLD(SSCODC)
R1002A                                      REFFLD(SSDESS)
     A            CLINSN    R               COLHDG('CL Insurance' 'Company N')
     A                                      REFFLD(SSCOU3)
     A            AHINSN    R               COLHDG('A/H Insurance' 'Company N')
     A                                      REFFLD(SSCOU3)
     A            MIINSN    R               COLHDG('Misc Insurance' 'Company N')
     A                                      REFFLD(SSCOU3)
     A            COUPON    R               COLHDG('Print Coupon' 'Book Flag')
     A                                      REFFLD(SSCOD1)
     A            CPNTRM    R               COLHDG('Coupon Book' 'Term')
     A                                      REFFLD(SSCOU3)
     A            ALMTYP    R               COLHDG('ALM' 'Type')
     A                                      REFFLD(SSCOD1)
R1015A            COMPRO    R               COLHDG('Compromised' +
R1015A                                      'Settlement Flag')
R1015A                                      REFFLD(SSCOD1)
R1015A            COMPD8    R               COLHDG('Compromised' +
R1015A                                      'Settlement Flag' 'Change Date')
R1015A                                      REFFLD(SSDAT8)
     A************
     A            FREINT    R               COLHDG('Interest Free' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            FREINP    R               COLHDG('Int Free' 'Pmt Portion')
     A                                      REFFLD(SSAMT4)
     A            AMRSUS    R               COLHDG('Amortized' 'Pymt Suspense')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            AMRINT    R               COLHDG('One Mo Int' 'On Amort Loan')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            INTODY    R               COLHDG('Interest' 'Trnx/Paid Today')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A**  NPL INFORMATION
     A            NPLFLG    R               COLHDG('NPL' 'Flag')
     A                                      REFFLD(SSCOD1)
     A            NPLSTA    R               COLHDG('NPL' 'Status')
     A                                      REFFLD(SSCOD1)
     **AM01
     A            NPLSTW    R               COLHDG('NPL Status' 'Work field')
     A                                      REFFLD(SSCOD1)
AM11 A            NPLFQW    R               COLHDG('NPL Freq' 'Work field')
AM11 A                                      REFFLD(SSCOU3)
     A*AM01       PNPLFL    R               COLHDG('Previous' 'NPL Flag')
     A*                                     REFFLD(SSCOD1)
     A*AM01       PNPLST    R               COLHDG('Previous' 'NPL Status')
     A*                                     REFFLD(SSCOD1)
M024 A            NPLRSN    R               COLHDG('NPL' 'Reason')
M024 A                                      REFFLD(SSDESL)
     A            YSNPLS    R               COLHDG('Yesterday' 'NPL Status')
     A                                      REFFLD(SSCOD1)
     A            NPLDT8    R               COLHDG('NPL Date')
     A                                      REFFLD(SSDAT8)
     A            TOTINU    R               COLHDG('Total int unpaid')
     A                                      REFFLD(SSAMT4)
     A            INTSUP    R               COLHDG('Total' 'Int-In-Susp')
     A                                      REFFLD(SSAMT4)
     A            LCSUP     R               COLHDG('Total' 'L/C-In-Susp')
     A                                      REFFLD(SSAMT4)
     A            INB4SP    R               COLHDG('Interest before' 'suspense')
     A                                      REFFLD(SSAMT4)
     A            LCB4SP    R               COLHDG('Late charges' 'b4 suspense')
     A                                      REFFLD(SSAMT4)
     A            IISTAX    R               COLHDG('Taxable Int-In-Susp')
     A                                      REFFLD(SSAMT4)
     A            IISNTX    R               COLHDG('Non-taxable' 'Int-In-Susp')
     A                                      REFFLD(SSAMT4)
     A            IB4NTX    R               COLHDG('Int before' 'non-taxable')
     A                                      REFFLD(SSAMT4)
SS26 A            RINSUP    R               COLHDG('Total' 'Rest-Int-In-Susp')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            RISTAX    R               COLHDG('Taxable' 'Rest-Int-In-Susp')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            RISNTX    R               COLHDG('Non-taxable' -
SS26 A                                      'Rest-Int-In-Susp')
SS26 A                                      REFFLD(SSAMT4)
     A            PNPLD8    R               COLHDG('Prev NPL' 'status date')
     A                                      REFFLD(SSDAT8)
SS26 A            LNPLD8    R               COLHDG('Last NPL' 'status date')
SS26 A                                      REFFLD(SSDAT8)
     A*** NPLPAY is for interest payment only
     A*** PLPAY is for principal payments for discount loans
     A            NPLPAY    R               COLHDG('Int payment' 'after NPL')
     A                                      REFFLD(SSAMT4)
     A            PLPAY     R               COLHDG('Payment' 'after PL')
     A                                      REFFLD(SSAMT4)
     A            PLREB     R               COLHDG('Int rebate' 'on PL date')
     A                                      REFFLD(SSAMT4)
SS05 A            NPLPLC    R               COLHDG('LC Payment' 'after NPL')
SS05 A                                      REFFLD(SSAMT4)
SS05 A            PLPLC     R               COLHDG('LC Payment' 'after PL')
SS05 A                                      REFFLD(SSAMT4)
     A            INALC     R               COLHDG('NPL-allocate' 'Int first')
     A                                      REFFLD(SSCOD1)
     A* Suspend ineterest
SS26 A            SUPFLG    R               COLHDG('Interest' 'Suspend Flag')
SS26 A                                      REFFLD(SSCOD1)
SS26 A            SUPSTA    R               COLHDG('Interest' 'Suspend Status')
SS26 A                                      REFFLD(SSCOD1)
R1050A            INSRJU    R               COLHDG('Reject OD' 'Utilization' -
R1050A                                      'Upon Int Suspense')
R1050A                                      REFFLD(SSCOD1)
SS26 A            YSSUPS    R               COLHDG('Yesterday' 'Interest' -
SS26 A                                      'Suspend Status')
SS26 A                                      REFFLD(SSCOD1)
SS26 A            SUPDT8    R               COLHDG('Interest' 'Suspend Date')
SS26 A                                      REFFLD(SSDAT8)
SS26 A            PSUPD8    R               COLHDG('Previous' 'Interest' -
SS26 A                                      'Suspend Date')
SS26 A                                      REFFLD(SSDAT8)
SS26 A            LSUPD8    R               COLHDG('Last' 'Interest Suspend' -
SS26 A                                      'Date')
SS26 A                                      REFFLD(SSDAT8)
R1006A            SUPPMT    R               COLHDG('Suspend Payment' 'Flag')
R1006A                                      REFFLD(SSCOD1)
R1006A            SUPBAL    R               COLHDG('Suspend Balance')
R1006A                                      REFFLD(SSAMT4)
     ** NPL RESTRUCTURING
M024 A            RNPLPR    R               COLHDG('Monitor Nmths' 'prompt pmt')
M024 A                                      REFFLD(SSCOD1)
M024 A            RNPCNT    R               COLHDG('Counter Nmths' 'prompt pmt')
M024 A                                      REFFLD(SSCOU3)
M024 A            MTHDPR    R               COLHDG('Prin Mths' 'in Default B4')
M024 A                                      REFFLD(SSCOU3)
M024 A            MTHDIN    R               COLHDG('Int Mths' 'in Default B4')
M024 A                                      REFFLD(SSCOU3)
     A            VARNPL    R               COLHDG('Restructuring' 'NPL Status')
     A                                      REFFLD(SSCOD1)
A024 A            BVNPLS    R               COLHDG('NPL Status' 'B4 Rstc/Rschd')
     A                                      REFFLD(SSCOD1)
     A            AMTDFT    R               COLHDG('Amount in default' 'before')
     A                                      REFFLD(SSAMT4)
     A            MTHDFT    R               COLHDG('Months in default' 'before')
     A                                      REFFLD(SSCOU3)
     A            IMDFD8    R               COLHDG('Date to' 'Init MTHDFT')
     A                                      REFFLD(SSDAT8)
     A            RENEXT    R               COLHDG('Renewed/Extended' 'This Mo')
     A                                      REFFLD(SSCOD1)
SS99 A            STRMD8    R               COLHDG('Start Mth' 'Cont. 12 mths')
SS99 A                                      REFFLD(SSDAT8)
     ** Recall
M024 A            RECALL    R               COLHDG('Recall Status')
M024 A                                      REFFLD(SSCOD1)
M024 A            YSRCST    R               COLHDG('Previous' 'Recall Status')
M024 A                                      REFFLD(SSCOD1)
BA01 A            RCLDT8    R               COLHDG('Recall Date 6')
BA01 A                                      REFFLD(SSDAT8)
M024 A            RCLEF8    R               COLHDG('Recall Eff Date 6')
M024 A                                      REFFLD(SSDAT8)
     ** Judgement
     A            JDIND     R               COLHDG('JDSUM accrual' 'indicator')
     A                                      REFFLD(SSCOD1)
     A            JDACCR    R               COLHDG('Judgment Sum' 'Accr Int')
     A                                      REFFLD(SSAMTG)
M031 ** Moratorium
M039 A            ACCMOR    R               COLHDG('Accrue on' 'Mora Int during-
M039 A                                      ' 'Mora Prd (Y/N)')
M039 A                                      REFFLD(SSCOD1)
M031 A            MRFLAG    R               COLHDG('Moratorium' 'Flag')
M031 A                                      REFFLD(SSCOD1)
M031 A            MRSTR8    R               COLHDG('Moratorium' 'Start Date')
M031 A                                      REFFLD(SSDAT8)
M031 A            MREXP8    R               COLHDG('Moratorium' 'Expiry Date')
M031 A                                      REFFLD(SSDAT8)
     ** Stop VAT
SS26 A            STOPVT    R               COLHDG('Stop VAT Flag' )
SS26 A                                      REFFLD(SSCOD1)
SS26 A            STVTD8    R               COLHDG('Stop VAT Date' )
SS26 A                                      REFFLD(SSDAT8)
     **===
     **
     ** CAR and Provision
     A            SPFLAG    R               COLHDG('Spec.Prov' 'Flag')
     A                                      REFFLD(SSCOD1)
M024 A            SPPCT     R               COLHDG('Spec Prov' 'Percentage')
M024 A                                      REFFLD(SSPERD)
M024 A            SPAAMT    R               COLHDG('Spec Prov' 'Absolute Amt')
M024 A                                      REFFLD(SSAMT4)
M005 A            CARTP     R               COLHDG('Classified' 'Acct. Type')
M005 A                                      REFFLD(SSCOD1)
M024 A            CARFLG    R               COLHDG('Classified' 'Acct. Flag')
M024 A                                      REFFLD(SSCOD1)
M001 A            CARCD     R               COLHDG('Classified' 'Acct. code')
M001 A                                      REFFLD(SSCOD2)
AM01 A            CARCDW    R               COLHDG('CAR Code Work field')
     A                                      REFFLD(SSCOD2)
SS07 A            WCARCD    R               COLHDG('Worst' 'CAR Code')
SS07 A                                      REFFLD(SSCOD2)
AM11 A            CARFQW    R               COLHDG('CAR Freq Work field')
     A                                      REFFLD(SSCOU3)
M001 A            CLSRSN    R               COLHDG('Reason of' 'classification')
M001 A*R1051                                REFFLD(SSCOD4)
R1051A                                      REFFLD(SSCOD6)
V001 A            LNCARP    R               COLHDG('Previous' 'CAR Code')
V001 A                                      REFFLD(SSCOD2)
V001 A            LNCSD8    R               COLHDG('Date' 'Classified')
V001 A                                      REFFLD(SSDAT8)
V001 A            LNCSP8    R               COLHDG('Previous' 'Date Clas.')
V001 A                                      REFFLD(SSDAT8)
SS07 A            LNWCD8    R               COLHDG('Worst' 'Classified Date')
SS07 A                                      REFFLD(SSDAT8)
M024 A            SPPROV    R               COLHDG('Specific' 'Provision')
M024 A                                      REFFLD(SSAMT4)
M024 A            SPLMCV    R               COLHDG('Last Month' 'Coll Value')
M024 A                                      REFFLD(SSAMT4)
M024 A            SPPRCT    R               COLHDG('Last Month' 'SP Percentage')
M024 A                                      REFFLD(SSPERD)
     A*****************************************************************
     A** Auto Charge off
SS26 A            MPDCO     R               COLHDG('Month past' 'due auto' -
SS26 A                                      'charge off')
SS26 A                                      REFFLD(SSCOU3)
SS09 A            DPDCO     R               COLHDG('Day past' 'due auto' -
SS09 A                                      'charge off')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            COMTD     R               COLHDG('Auto Charge' 'off Method')
SS09 A                                      REFFLD(SSCOD1)
     A** TDR
SS26 A            TDRIND    R               COLHDG('TDR Indicator')
SS26 A                                      REFFLD(SSCOD1)
SS26 A            TDRCNT    R               COLHDG('TDR Control' 'Pass Due')
SS26 A                                      REFFLD(SSCOD1)
SS26 A            TDRGCD    R               COLHDG('TDR Pass due' 'Grace day')
SS26 A                                      REFFLD(SSCOU3)
SS26 A            DISMIN    R               COLHDG('Discount' 'Moratorium' -
SS26 A                                      'Interest')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            DISRIN    R               COLHDG('Discount' 'Restructured' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            DISRIT    R               COLHDG('Discount' 'Restructured' -
SS26 A                                      'Intt Tax')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            DISRNT    R               COLHDG('Discount' 'Restructured' -
SS26 A                                      'Int Non Tax')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            DISRLC    R               COLHDG('Discount' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            DISPRN    R               COLHDG('Discount' 'Principal')
SS26 A                                      REFFLD(SSAMT4)
     A*****************************************************************
     A** PENALTIES & FEES******
     A            FILON     R               COLHDG('Subj Int In' 'Lieu Of Notc')
     A                                      REFFLD(SSCOD1)
     A            FNPPTM    R               COLHDG('Part Prepaym.' 'Notc Term')
     A                                      REFFLD(SSCOU3)
     A            FNPPTC    R               COLHDG('Part Prepaym.' 'Notc Tm Cd')
     A                                      REFFLD(SSCOD1)
M001 A            PCIND     R               COLHDG('Cmmn of Prepymt' 'Per Ind')
M001 A                                      REFFLD(SSCOD1)
M001 A            PPDT8     R               COLHDG('Cmmn of Prepymt' 'Date 6')
M001 A                                      REFFLD(SSDAT8)
     A            FNESTM    R               COLHDG('Early Sett.' 'Notc Term')
     A                                      REFFLD(SSCOU3)
     A            FNESTC    R               COLHDG('Early Sett.' 'Notc Tm Cd')
     A                                      REFFLD(SSCOD1)
M001 A            DCIND     R               COLHDG('Cmmn of Early' 'Settle Ind')
M001 A                                      REFFLD(SSCOD1)
M001 A            ESDT8     R               COLHDG('Cmmn of E/Sett' 'Date 6')
M001 A                                      REFFLD(SSDAT8)
     A            ODGRC     R               COLHDG('Grace day' 'int lieu ntc')
     A                                      REFFLD(SSCOU3)
     A            LFEXD8    R               COLHDG('Letter of Offer Date')
     A                                      REFFLD(SSDAT8)
M001 A            LODTR     R               COLHDG('Term from L/O Date')
M001 A                                      REFFLD(SSCOU3)
M001 A            LODTC     R               COLHDG('Term Code from' 'L/O Date')
M001 A                                      REFFLD(SSCOD1)
     A            FPREP     R               COLHDG('Subj For' 'Prepaym Fee')
     A                                      REFFLD(SSCOD1)
R1017A            NTCPRP    R               COLHDG('Time Inst' 'Amt cons.Prept')
R1017A                                      REFFLD(SSCOU3)
R1028A            NTCPRF    R               COLHDG('Fee charge' 'Amt prepaid')
R1028A                                      REFFLD(SSCOD1)
R1017A            NTMPRP    R               COLHDG('Inst' 'Made bef.Prept')
R1017A                                      REFFLD(SSCOU3)
     A            FWMTH     R               COLHDG('C/pre pym' 'Pof w/in X mth')
     A                                      REFFLD(SSCOU3)
V001 A            FWFUL     R               COLHDG('Calc. if' 'ful poff within')
V001 A                                      REFFLD(SSCOU3)
     A            FPR1      R               COLHDG('Prepaym Fee' 'Flat Amt')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            FPR2      R               COLHDG('P. Fee' '% Of Amt Prepaid')
     A                                      REFFLD(SSPERD)
     A            FPR3      R               COLHDG('P. Fee' '% Of Loan Amount')
     A                                      REFFLD(SSPERD)
     A            FPR4      R               COLHDG('P. Fee' '% Unexpr Period')
     A                                      REFFLD(SSPERD)
M024 A            FPRP1     R               COLHDG('P. Fee' '% on Int Rebate')
M024 A                                      REFFLD(SSPERD)
SS26 A            FPRBL     R               COLHDG('P. Fee' '% Of Current Bal')
SS26 A                                      REFFLD(SSPERD)
M024 A            FPRP2     R               COLHDG('P. Fee Whichever' -
M024 A                                      'Higher/Lower')
M024 A                                      REFFLD(SSCOD1)
R1002A            MIAFCA    R               COLHDG('Minimum Amt for' +
R1002A                                      'Capital Prepayment')
R1002A                                      REFFLD(SSAMT4)
R1002A            MXAFCA    R               COLHDG('Maximum Amt for ' +
R1002A                                      'Capital Prepayment')
R1002A                                      REFFLD(SSAMT4)
R1006A            FPAWLP    R               COLHDG('Allow if within' +
R1006A                                      'lock in Period' 'C. Prepayment')
R1006A                                      REFFLD(SSCOD1)
R1006A            WAIVER    R               COLHDG('Allow Waiver-' +
R1006A                                      'Capital Prepayment')
R1006A                                      REFFLD(SSCOD1)
V001 A            FPR5      R               COLHDG('Settlem Fee' 'Flat Amt')
V001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
V001 A            FPR6      R               COLHDG('Settlem' '% Of Amt Prepaid')
V001 A                                      REFFLD(SSPERD)
V001 A            FPR7      R               COLHDG('Settlem' '% Of Loan Amount')
V001 A                                      REFFLD(SSPERD)
V001 A            FPR8      R               COLHDG('Settlem' '% Unexpr Period')
V001 A                                      REFFLD(SSPERD)
M024 A            FESM1     R               COLHDG('Settlem' '% on Int Rebate')
M024 A                                      REFFLD(SSPERD)
SS09 A            FERBL     R               COLHDG('Settlem' '% Of Current Bal')
SS09 A                                      REFFLD(SSPERD)
V001 A            FPR9      R               COLHDG('Buy Fee' '% on int rebate')
V001 A                                      REFFLD(SSPERD)
R1002A            MIMEST    R               COLHDG('Minimum Amt for' +
R1002A                                      'Early Settlement')
R1002A                                      REFFLD(SSAMT4)
R1002A            MXMEST    R               COLHDG('Maximum Amt for' +
R1002A                                      'Early Settlement')
R1002A                                      REFFLD(SSAMT4)
R1006A            FESWLP    R               COLHDG('Allow if within' +
R1006A                                      'lock in Period' 'E.Settlement')
R1006A                                      REFFLD(SSCOD1)
R1006A            FESWAI    R               COLHDG('Allow Waiver-' +
R1006A                                      'Early Settlement')
R1006A                                      REFFLD(SSCOD1)
V001 A            FPRTI     R               COLHDG('Tiered' 'Prepayment')
V001 A                                      REFFLD(SSCOD1)
H001 A            FPR10     R               COLHDG('Penalty' 'on int rebate')
H001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
AM01 A            FPR11     R               COLHDG('S. Fee Whichever' -
     A                                      'Higher/Lower')
     A                                      REFFLD(SSCOD1)
     ** Replacement Costs
M001 A*M038       FREPL     R               COLHDG('Subj to' 'Repl Cost')
M038 A            FREPL     R               COLHDG('Subj to' 'Funding loss')
M001 A                                      REFFLD(SSCOD1)
M001 A*M038       FRP1      R               COLHDG('Repl Cost' 'Flat Amt')
M038 A            FRP1      R               COLHDG('Prep F.Loss' 'Flat Amt')
M001 A                                      REFFLD(SSAMT4)
M001 A*M038       FRP2      R               COLHDG('Repl Cst%' 'Of Amt Prepaid')
M038 A            FRP2      R               COLHDG('Prep F.Loss %' -
M038 A                                      'Of Amt Prepaid')
M001 A                                      REFFLD(SSPERD)
M001 A*M038       FRP3      R               COLHDG('Repl Cst%' 'Of LN Amount')
M038 A            FRP3      R               COLHDG('Prep F.Loss %' -
M038 A                                      'Of LN Amount')
M001 A                                      REFFLD(SSPERD)
M001 A*M038       FRP4      R               COLHDG('Repl Cost' 'Flat Amt')
M038 A            FRP4      R               COLHDG('Prep F.Loss' -
M001 A                                      '% Of Unexpr Period')
M001 A*AM01                                 REFFLD(SSAMT4)
AM01 A                                      REFFLD(SSPERD)
AM01 A            FRPP1     R               COLHDG('Prep F. Loss' -
AM01 A                                      '% on Int/Pft Rebate')
     A                                      REFFLD(SSPERD)
SS26 A            FRRBL     R               COLHDG('Prep F.Loss' -
SS26 A                                      '% Of Current Bal')
SS26 A                                      REFFLD(SSPERD)
AM01 A            FRPP2     R               COLHDG('Prep F. Loss' -
     A                                      'Higher/Lower')
M024 A                                      REFFLD(SSCOD1)
R1006A            MIMPRP    R               COLHDG('Minimum Amt for' +
R1006A                                      ' Funding Loss')
R1006A                                      REFFLD(SSAMT4)
R1006A            MXMPRP    R               COLHDG('Maximum Amt for' +
R1006A                                      ' Funding Loss')
R1006A                                      REFFLD(SSAMT4)
R1006A            PRPWLP    R               COLHDG('Allow if within' +
R1006A                                      ' lock in Period' 'Funding Loss')
R1006A                                      REFFLD(SSCOD1)
R1006A            PRPWAI    R               COLHDG('Allow Waiver-' +
R1006A                                      ' Funding Loss')
R1006A                                      REFFLD(SSCOD1)
M001 A*M038       FRP5      R               COLHDG('Repl Cst%' 'Of Amt Settled')
M038 A            FRP5      R               COLHDG('Sett F. Loss' 'Flat Amt')
M001 A*AM01                                 REFFLD(SSPERD)
AM01 A                                      REFFLD(SSAMT4)
M001 A*M038       FRP6      R               COLHDG('Repl Cst%' 'Of Ln Amount')
M038 A            FRP6      R               COLHDG('Sett F. Loss' -
M001 A                                      '% Of Amt Settled')
M001 A                                      REFFLD(SSPERD)
M001 A*M038       FRP7      R               COLHDG('Repl Cst%' 'MMC interface')
M038 A            FRP7      R               COLHDG('Sett F. Loss' -
M001 A                                      '% Of Ln Amount')
M001 A                                      REFFLD(SSPERD)
M038 A            FRP8      R               COLHDG('Sett F. Loss' -
M001 A                                      '% Of Unexpr Period')
M038 A                                      REFFLD(SSPERD)
M038 A            FRP9      R               COLHDG('Sett F. Loss' -
M001 A                                      '% Of Int/Prf Rebate')
M038 A                                      REFFLD(SSPERD)
SS09 A            FSRBL     R               COLHDG('Sett F.Loss %' 'Of' -
SS09 A                                      'Current Bal')
SS09 A                                      REFFLD(SSPERD)
AM01 A            FRP10     R               COLHDG('Sett F. Loss' -
     A                                      'Higher/Lower')
     A                                      REFFLD(SSCOD1)
R1006A            MIMFRP    R               COLHDG('Minimum Amt for' +
R1006A                                      ' S.Funding Loss')
R1006A                                      REFFLD(SSAMT4)
R1006A            MXMFRP    R               COLHDG('Maximum Amt for' +
R1006A                                      ' S.Funding Loss')
R1006A                                      REFFLD(SSAMT4)
R1006A            FRPWLP    R               COLHDG('Allow if within' +
R1006A                                      ' lock in Period' 'S.Funding Loss')
R1006A                                      REFFLD(SSCOD1)
R1006A            FRPWAI    R               COLHDG('Allow Waiver-' +
R1006A                                      ' S.Funding Loss')
R1006A                                      REFFLD(SSCOD1)
     ** Cancellation Fees
     A            FCANC     R               COLHDG('Subj For' 'Cancel. Fee')
     A                                      REFFLD(SSCOD1)
     A            FCA1      R               COLHDG('Cancel Fee' 'Expr Drw Schd')
     A                                      REFFLD(SSPERD)
     A            FCA2      R               COLHDG('Cancel Fee' 'Early Sett.')
     A                                      REFFLD(SSPERD)
V001 A            FCA3      R               COLHDG('ESett Cfee' '% Unexpr Dura')
V001 A                                      REFFLD(SSPERD)
V001 A            FCA4      R               COLHDG('Avail Cfee' '% Of Undrawn')
V001 A                                      REFFLD(SSPERD)
V001 A            FCA5      R               COLHDG('Avail Cfee' '% Unexpr Dura')
V001 A                                      REFFLD(SSPERD)
     ** SIC/UIC Code
     A            LNSIC1    R               COLHDG('SIC Code 1')
     A                                      REFFLD(SSCOD1)
     A            LNSIC2    R               COLHDG('SIC Code 2')
     A                                      REFFLD(SSCOD1)
     A            LNSIC3    R               COLHDG('SIC Code 3')
     A                                      REFFLD(SSCOD1)
     A            LNSIC4    R               COLHDG('SIC Code 4')
     A                                      REFFLD(SSCOD1)
SS01 A            LNSIC5    R               COLHDG('SIC Code 5')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            LNSIC6    R               COLHDG('SIC Code 6')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            LNSIC7    R               COLHDG('SIC Code 7')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            LNSIC8    R               COLHDG('SIC Code 8')
SS01 A                                      REFFLD(SSCOD1)
     A            USER1     R               COLHDG('User Code 1')
M004 A                                      REFFLD(SSCOD3)
     A*M004                                 REFFLD(SSCOD2)
     A            USER2     R               COLHDG('User Code 2')
M004 A                                      REFFLD(SSCOD3)
     A*M004                                 REFFLD(SSCOD1)
     ** Last Transfer Status
M024 A            LTPTYP    R               COLHDG('Last Trf' 'Posting Type')
M024 A                                      REFFLD(SSCOD1)
     ** Previous status
M032 A            PRPTYP    R               COLHDG('Previous' 'Posting Type')
M032 A                                      REFFLD(SSCOD1)
V001 A            PRBKN     R               COLHDG('Previous' 'Bank No.')
V001 A                                      REFFLD(SSBANK)
V001 A            PRBRN     R               COLHDG('Previous' 'Branch No.')
V001 A                                      REFFLD(SSBRAN)
M001 A            PRSTS     R               COLHDG('Previous' 'account status')
M001 A                                      REFFLD(SSCOU1)
M001 A*R1025      PRTYPE    R               COLHDG('Yesterday Loan' 'Type')
R1025A            PRTYPE    R               COLHDG('Previous Loan' 'Type')
M001 A                                      REFFLD(SSPROD)
M001 A*R1025      PRGLBK    R               COLHDG('Yesterday GL Book')
R1025A            PRGLBK    R               COLHDG('Previous GL Book')
M001 A                                      REFFLD(SSCOD1)
V001 A            PRCCTR    R               COLHDG('Previous' 'Cost centre')
V001 A*H001                                 REFFLD(SSCOU3)
H001 A                                      REFFLD(SSCOST)
V001 A            PRPRDC    R               COLHDG('Previous' 'Prod code')
V001 A*H001                                 REFFLD(SSCOU3)
H001 A                                      REFFLD(SSCOST)
V001 A            PRGLGP    R               COLHDG('Previous' 'GL Group Code')
V001 A                                      REFFLD(SSGRUP)
R1025A            PRRESI    R               COLHDG('Previous' 'Resident' -
R1025A                                      'Indicator')
R1025A                                      REFFLD(SSCOD2)
R1025A            PRCUSC    R               COLHDG('Previous' 'Customer' -
R1025A                                      'Category')
R1025A                                      REFFLD(SSCOD2)
R1025A            PRGLAS    R               COLHDG('Previous' 'GL Account' -
R1025A                                      'Status')
R1025A                                      REFFLD(SSCOD2)
R1025A            PRSUBL    R               COLHDG('Previous' 'Sub Ledger Code')
R1025A                                      REFFLD(SSCOU5)
     A*** Last Transfer Date
M024 A            LTPTY8    R               COLHDG('Last Transfer' 'date-PTYP')
M024 A                                      REFFLD(SSDAT8)
M001 A            LTBKD8    R               COLHDG('Last Transfer' 'date-Bank')
M001 A                                      REFFLD(SSDAT8)
M001 A            LTBRD8    R               COLHDG('Last Transfer' 'date-Brch')
M001 A                                      REFFLD(SSDAT8)
M008 A            LTTYP8    R               COLHDG('Last Transfer' 'Date-Type')
M008 A                                      REFFLD(SSDAT8)
M001 A            LTCCD8    R               COLHDG('Last Trnsfr' 'date-CostCr')
M001 A                                      REFFLD(SSDAT8)
M001 A            LTPCD8    R               COLHDG('Last Trnsfr' 'date-PrdtCd')
M001 A                                      REFFLD(SSDAT8)
M001 A            LTGLD8    R               COLHDG('Last Trnsfr' 'date-GLGrp')
M001 A                                      REFFLD(SSDAT8)
M001 A            LTGBD8    R               COLHDG('Last Trnsfr' 'date-GLBk')
M001 A                                      REFFLD(SSDAT8)
R025 A            LTRSD8    R               COLHDG('Last Trnsfr' 'date-ResInd')
R025 A                                      REFFLD(SSDAT8)
R025 A            LTCUD8    R               COLHDG('Last Trnsfr' 'date-CusCat')
R025 A                                      REFFLD(SSDAT8)
R025 A            LTGAD8    R               COLHDG('Last Trnsfr' 'date-GLAcSt')
R025 A                                      REFFLD(SSDAT8)
R025 A            LTSLD8    R               COLHDG('Last Trnsfr' 'date-SubLdg')
R025 A                                      REFFLD(SSDAT8)
     A** STATISTICAL FIELDS
     A** ACCRUAL HISTORY
     A            YSACBL    R               COLHDG('Yesterdays accrual' 'bal')
     A                                      REFFLD(SSAMT4)
     A            YSACRT    R               COLHDG('Yesterdays accrual' 'rate')
     A                                      REFFLD(SSPERD)
R1030A            YSACAR    R               COLHDG('Yesterdays a/c' 'rate')
R1030A                                      REFFLD(SSPERD)
R1030A            YSACDR    R               COLHDG('Yesterdays default' 'rate')
R1030A                                      REFFLD(SSPERD)
SS26 A            YSACMI    R               COLHDG('Yesterdays accrual' 'Mora' -
SS26 A                                      '-Fixed Int Rate')
SS26 A                                      REFFLD(SSPERD)
SS26 A            YSACMM    R               COLHDG('Yesterdays accrual' 'Mora' -
SS26 A                                      '-Fixed Mora Int Rate')
SS26 A                                      REFFLD(SSPERD)
SS26 A            YSMMFI    R               COLHDG('Yesterdays Mora' '- Max' -
SS26 A                                      'Fixed Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YSMMMI    R               COLHDG('Yesterdays Mora' '- Max' -
SS26 A                                      'Mora Int')
SS26 A                                      REFFLD(SSAMT4)
M001 A            YSAVRI    R               COLHDG('Yesterdays' 'Variance')
M001 A                                      REFFLD(SSPERD)
M001 A            YSAVCD    R               COLHDG('Yesterdays Variance' 'Code')
M001 A                                      REFFLD(SSCOD1)
M004 A            YSACYB    R               COLHDG('Yesterdays accr.' 'yr base')
M004 A                                      REFFLD(SSCOU1)
R1034A            YSCFLM    R               COLHDG('Yesterdays C/F accr' -
R1034A                                      'limit')
R1034A                                      REFFLD(SSAMT4)
     A            YSCFBL    R               COLHDG('Yesterdays C/F accr' 'bal')
     A                                      REFFLD(SSAMT4)
     A            YSCFRT    R               COLHDG('Yesterdays C/F accr' 'rate')
     A                                      REFFLD(SSPERD)
M001 A            YSCFEB    R               COLHDG('Yday C/F excess acc' 'bal')
M001 A                                      REFFLD(SSAMT4)
M001 A            YSCFER    R               COLHDG('Yday C/F excess acc' 'rate')
M001 A                                      REFFLD(SSPERD)
M004 A            YSCFYB    R               COLHDG('Yesterdays C/F' 'year base')
M004 A                                      REFFLD(SSCOU1)
     A            YSLCBL    R               COLHDG('Yesterdays L/C accr' 'bal')
     A                                      REFFLD(SSAMT4)
     A            YSLCRT    R               COLHDG('Yesterdays L/C accr' 'rate')
     A                                      REFFLD(SSPERD)
M001 A            YSLCMR    R               COLHDG('Yesterdays L/C' 'Margin')
M001 A                                      REFFLD(SSPERD)
M004 A            YSILCB    R               COLHDG('Yest L/C accr' 'bal-Int')
M004 A                                      REFFLD(SSAMT4)
M004 A            YSILCR    R               COLHDG('Yest L/C accr' 'rate-Int')
M004 A                                      REFFLD(SSPERD)
M001 A            YSILCM    R               COLHDG('Yest L/C' 'Margin-Int')
M001 A                                      REFFLD(SSPERD)
M001 A            YSLCYB    R               COLHDG('Yesterday' 'L/C year base')
M001 A                                      REFFLD(SSCOU1)
     A            YSDLBL    R               COLHDG('Yesterdays DLR accr' 'bal')
     A                                      REFFLD(SSAMT4)
     A            YSDLRT    R               COLHDG('Yesterdays DLR accr' 'rate')
     A                                      REFFLD(SSPERD)
M001 A            YSDLYB    R               COLHDG('Yesterday' 'DLR year base')
M001 A                                      REFFLD(SSCOU1)
     A*---------------- Profit Analysis Fields ----------------
     A            PFEARN    R               COLHDG('Profit period' 'Int earned')
     A                                      REFFLD(SSAMTG)
     A            PPEARN    R               COLHDG('Point to point' 'Int earn')
     A                                      REFFLD(SSAMTG)
SS26 A            PFMEAR    R               COLHDG('Profit period' 'Mora.' -
SS26 A                                      'Int earned')
SS26 A                                      REFFLD(SSAMTG)
SS26 A            PPMEAR    R               COLHDG('Profit to point' 'Mora.' -
SS26 A                                      'Int earned')
SS26 A                                      REFFLD(SSAMTG)
     A            PFLC      R               COLHDG('Profit Period' 'Late Chgs')
     A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
     A            PPLC      R               COLHDG('Point to point' 'L/C earn')
     A*M024                                 REFFLD(SSAMTG)
M024 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
M024 A            PFCF      R               COLHDG('Profit Period' 'Comm Fees')
M024 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
M024 A            PPCF      R               COLHDG('Point to Point' 'Comm Fees')
M024 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
     A            PFEXTF    R               COLHDG('Profit Period' 'Ext Fees')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            PFBAL     R               COLHDG('Profit period' 'Agg Bal')
     A                                      REFFLD(SSAMT4)
     A            PFDAYS    R               COLHDG('Profit period' 'Agg Days')
     A                                      REFFLD(SSCOU5)
AM01 A            PFRMD     R               COLHDG('Profit period' -
     A                                      'Agg Remainder')
AM22 A*                                     REFFLD(SSCOU5)
AM22 A                                      REFFLD(SSAMT4)
     A*-------- Times Restructure/Reschedule/Variation --------
     A            RTCLTD    R               COLHDG('Right to Cures' 'L-T-D')
     A                                      REFFLD(SSCOU3)
     A            RENLTD    R               COLHDG('Times Renewed' 'L-T-D')
     A                                      REFFLD(SSCOU3)
     A            VARLTD    R               COLHDG('Times Restructured' 'L-T-D')
     A                                      REFFLD(SSCOU3)
A001 A            RESLTD    R               COLHDG('Times Rescheduled' 'L-T-D')
A001 A                                      REFFLD(SSCOU3)
     A            EXTLTD    R               COLHDG('Times Extended' 'L-T-D')
     A                                      REFFLD(SSCOU3)
     A            RTCYTD    R               COLHDG('Right to Cures' 'Y-T-D')
     A                                      REFFLD(SSCOU3)
     A            VARYTD    R               COLHDG('Times Restructured' 'Y-T-D')
     A                                      REFFLD(SSCOU3)
     A            RESYTD    R               COLHDG('Times Rescheduled' 'Y-T-D')
     A                                      REFFLD(SSCOU3)
     A            EXTYTD    R               COLHDG('Times Extended' 'Y-T-D')
     A                                      REFFLD(SSCOU3)
     A            VARPRE    R               COLHDG('Times Restructur' 'Last Yr')
     A                                      REFFLD(SSCOU3)
     A            RESPRE    R               COLHDG('Times Reschedule' 'Last Yr')
     A                                      REFFLD(SSCOU3)
     A            EXTPRE    R               COLHDG('Times Extended' 'Last Yr')
     A                                      REFFLD(SSCOU3)
SS26 A*-------- Times NPL -------------------------------------
SS26 A            NPLLTD    R               COLHDG('Times NPL' 'L-T-D')
SS26 A                                      REFFLD(SSCOU3)
SS26 A            NPLYTD    R               COLHDG('Times NPL' 'Y-T-D')
SS26 A                                      REFFLD(SSCOU3)
SS26 A            NPLPRE    R               COLHDG('Times NPL' 'Last Yr')
SS26 A                                      REFFLD(SSCOU3)
SS26 A*-------- Times AKPK-------------------------------------
SS26 A            AKPLTD    R               COLHDG('Times AKPK' 'L-T-D')
SS26 A                                      REFFLD(SSCOU3)
SS26 A            AKPYTD    R               COLHDG('Times AKPK' 'Y-T-D')
SS26 A                                      REFFLD(SSCOU3)
SS26 A            AKPPRE    R               COLHDG('Times AKPK' 'Last Yr')
SS26 A                                      REFFLD(SSCOU3)
SS31 A*-------- Times EXCESS (OD) -----------------------------
SS31 A            EXCLTD    R               COLHDG('Times Excess' 'L-T-D')
SS31 A                                      REFFLD(SSCOU3)
SS31 A            EXCYTD    R               COLHDG('Times Excess' 'Y-T-D')
SS31 A                                      REFFLD(SSCOU3)
SS31 A            EXCPRE    R               COLHDG('Times Excess' 'Last Yr')
SS31 A                                      REFFLD(SSCOU3)
     A*----------PAST DUE (10,30,60,90)------------------------
     A            CPD10     R               COLHDG('Times Past' 'Due 10-29')
     A                                      REFFLD(SSCOU3)
     A            CPD30     R               COLHDG('Times Past' 'Due 30-59')
     A                                      REFFLD(SSCOU3)
     A            CPD60     R               COLHDG('Times Past' 'Due 60-89')
     A                                      REFFLD(SSCOU3)
     A            CPD90     R               COLHDG('Times Past' 'Due 90 +')
     A                                      REFFLD(SSCOU3)
     A            PPD10     R               COLHDG('Last Year' 'Past Due 10-29')
     A                                      REFFLD(SSCOU3)
     A            PPD30     R               COLHDG('Last Year' 'Past Due 30-59')
     A                                      REFFLD(SSCOU3)
     A            PPD60     R               COLHDG('Last Year' 'Past Due 60-89')
     A                                      REFFLD(SSCOU3)
     A            PPD90     R               COLHDG('Last Year' 'Past Due 90 +')
     A                                      REFFLD(SSCOU3)
     A            LPD10     R               COLHDG('L-T-D' 'Past Due 10-29')
     A                                      REFFLD(SSCOU3)
     A            LPD30     R               COLHDG('L-T-D' 'Past Due 30-59')
     A                                      REFFLD(SSCOU3)
     A            LPD60     R               COLHDG('L-T-D' 'Past Due 60-89')
     A                                      REFFLD(SSCOU3)
     A            LPD90     R               COLHDG('L-T-D' 'Past Due 90 +')
     A                                      REFFLD(SSCOU3)
R1023A            LTDMOD    R               COLHDG('L-T-D' 'Maximum Days' -
R1023A                                      'Past Due')
R1023A                                      REFFLD(SSCOU5)
R1039A            LTDMOM    R               COLHDG('L-T-D' 'Maximum Mths' -
R1039A                                      'Past Due')
R1039A                                      REFFLD(SSCOU5)
R1002A            NOTROL    R               COLHDG('Number of' +
R1002A                                      'times rollover')
R1002A                                      REFFLD(SSCOU3)
R1002A            NOTCRT    R               COLHDG('No of Time' +
R1002A                                      'Cheque Return')
R1002A                                      REFFLD(SSCOU3)
     A* ------LAST YEAR / OPENING -------------
     A            INTPRE    R               COLHDG('Int Paid' 'Last Year')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LCPRE     R               COLHDG('LC paid' 'Last Year')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            IRSPRE    R               COLHDG('IRS Interest' 'Last year')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            ORGPRE    R               COLHDG('Org fees' 'last year')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            PREACC    R               COLHDG('Accrued Int' 'at Year End')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            PREDSC    R               COLHDG('Int Rebate' 'at Year End')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     ** Advance Earnings
V001 A            ADVACC    R               COLHDG('Advance' 'Accrue Interest')
V001 A                                      REFFLD(SSAMTG)
V001 A            ADVPEN    R               COLHDG('Advance' 'Accrue L/Charges')
V001 A                                      REFFLD(SSAMTG)
V001 A            ADVCOM    R               COLHDG('Advance' 'Accrue Com Fees')
V001 A                                      REFFLD(SSAMTG)
MG   A            ADVERN    R               COLHDG('Advance' 'Earned Interest')
MG   A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
MG   A            ADVDLR    R               COLHDG('Advance' 'Dealer Acc Int')
MG   A                                      REFFLD(SSAMTG)
MG   A            ADVSAC    R               COLHDG('Adv sus' 'Accrue Interest')
MG   A                                      REFFLD(SSAMTG)
MG   A            ADVSER    R               COLHDG('Adv Sus' 'Earned Interest')
MG   A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
MG   A            ADVSPE    R               COLHDG('Adv Sus' 'Acc L/C Interest')
MG   A                                      REFFLD(SSAMTG)
     ** Per Day Accruals
     A            PDIEM     R               COLHDG('Daily' 'Accrual')
     A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
M004 A            PDACLC    R               COLHDG('Daily' 'Accr Late Chg')
M004 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
M004 A            PDACCF    R               COLHDG('Daily' 'Accr Comm Fee')
M004 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
M004 A            PDACDL    R               COLHDG('Daily' 'Dealer Accr')
M004 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
     A*** Today  -------------------
V001 A            TDACCI    R               COLHDG('Today' 'Accrued Int')
V001 A                                      REFFLD(SSAMTG)
V001 A            TDACLC    R               COLHDG('Today' 'Accrued L/C')
V001 A                                      REFFLD(SSAMTG)
V001 A            TDACCF    R               COLHDG('Today' 'Acc Com Fee')
V001 A                                      REFFLD(SSAMTG)
V001 A            TDACDL    R               COLHDG('Today' 'Dealer Accrue')
V001 A                                      REFFLD(SSAMTG)
     A*** YESTERDAY ----------------
     A            YSOBAL    R               COLHDG('Yesterday' 'O/S Bal')
     A                                      REFFLD(SSAMT4)
     A            YSCBAL    R               COLHDG('Yesterday' 'Current Balanc-
     A                                      e')
     A                                      REFFLD(SSAMT4)
     A            YSACCI    R               COLHDG('Yesterdays' 'Accrued Int')
     A                                      REFFLD(SSAMTG)
SS26 A            YSRINT    R               COLHDG('Yesterdays' 'Restructured' -
SS26 A                                      'Interest')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YSMINT    R               COLHDG('Yesterdays' 'Moratorium' -
SS26 A                                      'Interest')
SS26 A                                      REFFLD(SSAMTG)
SS26 A            YSRLC     R               COLHDG('Yesterdays' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMTG)
M001 A            YSASLC    R               COLHDG('Yesterdays' 'Assessed LC')
M001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M001 A            YSPDLC    R               COLHDG('Yesterdays' 'Paid LC')
M001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M004 A            YSPENI    R               COLHDG('Yesterdays' 'Penalty Int')
M004 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
V001 A            YSACLC    R               COLHDG('Yesterdays' 'Accrued L/C')
V001 A                                      REFFLD(SSAMTG)
V001 A            YSACCF    R               COLHDG('Yesterdays' 'Acc Com Fee')
V001 A                                      REFFLD(SSAMTG)
V001 A            YSACDL    R               COLHDG('Yesterdays' 'Dealer Accrue')
V001 A                                      REFFLD(SSAMTG)
     A            YSIREB    R               COLHDG('Yesterdays' 'Int rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YSIRE2    R               COLHDG('Yesterdays' 'Int rebate 2')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YSDREB    R               COLHDG('Yesterday' 'Dealer rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YSCREB    R               COLHDG('Yesterdays' 'CL rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YSAREB    R               COLHDG('Yesterdays' 'A&H Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YSMREB    R               COLHDG('Yesterdays' 'Misc Ins reb')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YSOTHC    R               COLHDG('Yesterdays' 'Other Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
V001 A            YSMISC    R               COLHDG('Yesterdays' 'Misc Cost')
V001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS12 A            YSDRRB    R               COLHDG('Yesterday Dealer' +
SS12 A                                                'Comm Rebate')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            YSSDRB    R               COLHDG('Yesterday Sub-Dlr' +
SS12 A                                                'Comm Rebate')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            YSSMRB    R               COLHDG('Yesterday Salesman' +
SS12 A                                                'Comm Rebate')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            YSCBRB    R               COLHDG('Yesterday Cash' +
SS12 A                                                'Back Rebate')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            YSAARB    R               COLHDG('Yesterday Anti' +
SS12 A                                                '-Attrition' 'Rebate')
SS12 A                                      REFFLD(SSAMT4)
     A*-------- LAST MONTH ----------------------
     A            LMOSBL    R               COLHDG('Previous Mth' 'O/S')
     A                                      REFFLD(SSAMT4)
M001 A            LMCBAL    R               COLHDG('Last month' 'end CBAL')
M001 A                                      REFFLD(SSAMT4)
M001 A            LMACRI    R               COLHDG('Last month' 'ACCINT')
M001 A*M039                                 REFFLD(SSAMT4)
M039 A                                      REFFLD(SSAMTG)
SS26 A            LMRSIN    R               COLHDG('Last month' 'Restructured' -
SS26 A                                      'Interest')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LMMOIN    R               COLHDG('Last month' 'Moratorium' -
SS26 A                                      'Interest')
SS26 A                                      REFFLD(SSAMTG)
SS26 A            LMRSLC    R               COLHDG('Last month' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMT4)
M001 A            LMASLC    R               COLHDG('Last mth-end' 'Assessed LC')
M001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M001 A            LMPDLC    R               COLHDG('Last mth-end' 'Paid LC')
M001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M001 A            LMOTHC    R               COLHDG('Last mth-end' 'Other Chgs')
M001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M001 A            LMMISC    R               COLHDG('Last mth-end' 'Misc. Chgs')
M001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M001 A            LMCOMA    R               COLHDG('Last mth' 'Comm Acc Int')
M001 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
M001 A            LMPENI    R               COLHDG('Last mth' 'Acc LC')
M001 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
M001 A            LMDDLR    R               COLHDG('Last MTD' 'dealer acc')
M001 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
     A            LMPROV    R               COLHDG('Last Month' 'Provision')
     A                                      REFFLD(SSAMT4)
     A            LMISUP    R               COLHDG('Previous Mth' 'Int. in Sus')
     A                                      REFFLD(SSAMT4)
     A            LMIREB    R               COLHDG('Last mth end' 'Int rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LMIRE2    R               COLHDG('Last mth end' 'Int reb 2')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LMDREB    R               COLHDG('Last mth end' 'Dealer reb')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LMCREB    R               COLHDG('Last mth end' 'CL rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LMAREB    R               COLHDG('Last mth end' 'A&H Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LMMREB    R               COLHDG('Last mth end' 'Mis Ins reb')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS12 A            LMDRRB    R               COLHDG('Beginning mth' +
SS12 A                                                'Dealer Comm Rebate')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LMSDRB    R               COLHDG('Beginning mth Sub-' +
SS12 A                                                'Dealer Comm Rebate')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LMSMRB    R               COLHDG('Beginning mth Sales' +
SS12 A                                                'man Comm Rebate')
SS12 A                                      REFFLD(SSAMT4)
     A*-------- LAST YEAR  ----------------------
OS01 A            LYOSBL    R               COLHDG('Previous year' 'O/S')
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYCBAL    R               COLHDG('Last year' 'end CBAL')
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYACRI    R               COLHDG('Last year' 'ACCINT')
OS01 A                                      REFFLD(SSAMTG)
SS26 A            LYRINT    R               COLHDG('Last year' 'Restructured' -
SS26 A                                      'Interest')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LYMINT    R               COLHDG('Last year' 'Moratorium' -
SS26 A                                      'Interest')
SS26 A                                      REFFLD(SSAMTG)
SS26 A            LYRLC     R               COLHDG('Last year' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMT4)
OS01 A            LYASLC    R               COLHDG('Last yr-end' 'Assessed LC')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYPDLC    R               COLHDG('Last yr-end' 'Paid LC')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYOTHC    R               COLHDG('Last yr-end' 'Other Chgs')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYMISC    R               COLHDG('Last yr-end' 'Misc. Chgs')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYCOMA    R               COLHDG('Last yr' 'Comm Acc Int')
OS01 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
OS01 A            LYPENI    R               COLHDG('Last year' 'Acc LC')
OS01 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
OS01 A            LYDDLR    R               COLHDG('Last Year' 'dealer acc')
OS01 A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
OS01 A            LYPROV    R               COLHDG('Last Year' 'Provision')
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYISUP    R               COLHDG('Last Year' 'Int. in Susp')
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYIREB    R               COLHDG('Last year end' 'Int rebate')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYIRE2    R               COLHDG('Last year end' 'Int reb 2')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYDREB    R               COLHDG('Prev Year' 'Dealer Rebate')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYCREB    R               COLHDG('Last year end' 'CL rebate')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYAREB    R               COLHDG('Last year end' 'A&H Rebate')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LYMREB    R               COLHDG('Last yr end' 'Mis Ins reb')
OS01 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS15 A            LYDRRB    R               COLHDG('Last Year' 'Dealer Rebate')
SS15 A                                      REFFLD(SSAMT4)
SS15 A            LYSDRB    R               COLHDG('Last Year' 'SDealer Rebate')
SS15 A                                      REFFLD(SSAMT4)
SS15 A            LYSMRB    R               COLHDG('Last Year' 'Saleman Rebate')
SS15 A                                      REFFLD(SSAMT4)
     A*-------- LAST YEAR -----------------------
     A            OPNBAL    R               COLHDG('Yearly' 'Opening Bal.')
     A                                      REFFLD(SSAMT4)
     A            OPISUP    R               COLHDG('Opening' 'Int. in Susp')
     A                                      REFFLD(SSAMT4)
     A** STATISTIC
     A** MTD
     A            MTDINT    R               COLHDG('MTD int paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            MTDRIN    R               COLHDG('MTD Restructured' 'int' -
SS26 A                                      'paid')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDMIN    R               COLHDG('MTD Moratorium' 'int' -
SS26 A                                      'paid')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDRLC    R               COLHDG('MTD Restructured' 'L/C' -
SS26 A                                      'paid')
SS26 A                                      REFFLD(SSAMT4)
     A            MTDPRN    R               COLHDG('MTD principal paid')
     A*M001                                 REFFLD(SSAMT3)
M001 A                                      REFFLD(SSAMT4)
     A            MTDLC     R               COLHDG('MTD LC paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M008 A            MTDCF     R               COLHDG('MTD CF paid')
M008 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDMSC    R               COLHDG('MTD misc chg paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDOTH    R               COLHDG('MTD other chg paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            MTDVAT    R               COLHDG('MTD VAT' 'Paid')
SS26 A                                      REFFLD(SSAMT4)
SS12 A            MDRCMP    R               COLHDG('MTD Dealer' +
SS12 A                                                'Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            MSDCMP    R               COLHDG('MTD Sub-Dealer' +
SS12 A                                                'Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
     A            MTDPMR    R               COLHDG('MTD payments' 'received')
M001 A                                      REFFLD(SSAMT4)
     A*M001                                 REFFLD(SSAMT3)
     A            MTDRDM    R               COLHDG('MTD redemption')
     A*M001                                 REFFLD(SSAMT3)
M001 A                                      REFFLD(SSAMT4)
M017 A            MTDPOF    R               COLHDG('MTD' 'prepayment/payoff')
M017 A                                      REFFLD(SSAMT4)
     A            MTDREL    R               COLHDG('MTD' 'Amount Release')
     A                                      REFFLD(SSAMT4)
     A            MTDIDB    R               COLHDG('MTD accr int debit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDLDB    R               COLHDG('MTD late chg debit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M008 A            MTDCDB    R               COLHDG('MTD com fee debit')
M008 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDMDB    R               COLHDG('MTD misc chg debit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDODB    R               COLHDG('MTD other chg debit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            MTDRED    R               COLHDG('MTD Restrutured' 'Int' -
SS26 A                                      'debit')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDMID    R               COLHDG('MTD Moratorium' 'Int' -
SS26 A                                      'debit')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDRLD    R               COLHDG('MTD Restrutured' 'L/C' -
SS26 A                                      'debit')
SS26 A                                      REFFLD(SSAMT4)
M019 A            MTDWPN    R               COLHDG('MTD Waived principal')
M019 A                                      REFFLD(SSAMT4)
M019 A            MTDWIN    R               COLHDG('MTD Waived' 'Int./Profit')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            MTDWLC    R               COLHDG('MTD Waived' 'Late Charge')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            MTDWOC    R               COLHDG('MTD Waived OTHCHG')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            MTDWMC    R               COLHDG('MTD Waived' 'Misc. Cost')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            MTDWCM    R               COLHDG('MTD Waived' 'Comm. Fee')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            MTDWBK    R               COLHDG('MTD Waived' 'Bank Discount')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            MTDWAL    R               COLHDG('MTD Waived Assess LC')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            MTDWRI    R               COLHDG('MTD Waived' 'Restructured' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDWMI    R               COLHDG('MTD Waived' 'Moratorium' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDWRL    R               COLHDG('MTD Waived' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMT4)
SS26 A*WRITE OFF
SS26 A            MTDOPN    R               COLHDG('MTD Write Off' 'principal')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDOIN    R               COLHDG('MTD Write Off'  'Int./-
SS26 A                                      Profit')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDOLC    R               COLHDG('MTD Write Off' 'Late -
SS26 A                                      Charge')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDOOC    R               COLHDG('MTD Write Off' 'OTHCHG')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDOMC    R               COLHDG('MTD Write Off' 'Misc. Cost')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDOCM    R               COLHDG('MTD Write Off' 'Comm. Fee')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDOBK    R               COLHDG('MTD Write Off' 'Bank -
SS26 A                                      Discount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDOAL    R               COLHDG('MTD Write Off' 'Assess LC')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDORI    R               COLHDG('MTD Write Off' -
SS26 A                                      'Restructured Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDOMI    R               COLHDG('MTD Write Off' -
SS26 A                                      'Moratorium Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDORL    R               COLHDG('MTD Write Off' -
SS26 A                                      'Restructured L/C')
SS26 A                                      REFFLD(SSAMT4)
     **AM01
     A            MTDAPN    R               COLHDG('MTD Adj' 'Principal')
     A                                      REFFLD(SSAMT4)
     A            MTDAIN    R               COLHDG('MTD Adj' 'Int/Pft')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDRIB    R               COLHDG('MTD Adj' 'Int/Pft Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDALC    R               COLHDG('MTD Adj' 'Accr LC')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDAOC    R               COLHDG('MTD Adj' 'Other Charge')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDAMC    R               COLHDG('MTD Adj' 'MISC Cost')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDACM    R               COLHDG('MTD Adj' 'CF')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDABK    R               COLHDG('MTD Adj' 'Bank Discount')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            MTDAAL    R               COLHDG('MTD Adj' 'Accessed LC')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            MTDARI    R               COLHDG('MTD Adj' 'Restructured' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDAMI    R               COLHDG('MTD Adj' 'Moratorium' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            MTDARL    R               COLHDG('MTD Adj' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMT4)
SS16 A            MTDRDL    R               COLHDG('MTD Cumulative' -
SS16 A                                      'Redraw Limit')
SS16 A                                      REFFLD(SSAMT4)
SS16 A            MTDRDU    R               COLHDG('MTD Cumulative' -
SS16 A                                      'Redraw Utilisation')
SS16 A                                      REFFLD(SSAMT4)
R1023A            MTDMOD    R               COLHDG('MTD Maximum Days' -
R1023A                                      'Past Due')
R1023A                                      REFFLD(SSCOU5)
R1039A            MTDMOM    R               COLHDG('MTD Maximum Mths' -
R1039A                                      'Past Due')
R1039A                                      REFFLD(SSCOU5)
     **
     A** YTD
     A            YTDINT    R               COLHDG('YTD' 'Interest Paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            YTDRIN    R               COLHDG('YTD Restructured' 'int' -
SS26 A                                      'paid')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDMIN    R               COLHDG('YTD Moratorium' 'int' -
SS26 A                                      'paid')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDRLC    R               COLHDG('YTD Restructured' 'L/C' -
SS26 A                                      'paid')
SS26 A                                      REFFLD(SSAMT4)
     A            YTDPRN    R               COLHDG('YTD' ' Principal Paid')
     A*M001                                 REFFLD(SSAMT3)
M001 A                                      REFFLD(SSAMT4)
     A            YTDLC     R               COLHDG('YTD' 'Late chgs Paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M008 A            YTDCF     R               COLHDG('YTD' 'Com Fees Paid')
M008 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDMSC    R               COLHDG('YTD misc chg paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDOTH    R               COLHDG('YTD other chg paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            YTDVAT    R               COLHDG('YTD VAT' 'Paid')
SS26 A                                      REFFLD(SSAMT4)
SS12 A            YDRCMP    R               COLHDG('YTD Dealer' +
SS12 A                                                'Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            YSDCMP    R               COLHDG('YTD Sub-Dealer' +
SS12 A                                                'Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
     A            YTDPMR    R               COLHDG('YTD payms' 'received')
     A*M001                                 REFFLD(SSAMT3)
M001 A                                      REFFLD(SSAMT4)
     A            YTDRDM    R               COLHDG('YTD redemption')
     A*M001                                 REFFLD(SSAMT3)
M001 A                                      REFFLD(SSAMT4)
M017 A            YTDPOF    R               COLHDG('YTD' 'prepayment/payoff')
M017 A                                      REFFLD(SSAMT4)
     A            YTDREL    R               COLHDG('YTD' 'Amount Release')
     A                                      REFFLD(SSAMT4)
     A            YTDIDB    R               COLHDG('YTD accr int debit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDLDB    R               COLHDG('YTD late chg debit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M008 A            YTDCDB    R               COLHDG('YTD com fee debit')
M008 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDMDB    R               COLHDG('YTD misc chg debit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDODB    R               COLHDG('YTD other chg debit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            YTDRED    R               COLHDG('YTD Restrutured' 'Int' -
SS26 A                                      'debit')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDMID    R               COLHDG('YTD Moratorium' 'Int' -
SS26 A                                      'debit')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDRLD    R               COLHDG('YTD Restrutured' 'L/C' -
SS26 A                                      'debit')
SS26 A                                      REFFLD(SSAMT4)
R1026A            YTDINC    R               COLHDG('YTD Income')
R1026A*R1053                                REFFLD(SSAMT4)
R1053A                                      REFFLD(SSAMTG)
R1026A            YTDMXI    R               COLHDG('YTD Maximum Income')
R1026A*R1053                                REFFLD(SSAMT4)
R1053A                                      REFFLD(SSAMTG)
     A*
M019 A            YTDWPN    R               COLHDG('YTD Waived principal')
M019 A                                      REFFLD(SSAMT4)
M019 A            YTDWIN    R               COLHDG('YTD Waived' 'Int./Profit')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            YTDWLC    R               COLHDG('YTD Waived' 'Late Charge')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            YTDWOC    R               COLHDG('YTD Waived OTHCHG')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            YTDWMC    R               COLHDG('YTD Waived' 'Misc. Cost')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            YTDWCM    R               COLHDG('YTD Waived' 'Comm. Fee')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            YTDWBK    R               COLHDG('YTD Waived BNKDISC')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            YTDWAL    R               COLHDG('YTD Waived Assess LC')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            YTDWRI    R               COLHDG('YTD Waived' 'Restructured' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDWMI    R               COLHDG('YTD Waived' 'Moratorium' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDWRL    R               COLHDG('YTD Waived' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMT4)
SS26 A*WRITE OFF
SS26 A            YTDOPN    R               COLHDG('YTD Write Off' 'principal')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDOIN    R               COLHDG('YTD Write Off'  'Int./-
SS26 A                                      Profit')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDOLC    R               COLHDG('YTD Write Off' 'Late -
SS26 A                                      Charge')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDOOC    R               COLHDG('YTD Write Off' 'OTHCHG')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDOMC    R               COLHDG('YTD Write Off' 'Misc. Cost')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDOCM    R               COLHDG('YTD Write Off' 'Comm. Fee')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDOBK    R               COLHDG('YTD Write Off' 'Bank -
SS26 A                                      Discount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDOAL    R               COLHDG('YTD Write Off' 'Assess LC')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDORI    R               COLHDG('YTD Write Off' -
SS26 A                                      'Restructured Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDOMI    R               COLHDG('YTD Write Off' -
SS26 A                                      'Moratorium Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDORL    R               COLHDG('YTD Write Off' -
SS26 A                                      'Restructured L/C')
SS26 A                                      REFFLD(SSAMT4)
     **AM01
     A            YTDAPN    R               COLHDG('YTD Adj' 'Principal')
     A                                      REFFLD(SSAMT4)
     A            YTDAIN    R               COLHDG('YTD Adj' 'Int/Pft')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDRIB    R               COLHDG('YTD Adj' 'Int/Pft Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDALC    R               COLHDG('YTD Adj' 'Accr LC')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDAOC    R               COLHDG('YTD Adj' 'Other Charge')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDAMC    R               COLHDG('YTD Adj' 'MISC Cost')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDACM    R               COLHDG('YTD Adj' 'CF')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDABK    R               COLHDG('YTD Adj' 'Bank Discount')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            YTDAAL    R               COLHDG('YTD Adj' 'Accessed LC')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            YTDARI    R               COLHDG('YTD Adj' 'Restructured' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDAMI    R               COLHDG('YTD Adj' 'Moratorium' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            YTDARL    R               COLHDG('YTD Adj' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMT4)
SS16 A            YTDRDL    R               COLHDG('YTD Cumulative' -
SS16 A                                      'Redraw Limit')
SS16 A                                      REFFLD(SSAMT4)
SS16 A            YTDRDU    R               COLHDG('YTD Cumulative' -
SS16 A                                      'Redraw Utilisation')
SS16 A                                      REFFLD(SSAMT4)
     **
     A** LTD
     A            INTLTD    R               COLHDG('LTD' 'Interest Paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LTDRIN    R               COLHDG('LTD Restructured' 'int' -
SS26 A                                      'paid')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDMIN    R               COLHDG('LTD Moratorium' 'int' -
SS26 A                                      'paid')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDRLC    R               COLHDG('LTD Restructured' 'L/C' -
SS26 A                                      'paid')
SS26 A                                      REFFLD(SSAMT4)
     A            LTDPRN    R               COLHDG('LTD principal paid')
     A                                      REFFLD(SSAMT4)
M005 A            LTDLC     R               COLHDG('LTD LC paid')
M005 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M008 A            LTDCF     R               COLHDG('LTD CF paid')
M008 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LTDMSC    R               COLHDG('LTD misc chg paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LTDOTH    R               COLHDG('LTD other chg paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LTDVAT    R               COLHDG('LTD VAT' 'Paid')
SS26 A                                      REFFLD(SSAMT4)
SS12 A            DLCOPD    R               COLHDG('LTD Dealer Comm Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            SDCOPD    R               COLHDG('LTD Sub-Dealer' 'Comm Paid')
SS12 A                                      REFFLD(SSAMT4)
     A            LTDPMR    R               COLHDG('LTD payms' 'received')
     A                                      REFFLD(SSAMT4)
     A            LTDRDM    R               COLHDG('LTD redemption')
     A                                      REFFLD(SSAMT4)
M017 A            LTDPOF    R               COLHDG('LTD' 'prepayment/payoff')
M017 A                                      REFFLD(SSAMT4)
     A            LTDIDB    R               COLHDG('LTD accr int debit')
     A                                      REFFLD(SSAMT4)
     A            LTDLDB    R               COLHDG('LTD late chg debit')
     A                                      REFFLD(SSAMT4)
M008 A            LTDCDB    R               COLHDG('LTD com fee debit')
M008 A                                      REFFLD(SSAMT4)
     A            LTDMDB    R               COLHDG('LTD misc chg debit')
     A                                      REFFLD(SSAMT4)
     A            LTDODB    R               COLHDG('LTD other chg debit')
     A                                      REFFLD(SSAMT4)
SS26 A            LTDRED    R               COLHDG('LTD Restrutured' 'Int' -
SS26 A                                      'debit')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDMID    R               COLHDG('LTD Moratorium' 'Int' -
SS26 A                                      'debit')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDRLD    R               COLHDG('LTD Restrutured' 'L/C' -
SS26 A                                      'debit')
SS26 A                                      REFFLD(SSAMT4)
R1026A            LTDINC    R               COLHDG('LTD Income')
R1026A*R1053                                REFFLD(SSAMT4)
R1053A                                      REFFLD(SSAMTG)
R1026A            LTDMXI    R               COLHDG('LTD Maximum Income')
R1026A*R1053                                REFFLD(SSAMT4)
R1053A                                      REFFLD(SSAMTG)
     A            CPLTD     R               COLHDG('LTD capital' 'repayment')
     A                                      REFFLD(SSAMT4)
     A            EXTFEL    R               COLHDG('LTD' 'Extension Fees')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            IRSLTD    R               COLHDG('LTD' 'IRS Interest')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            ORGLTD    R               COLHDG('LTD' 'Org fees')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            EXTMTH    R               COLHDG('LTD' 'Months Extended')
     A                                      REFFLD(SSCOU3)
M019 A            LTDWPN    R               COLHDG('LTD Waived principal')
M019 A                                      REFFLD(SSAMT4)
M019 A            LTDWIN    R               COLHDG('LTD Waived' 'Int./Profit')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            LTDWLC    R               COLHDG('LTD Waived' 'Late Charge')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            LTDWOC    R               COLHDG('LTD Waived OTHCHG')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            LTDWMC    R               COLHDG('LTD Waived' 'Misc. Cost')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            LTDWCM    R               COLHDG('LTD Waived' 'Comm. Fee')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            LTDWBK    R               COLHDG('LTD Waived' 'Bank Discount')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M019 A            LTDWAL    R               COLHDG('LTD Waived Assess LC')
M019 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LTDWRI    R               COLHDG('LTD Waived' 'Restructured' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDWMI    R               COLHDG('LTD Waived' 'Moratorium' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDWRL    R               COLHDG('LTD Waived' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMT4)
SS26 A*WRITE OFF
SS26 A            LTDOPN    R               COLHDG('LTD Write Off' 'principal')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDOIN    R               COLHDG('LTD Write Off'  'Int./-
SS26 A                                      Profit')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDOLC    R               COLHDG('LTD Write Off' 'Late -
SS26 A                                      Charge')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDOOC    R               COLHDG('LTD Write Off' 'OTHCHG')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDOMC    R               COLHDG('LTD Write Off' 'Misc. Cost')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDOCM    R               COLHDG('LTD Write Off' 'Comm. Fee')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDOBK    R               COLHDG('LTD Write Off' 'Bank -
SS26 A                                      Discount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDOAL    R               COLHDG('LTD Write Off' 'Assess LC')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDORI    R               COLHDG('LTD Write Off' -
SS26 A                                      'Restructured Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDOMI    R               COLHDG('LTD Write Off' -
SS26 A                                      'Moratorium Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDORL    R               COLHDG('LTD Write Off' -
SS26 A                                      'Restructured L/C')
SS26 A                                      REFFLD(SSAMT4)
     **AM01
     A            LTDAPN    R               COLHDG('LTD Adj' 'Principal')
     A                                      REFFLD(SSAMT4)
     A            LTDAIN    R               COLHDG('LTD Adj' 'Int/Pft')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LTDRIB    R               COLHDG('LTD Adj' 'Int/Pft Rabate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LTDALC    R               COLHDG('LTD Adj' 'Accr LC')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LTDAOC    R               COLHDG('LTD Adj' 'Other Charge')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LTDAMC    R               COLHDG('LTD Adj' 'MISC Cost')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LTDACM    R               COLHDG('LTD Adj' 'CF')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LTDABK    R               COLHDG('LTD Adj' 'Bank Discount')
     A*OS01                                 REFFLD(SSAMT3)
TS01 A                                      REFFLD(SSAMT4)
     A            LTDAAL    R               COLHDG('LTD Adj' 'Accessed LC')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LTDARI    R               COLHDG('LTD Adj' 'Restructured' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDAMI    R               COLHDG('LTD Adj' 'Moratorium' -
SS26 A                                      'Int')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LTDARL    R               COLHDG('LTD Adj' 'Restructured' -
SS26 A                                      'L/C')
SS26 A                                      REFFLD(SSAMT4)
SS16 A            LTDRDL    R               COLHDG('LTD Cumulative' -
SS16 A                                      'Redraw Limit')
SS16 A                                      REFFLD(SSAMT4)
SS16 A            LTDRDU    R               COLHDG('LTD Cumulative' -
SS16 A                                      'Redraw Utilisation')
SS16 A                                      REFFLD(SSAMT4)
     **
AM01 A            LTDPFB    R               COLHDG('LTD Int/Pft Period' 'Agg -
     A                                      Bal')
     A                                      REFFLD(SSAMT4)
AM01 A            LTDPFD    R               COLHDG('LTD Int/Pft Period' 'Agg -
     A                                      Day')
     A                                      REFFLD(SSCOU5)
AM01 A            LTDPFR    R               COLHDG('LTD Int/Pft Period' 'Agg -
     A                                      Remainder')
     A*AM20                                 REFFLD(SSAMT4)
AM20 A*AM22                                 REFFLD(SSCOU5)
AM22 A                                      REFFLD(SSAMT4)
     A*** STATEMENTS
     A            STMDT8    R               COLHDG('Date Last' 'Statement')
     A                                      REFFLD(SSDAT8)
     A            STMBAL    R               COLHDG('Balance' 'Last Statement')
     A                                      REFFLD(SSAMT4)
     A            STCYC     R               COLHDG('Statement cycle')
     A                                      REFFLD(SSCYCL)
     A            STCODE    R               COLHDG('Statement code')
     A                                      REFFLD(SSCOD2)
M001 A            PSTOSB    R               COLHDG('Running' 'O/S Bal')
M001 A                                      REFFLD(SSAMT4)
M004 A            PSTODR    R               COLHDG('History Posting' 'Order')
M004 A                                      REFFLD(SSCOU5)
     A*** FLOAT TOTAL INFO ***
     A            TTFLOT    R               COLHDG('Total Accrual Float')
     A                                      REFFLD(SSAMT4)
     A            TTFLAV    R               COLHDG('Tot Availability' 'Float')
     A                                      REFFLD(SSAMT4)
     A            TTFLCA    R               COLHDG('Total Cash Float')
     A                                      REFFLD(SSAMT4)
     A            TTOC      R               COLHDG('Total' 'OC amount')
     A                                      REFFLD(SSAMT4)
     A            TTOCP     R               COLHDG('Total' 'OCP amount')
     A                                      REFFLD(SSAMT4)
     A            TTODOC    R               COLHDG('Total' 'OD/OC amount')
     A                                      REFFLD(SSAMT4)
     A            TTMC      R               COLHDG('Total' 'MC amount')
     A                                      REFFLD(SSAMT4)
     A            TTIBT     R               COLHDG('Total' 'IBT amount')
     A                                      REFFLD(SSAMT4)
     A            TTLLC     R               COLHDG('Total' 'LLC amount')
     A                                      REFFLD(SSAMT4)
     A            TTXTR     R               COLHDG('Total' 'XTR amount')
     A                                      REFFLD(SSAMT4)
     A**  FIELDS USED FOR FACTORING ONLY
     A            ADVMRG    R               COLHDG('Advance' 'Margin')
     A                                      REFFLD(SSPERD)
     A            RETSUM    R               COLHDG('Retension' 'Sum')
     A                                      REFFLD(SSAMT4)
     A            LTAMRF    R               COLHDG('Total' 'Amount' -
     A                                      'to be Refund')
     A                                      REFFLD(SSAMT4)
     A            LTALRF    R               COLHDG('Allowable Refund' -
     A                                      'Amount')
     A                                      REFFLD(SSAMT4)
     A            LTACRF    R               COLHDG('Actual amount' -
     A                                      'Refunded')
     A                                      REFFLD(SSAMT4)
     A            PNICNO    R               COLHDG('Invoice/Cheque/PN' 'Number')
     A                                      REFFLD(SSDESS)
     A            WHCODE    R               COLHDG('Withholding code')
     A                                      REFFLD(SSCOU1)
     A*** FIELDS IN LNMAST/LNTNEW NOT USED
     A            RELEAC    R               COLHDG('Re-lease')
     A                                      REFFLD(SSCOD1)
     A            TERCDE    R               COLHDG('Territory' 'Code')
     A                                      REFFLD(SSCOD3)
     A            DEMSTU    R               COLHDG('Demand/Student' 'Loan Code')
     A                                      REFFLD(SSCOD1)
     A            BORWCD    R               COLHDG('Borrower' 'Code')
H001 A*                                     REFFLD(SSCOU9)
H001 A*A026                                 REFFLD(SSAMTB)
A026 A                                      REFFLD(SSBACC)
     A*** Dates In MMDDYY Format ***
     A            EXAMD8    R               COLHDG('Examiner' 'Class Date')
     A                                      REFFLD(SSDAT8)
     A            CPNDT8    R               COLHDG('Coupon Book' 'Reorder Date')
     A                                      REFFLD(SSDAT8)
     A            CHQDT8    R               COLHDG('Date Last' 'Cheq. Return')
     A                                      REFFLD(SSDAT8)
     A            RESTD8    R               COLHDG('Date of' 'Next Rest')
     A                                      REFFLD(SSDAT8)
     A            CURED8    R               COLHDG('Last Right to' 'Cure Date')
     A                                      REFFLD(SSDAT8)
     A            EXTFEE    R               COLHDG('YTD' 'Extension Fees')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            ORGFEE    R               COLHDG('YTD' 'Origination Fees')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            RSTAMT    R               COLHDG('Current Rest' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            REDBAL    R               COLHDG('Reduced' 'Balance')
     A                                      REFFLD(SSAMT4)
     A            BALLON    R               COLHDG('Balloon' 'Payment')
     A                                      REFFLD(SSAMT4)
     A            WCHCOD    R               COLHDG('Watch list' 'Code')
     A                                      REFFLD(SSCOD1)
     A            WCHDT8    R               COLHDG('Date on' 'Watch list')
     A                                      REFFLD(SSDAT8)
K031 A            PENTAX    R               COLHDG('L/C IN SUSP. TAX')
K031 A                                      REFFLD(SSAMT4)
K031 A            PENNON    R               COLHDG('L/C IN SUSP. NON-TAX')
K031 A                                      REFFLD(SSAMT4)
HLB  A* New fields in LNMAST/LNTNEW
H001 A            ATOPYI    R               COLHDG('Auto Pay Int' 'By Unutil-
H001 A                                      ised Prin')
H001 A                                      REFFLD(SSCOD1)
H001 A            SECLN     R               COLHDG('Secondary' 'Loan')
H001 A                                      REFFLD(SSCOD1)
H001 A            SECLVA    R               COLHDG('Sec. Loan' 'Valid. Period')
H001 A                                      REFFLD(SSCOU3)
H001 A            ITDCOD    R               COLHDG('Introducer' 'Code')
H001 A                                      REFFLD(SSCODA)
H001 A            BNMEXP    R               COLHDG('BNM' 'Exempt')
H001 A                                      REFFLD(SSCOD1)
H001 A            GRPSTF    R               COLHDG('Group' 'Staff')
H001 A                                      REFFLD(SSCOD1)
H001 A            INCTVF    R               COLHDG('Allwed' 'Incentive (Y/N)')
H001 A                                      REFFLD(SSCOD1)
H001 A            WAIVLC    R               COLHDG('Waive' 'Late Charge')
H001 A                                      REFFLD(SSCOD1)
H001 A            WAIVCF    R               COLHDG('Waive' 'Commitment Fee')
H001 A                                      REFFLD(SSCOD1)
H001 A            WAIVHM    R               COLHDG('Waive' 'Hold Mail Charges')
H001 A                                      REFFLD(SSCOD1)
A001 A            RECOSC    R               COLHDG('Recourse Code(Y/N)')
A001 A                                      REFFLD(SSCOD1)
A001 A            FACRR     R               COLHDG('Facility Risk' 'Rating')
A001 A                                      REFFLD(SSCOD2)
A001 A*AM16       APRBNM    R               COLHDG('Appr. by' ' BNM, reschd>2' -
A001 A*AM16                                 'in a year')
A001 A*AM16                                 REFFLD(SSCOD1)
A014 A*AM16       APRDT6    R               COLHDG('Apr. by' 'BNM date,' -
A001 A*AM16                                 'reschd>2 yr')
A014 A*AM16                                 REFFLD(SSDAT8)
A014 A*AM16       APRDT7    R               COLHDG('Apr. by' 'BNM date,' -
A014 A*AM16                                 'reschd>2 yr')
A014 A*AM16                                 REFFLD(SSDAT7)
A016 A*R1002      RATPC     R               COLHDG('Package Code.')
A016 A*R1002                                REFFLD(SSCOD3)
R1002A            RATPC     R               COLHDG('Campaign Code.')
R1002A                                      REFFLD(SSCODA)
A016 A*R1002      RTPED8    R               COLHDG('Package' 'Effective Date 6')
R1002A            RTPED8    R               COLHDG('Campaign' 'Effective Date')
R1002A
A016 A                                      REFFLD(SSDAT8)
R1037A            MULTIR    R               COLHDG('Multi Tier Rate')
R1037A                                      REFFLD(SSCOD1)
AM01 A            EXMPT     R               COLHDG('Exempt Type' 'percentage')
AM01 A                                      REFFLD(SSPERD)
AM01 A            EXPOS     R               COLHDG('Exposure percentage')
AM01 A                                      REFFLD(SSPERD)
     ** Field not used
H001 A            DEVLMT    R               COLHDG('Developer Limit')
H001 A                                      REFFLD(SSAMT4)
H001 A            DEVABL    R               COLHDG('Dev. Avail. Bal.')
H001 A                                      REFFLD(SSAMT4)
     A            MINBAL    R               COLHDG('Minumum' 'Balance')
     A                                      REFFLD(SSAMT4)
     A            MAXBAL    R               COLHDG('Maximum' 'Balance')
     A                                      REFFLD(SSAMT4)
R1002A            TXBSD8    R               COLHDG('Taxable Interest ' +
R1002A                                      'Monitoring Dt')
R1002A                                      REFFLD(SSDAT8)
R1002A            TXBED8    R               COLHDG('Taxable Interest' 'End Dt')
R1002A                                      REFFLD(SSDAT8)
R1002A            OVPINC    R               COLHDG('Recognize' 'Overpayment' +
R1002A                                      'as Income')
R1002A                                      REFFLD(SSCOD1)
R1002A            STRDRI    R               COLHDG('Start Date' 'for Payment' +
R1002A                                      'to Restructured Int')
R1002A                                      REFFLD(SSDAT8)
R1002A            STRPRI    R               COLHDG('Threshold for' +
R1002A                                      'Restructured' 'Int payment')
R1002A                                      REFFLD(SSAMT4)
R1002A            STRDMI    R               COLHDG('Start Date for' +
R1002A                                      'Payment to' 'Moratorium Int')
R1002A                                      REFFLD(SSDAT8)
R1002A            OVRTRN    R               COLHDG('Override Auto-split' +
R1002A                                      'Transaction Code')
R1002A                                      REFFLD(SSCOU3)
R1002A            TDRDTE    R               COLHDG('Restructuring' 'Status Dt')
R1002A                                      REFFLD(SSDAT8)
R1002A            YSTDRS    R               COLHDG('Yesterday' +
R1002A                                      'Restructuring Status')
R1002A                                      REFFLD(SSCOD1)
R1002A            YSTCLS    R               COLHDG('Yesterday' +
R1002A                                      'Classification Code')
R1002A                                      REFFLD(SSCOD1)
R1002A            TDRMCN    R               COLHDG('Counter for' +
R1002A                                      'monitoring period')
R1002A                                      REFFLD(SSCOU3)
R1029A            OVLORG    R               COLHDG('Original' 'Over-loan' -
R1029A                                      'Balance')
R1029A                                      REFFLD(SSAMT4)
R1002A            OVLBAL    R               COLHDG('Outstanding' 'over-loan')
R1002A                                      REFFLD(SSAMT4)
R1002A            OVLRAT    R               COLHDG('Over-loan Ratio')
R1002A                                      REFFLD(SSPERD)
R1002A            PWOREA    R               COLHDG('Write Off Reason')
R1002A                                      REFFLD(SSCOD4)
R1002A            PWOAPB    R               COLHDG('Write Off' +
R1002A                                      'Approved By')
R1002A                                      REFFLD(SSOFFC)
R1002A            PWOAP8    R               COLHDG('Write off Date')
R1002A                                      REFFLD(SSDAT8)
R1002A            EPFAMT    R               COLHDG('Provident Fund' +
R1002A                                      'Prepayment Amount')
R1002A                                      REFFLD(SSAMT4)
R1002A            USERP     R               COLHDG('Use Relationship' +
R1002A                                      'Pricing')
R1002A                                      REFFLD(SSCOD1)
R1018A            RPSEQ     R               COLHDG('Relatinship' 'Pricing' -
R1018A                                      'Reduction Sequence')
R1018A                                      REFFLD(SSCOU9)
R1002A            STDRAT    R               COLHDG('Standard Rate')
R1002A                                      REFFLD(SSPERD)
R1002A            STDRTN    R               COLHDG('Standard Rate Number')
R1002A                                      REFFLD(SSRATE)
R1002A            STDVAR    R               COLHDG('Standard' +
R1002A                                      'Rate Variance')
R1002A                                      REFFLD(SSPERD)
R1002A            STDVAC    R               COLHDG('Standard Rate' +
R1002A                                      'Variance Code')
R1002A                                      REFFLD(SSCOD1)
R1002A            STDNUM    R               COLHDG('No of Mth switch' +
R1002A                                      'to Standard Rate')
R1002A                                      REFFLD(SSCOU3)
R1002A            STNRP8    R               COLHDG('Next Relationship' +
R1002A                                      'Pricing Review Date')
R1002A                                      REFFLD(SSDAT8)
R1002A            WHOUHP    R               COLHDG('With/Without HP')
R1002A                                      REFFLD(SSYON )
R1002A            PMTPGM    R               COLHDG('Payment Program')
R1002A                                      REFFLD(SSCOD1)
R1006A            APPROA    R               COLHDG('Rate Change' 'Approving' -
R1006A                                      'Authority')
R1006A                                      REFFLD(SSOFFC)
R1006A            APPRO8    R               COLHDG('Rate Change' 'Approved' -
R1006A                                      'Date')
R1006A                                      REFFLD(SSDAT8)
     A            PROC      R               COLHDG('Amount of' 'Proceeds')
     A                                      REFFLD(SSAMT4)
     A            ADVANC    R               COLHDG('Amount' 'Advanced')
     A                                      REFFLD(SSAMT4)
     A* NEW ACCOUNTS - LNTNEW  INCLUDES ALL FIELDS IN LNMAST PLUS BELOW
     A            CMD3      R               COLHDG('Invalid' 'Override')
     A                                      REFFLD(SSCOD1)
     A            BATCH     R               COLHDG('Batch' 'Number')
     A                                      REFFLD(SSCOU3)
     A            MSG       R               COLHDG('Special Message' 'Flag')
     A                                      REFFLD(SSCOD1)
     A            TLRINQ    R               COLHDG('Teller' 'Special Status')
     A                                      REFFLD(SSCOD1)
     **
     ** RESERVE CODE
M024 A            RCOD01    R               COLHDG('Reserve' 'Code 001')
M024 A                                      REFFLD(SSCOD1)
M024 A            RCOD02    R               COLHDG('Reserve' 'Code 002')
M024 A                                      REFFLD(SSCOD1)
M024 A            RCOD03    R               COLHDG('Reserve' 'Code 003')
M024 A                                      REFFLD(SSCOD1)
M024 A            RCOD04    R               COLHDG('Reserve' 'Code 004')
M024 A                                      REFFLD(SSCOD1)
M024 A            RCNT01    R               COLHDG('Reserve' 'Counter 001')
M024 A                                      REFFLD(SSCOU3)
M024 A            RCNT02    R               COLHDG('Reserve' 'Counter 002')
M024 A                                      REFFLD(SSCOU3)
M024 A            RCNT03    R               COLHDG('Reserve' 'Counter 003')
M024 A                                      REFFLD(SSCOU3)
M024 A            RCNT04    R               COLHDG('Reserve' 'Counter 004')
M024 A                                      REFFLD(SSCOU3)
AM01 ** filler
     A*SS02       FIL1D6    R               COLHDG('Filler 1' 'Date 6')
     A*SS02                                 REFFLD(SSDAT8)
     A*SS02       FIL1D7    R               COLHDG('Filler 1' 'Date 7')
     A*SS02                                 REFFLD(SSDAT7)
     A*SS02       FIL2D6    R               COLHDG('Filler 2' 'Date 6')
     A*SS02                                 REFFLD(SSDAT8)
     A*SS02       FIL2D7    R               COLHDG('Filler 2' 'Date 7')
     A*SS02                                 REFFLD(SSDAT7)
     A*SS02       FIL3D6    R               COLHDG('Filler 3' 'Date 6')
     A*SS02                                 REFFLD(SSDAT8)
     A*SS02       FIL3D7    R               COLHDG('Filler 3' 'Date 7')
     A*SS02                                 REFFLD(SSDAT7)
     A*AM15       FILLER1   R               COLHDG('Filler 1' 'Rate')
AM15 A*SS02       FILRT1    R               COLHDG('Filler 1' 'Rate')
     A*SS02                                 REFFLD(SSPERD)
     A*AM15       FILLER2   R               COLHDG('Filler 2' 'Rate')
AM15 A*SS02       FILRT2    R               COLHDG('Filler 2' 'Rate')
     A*SS02                                 REFFLD(SSPERD)
     A*AM15       FILLER3   R               COLHDG('Filler 3' 'Rate')
AM15 A*SS02       FILRT3    R               COLHDG('Filler 3' 'Rate')
     A*SS02                                 REFFLD(SSPERD)
     A*AM15       FILLER4   R               COLHDG('Filler 4' 'Amount')
AM15 A*SS02       FILAM1    R               COLHDG('Filler 4' 'Amount')
     A*SS02                                 REFFLD(SSAMT4)
     A*AM15       FILLER5   R               COLHDG('Filler 5' 'Amount')
AM15 A*SS02       FILAM2    R               COLHDG('Filler 5' 'Amount')
     A*SS02                                 REFFLD(SSAMT4)
     ** Processing Log
SS01 A            PROPGM    R               COLHDG('Processing' 'Program Name')
SS01 A                                      REFFLD(SSCODA)
SS01 A            PRODT8    R               COLHDG('Processing' 'Date')
SS01 A                                      REFFLD(SSDAT8)
     ** Pricing Package
SS17 A*R1002      PRCPKI    R               COLHDG('Price Package' 'Indicator')
R1002A            PRCPKI    R               COLHDG('Price Campaign' 'Indicator')
SS17 A                                      REFFLD(SSCOD1)
SS17 A            RCFUL     R               COLHDG('Calc Rebate' 'Clawback if-
SS17 A                                      PO within')
SS17 A                                      REFFLD(SSCOU3)
     **********************************************************
     ** FIELD REMOVE FROM LNMAST
M024 A*M025       LYICWB    R               COLHDG('Last Year' 'IIS Clawback')
M024 A*M025                                 REFFLD(SSAMT4)
M024 A*M025       LYITRF    R               COLHDG('Last Year' 'IIS Transfer')
M024 A*M025                                 REFFLD(SSAMT4)
     A*M025       LYIWBK    R               COLHDG('Last Year' 'IIS W/B')
     A*M025                                 REFFLD(SSAMT4)
M024 A*M025       LYIWBA    R               COLHDG('Last Year' 'IIS W/B Adj')
M024 A*M025                                 REFFLD(SSAMT4)
M024 A*M025       LYIWBT    R               COLHDG('Last Year' 'IIS W/B Trf')
M024 A*M025                                 REFFLD(SSAMT4)
     A*M025       LYIWOF    R               COLHDG('Last Year' 'IIS W/O')
     A*M025                                 REFFLD(SSAMT4)
     A*M025       LYPWOF    R               COLHDG('Last Year' 'W/O Prov')
     A*M025                                 REFFLD(SSAMT4)
M024 A*M025       LYPTRF    R               COLHDG('Last Year' 'Prov Transfer')
M024 A*M025                                 REFFLD(SSAMT4)
     A*M025       LYPWBK    R               COLHDG('Last Year' 'W/B Prov')
     A*M025                                 REFFLD(SSAMT4)
M024 A*M025       LYPWBA    R               COLHDG('Last Year' 'W/B Prov Adj')
M024 A*M025                                 REFFLD(SSAMT4)
M024 A*M025       LYPWBT    R               COLHDG('Last Year' 'W/B Prov Trf')
M024 A*M025                                 REFFLD(SSAMT4)
     A*M025       LYWOFF    R               COLHDG('Last Year' 'Write Off')
     A*M025                                 REFFLD(SSAMT4)
     A*M025       LYWBCK    R               COLHDG('Last Year' 'Write Back')
     A*M025                                 REFFLD(SSAMT4)
     A*M025       LNPERP    R               COLHDG('Percentage' 'Pledged')
     A*M025                                 REFFLD(SSPERD)
     A*M025       UPRATE    R               COLHDG('Margin rate' 'Down/Upwards')
     A*M025                                 REFFLD(SSPERD)
     A*M025       PICTYP    R               COLHDG('Type of' 'Exchange')
     A*M025                                 REFFLD(SSCOD1)
     A*M025       COLCOD    R               COLHDG('Collateral' 'Code')
     A*M025                                 REFFLD(SSCOD3)
     A*M025       INDCOD    R               COLHDG('Standard Industry' 'Code')
     A*M025                                 REFFLD(SSCOD4)
     A*M025       DEMAND    R               COLHDG('Demand' 'Loan Code')
     A*M025                                 REFFLD(SSCOD1)
     A*M025       TITLE     R               COLHDG('Title Still' 'Needed Code')
     A*M025                                 REFFLD(SSCOD1)
     A*M025       CENSUS    R               COLHDG('Census' 'Tract 1')
     A*M025                                 REFFLD(SSAMT2)
     A*M025       STATE     R               COLHDG('State' 'Code')
     A*M025                                 REFFLD(SSCOD3)
     A*M025       COUNTY    R               COLHDG('County' 'Code')
     A*M025                                 REFFLD(SSCOD2)
     A*M025       INVNO     R               COLHDG('Investor' 'Number')
     A*M025                                 REFFLD(SSCOU3)
     A*M025       PPPCOD    R               COLHDG('Prepayment' 'Penalty Code')
     A*M025                                 REFFLD(SSCOD1)
     A*M025       SCHEME    R               COLHDG('Loan Scheme' 'Code')
     A*M025                                 REFFLD(SSCOD3)
     A*M025       SCALE     R               COLHDG('Small Scale' 'Code')
     A*M025                                 REFFLD(SSCOD3)
     A*M025       CSHBON    R               COLHDG('Cash' 'Bonus')
     A*M025                                 REFFLD(SSCOD1)
     A*M025       APRAMT    R               COLHDG('Appraised' 'Value')
     A*M025                                 REFFLD(SSAMT3)
H001 A*M025       RETPRD    R               COLHDG('Retention' 'Period')
H001 A*M025                                 REFFLD(SSCOU3)
H001 A*M025       RETPRC    R               COLHDG('Retention' 'Period Code')
H001 A*M025                                 REFFLD(SSCOD1)
     A*M001       LFMDT6    R               COLHDG('Last Maint' 'Date')
     A*M001                                 REFFLD(SSDAT8)
     A*M001       LFMDT     R               COLHDG('Last Maint' 'Date')
     A*M001                                 REFFLD(SSDAT7)
A036 A*M001       MCLIND    R               COLHDG('Multi-Currency' '(Y/N)')
A036 A*M001                                 REFFLD(SSCOD1)
V002 A**V002      CLSEQ     R               COLHDG('Cr Line Seq No')
V002 A**V002                                REFFLD(SSASEQ)
A024 A*           BVNPLS    R               COLHDG('NPL Status' 'B4 Variation')
     A*M022       JDSUM     R               COLHDG('Judgment' 'Sum')
     A*M022                                 REFFLD(SSAMT4)
     A*M022       JDDT6     R               COLHDG('Judgment date')
     A*M022                                 REFFLD(SSDAT8)
     A*M022       JDDT7     R               COLHDG('Judgment date')
     A*M022                                 REFFLD(SSDAT7)
V001 A*M025       LNCAR     R               COLHDG('CAR' 'Code')
V001 A*M025                                 REFFLD(SSCOD2)
     A**V001      FPR5      R               COLHDG('% on interest rebate')
     A**V001                                REFFLD(SSPERD)
A001 A*M001       INTRTP    R               COLHDG('Interest' 'Rate Type')
A001 A*M001                                 REFFLD(SSCOD3)
     A*************************************************************************
     A* MEMO FILE - LNMEMO
     A*************************************************************************
SS12 A            DISBTD    R               COLHDG('Disburse Today Flag')
     A                                      REFFLD(SSCOD1)
     A            USRLCK    R               COLHDG('In use by' 'User ID')
     A                                      REFFLD(SSCODA)
     A*****************************************************************
     A* ESCROW POST FILE - LNEPST
     A*****************************************************************
     A            LEPTYP    R               COLHDG('Identifier' 'LNEPST')
     A                                      REFFLD(SSCOU3)
     A            ESCBAL    R               COLHDG('Total Escrow' 'Balance')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            EPMTAM    R               COLHDG('Escrow' 'Payment')
     A                                      REFFLD(SSAMT4)
     A            EPMTA1    R               COLHDG('Escrow' 'Payment 1')
     A                                      REFFLD(SSAMT4)
     A            EPMTA2    R               COLHDG('Escrow' 'Payment 2')
     A                                      REFFLD(SSAMT4)
     A            EPMTA3    R               COLHDG('Escrow' 'Payment 3')
     A                                      REFFLD(SSAMT4)
     A            WORKTC    R               COLHDG('Combined' 'Dorc/Afft')
     A                                      REFFLD(SSCOD2)
     A*************************************************************************
     A* HISTORY - LNHIST    R
     A*************************************************************************
     A            LHACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LHATYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSCOD1)
M003 A            LHAMNO    R               COLHDG('Main Account' 'Number')
  |  A*SS13                                 REFFLD(SSCOUB)
SS13 A                                      REFFLD(SSTMNO)
  |  A            LHALLL    R               COLHDG('Lender In' 'Syndication Ln')
SS23 A                                      REFFLD(SSTLLL)
  |  A            LHADDD    R               COLHDG('Drawdown' 'Sequence Number')
SS23 A                                      REFFLD(SSTDDD)
     A            LHTRAN    R               COLHDG('Tran' 'Code')
     A                                      REFFLD(SSTRAN)
     A            LHDORC    R               COLHDG('Dr/Cr' 'Code')
     A                                      REFFLD(SSCOD1)
     A            LHCTYP    R               COLHDG('Charge' 'Type')
     A                                      REFFLD(SSCOD2)
     A            LHAFFT    R               COLHDG('Affects' 'Code')
     A*V001                                 REFFLD(SSCOD1)
V001 A                                      REFFLD(SSCOD2)
     A            LHAMT     R               COLHDG('Transaction' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LHCUR     R               COLHDG('Currency')
     A                                      REFFLD(SSCURC)
V002 A**          LHASEQ    R               COLHDG('Account' 'Currency Seq')
V002 A**                                    REFFLD(SSASEQ)
     A            LHDEC     R               COLHDG('Decimal positions')
     A                                      REFFLD(SSCOD1)
SS04 A            LHRATP    R               COLHDG('Rate' 'Type')
SS04 A                                      REFFLD(SSCOD2)
SS04 A            LHERAT    R               COLHDG('Exchange' 'Rate')
SS04 A                                      REFFLD(SSAMTQ)
     A            LHCAMT    R               COLHDG('Converted amount')
     A                                      REFFLD(SSAMT4)
     A            LHCCUR    R               COLHDG('Converted currency')
     A                                      REFFLD(SSCURC)
SS04 A            LHCRTP    R               COLHDG('Converted' 'Rate Type')
SS04 A                                      REFFLD(SSCOD1)
SS04 A            LHCERT    R               COLHDG('Converted' 'Exchange Rate')
SS04 A                                      REFFLD(SSAMTQ)
SS04 A            LHBKAM    R               COLHDG('Bank amount')
SS04 A                                      REFFLD(SSAMT4)
SS04 A            LHBKCR    R               COLHDG('Bank currency')
SS04 A                                      REFFLD(SSCURC)
R1046A            LHBKRT    R               COLHDG('Bank' 'Exchange Rate')
R1046A                                      REFFLD(SSAMTQ)
R1046A            LHRVRT    R               COLHDG('Revalue' 'Exchange Rate')
R1046A                                      REFFLD(SSAMTQ)
     A**V001      LHBRAM    R               COLHDG('Branch amount')
     A**V001                                REFFLD(SSAMT4)
     A**V001      LHBRCR    R               COLHDG('Branch currency'   )
     A**V001                                REFFLD(SSCURC)
M033 A            LHABK     R               COLHDG('Account Bank')
M033 A                                      REFFLD(SSBANK)
SS26 A            LHCCOU    R               COLHDG('Controller' 'Country')
SS26 A                                      REFFLD(SSSTA3)
M033 A            LHCBK     R               COLHDG('Controller' 'Bank')
M033 A                                      REFFLD(SSBANK)
     A            LHABR     R               COLHDG('Account branch')
     A                                      REFFLD(SSBRAN)
     A            LHCBR     R               COLHDG('Controller' 'Branch')
     A                                      REFFLD(SSBRAN)
     A            LHPST8    R               COLHDG('Posting' 'Date')
     A                                      REFFLD(SSDAT8)
AM17 A            LHOPS8    R               COLHDG('Original Posting' 'Date')
AM17 A                                      REFFLD(SSDAT8)
     A            LHEFD8    R               COLHDG('Effective' 'Date')
     A                                      REFFLD(SSDAT8)
SS04 A            LHNDT8    R               COLHDG('Overnight' 'System Date')
SS04 A                                      REFFLD(SSDAT8)
     A            LHDUD8    R               COLHDG('Payment' 'Due Date')
     A                                      REFFLD(SSDAT8)
     A            LHIDD8    R               COLHDG('Int Payment' 'Due Date')
     A                                      REFFLD(SSDAT8)
AM01 A            LHINS8    R               COLHDG('Billing' 'Due Date')
M001 A                                      REFFLD(SSDAT8)
     A            LHTIME    R               COLHDG('Time')
     A                                      REFFLD(SSTIM6)
V001 A            LHETIM    R               COLHDG('Effective' 'Time')
V001 A                                      REFFLD(SSTIM6)
SS04 A            LHNTIM    R               COLHDG('Overnight' 'System Time')
SS04 A                                      REFFLD(SSTIM6)
     A            LHSRC     R               COLHDG('Input' 'Source')
     A                                      REFFLD(SSCOD1)
     A            LHBATN    R               COLHDG('Batch' 'Number')
     A*V004                                 REFFLD(SSCOU3)
V004 A                                      REFFLD(SSCOU5)
     A            LHSEQN    R               COLHDG('Sequence' 'Number')
     A                                      REFFLD(SSCOU9)
AM17 A            LHOSEQ    R               COLHDG('Original' 'Seq Number')
AM17 A                                      REFFLD(SSCOU9)
V001 A            LHPODR    R               COLHDG('Posting' 'Order')
V001 A                                      REFFLD(SSCOU5)
     A            LHUSER    R               COLHDG('User' 'ID')
     A                                      REFFLD(SSCODA)
     A            LHSPID    R               COLHDG('Supervisor' 'ID')
     A                                      REFFLD(SSCODA)
R1013A            LHSPI2    R               COLHDG('Supervisor' 'ID 2')
R1013A                                      REFFLD(SSCODA)
     A            PSTCOD    R               COLHDG('Post/Unposted' 'Code')
     A*                                     REFFLD(SSCOU1)
V002 A                                      REFFLD(SSCOU2)
     A            LHREAS    R               COLHDG('Reason' 'code')
     A                                      REFFLD(SSCOD2)
M001 A            LHREV     R               COLHDG('TLTRAN Rev' 'Generated')
M001 A                                      REFFLD(SSCOD1)
     ** PAR3 Default
SS04 A            LHRTRN    R               COLHDG('Rev Tran' 'Code')
SS04 A                                      REFFLD(SSTRAN)
M001 A            LHAFNP    R               COLHDG('Affects next' 'Pymt date')
M001 A                                      REFFLD(SSCOD1)
M001 A            LHAFAR    R               COLHDG('Affects Amount' 'Released')
M001 A                                      REFFLD(SSCOD1)
     A            LHEPEN    R               COLHDG('Subject to penalty')
     A                                      REFFLD(SSCOD1)
     A            LHRBAL    R               COLHDG('Affect rest balance')
     A                                      REFFLD(SSCOD1)
M001 A            LHPSEQ    R               COLHDG('Posting' 'Sequence')
M001 A                                      REFFLD(SSCOD1)
     A            LHAFRE    R               COLHDG('Affects' 'Amount Refund')
     A                                      REFFLD(SSCOD1)
SS16 A            LHAFRD    R               COLHDG('Affects Redraw Limit')
SS16 A                                      REFFLD(SSCOD1)
SS16 A            LHRDRW    R               COLHDG('Redraw %')
SS16 A                                      REFFLD(SSPERD)
M001 A            LHTTYP    R               COLHDG('Transaction Type')
M001 A                                      REFFLD(SSCOD2)
M001 A            LHCORF    R               COLHDG('Correction Flag')
M001 A                                      REFFLD(SSCOD1)
BA01 A            LHREDM    R               COLHDG('Redemption' 'Transaction')
BA01 A                                      REFFLD(SSCOD1)
M033 A            LHWAIV    R               COLHDG('Waiver' 'Transaction')
M033 A                                      REFFLD(SSCOD1)
M033 A            LHADJF    R               COLHDG('Affect Susp/Prov' 'Balance')
     A                                      REFFLD(SSCOD1)
M001 A            LHPART    R               COLHDG('Part Change' 'Pmt Code')
M001 A                                      REFFLD(SSCOD1)
M001 A            LHSETT    R               COLHDG('Settlement' 'Transaction')
M001 A                                      REFFLD(SSCOD1)
AM01 A            LHEXAF    R               COLHDG('Excess Amount' -
     A                                      'Affect Code')
     A                                      REFFLD(SSCOD2)
     ** GL Posting
     A*M001       LHITCD    R               COLHDG('Interface code')
     A*M001                                 REFFLD(SSCOU3)
V001 A            LHGLIF    R               COLHDG('GL Interface' 'Number')
V001 A                                      REFFLD(SSCOU3)
M001 A            LHPTYP    R               COLHDG('Posting' 'Type')
M001 A                                      REFFLD(SSCOD1)
     A            LHGRUP    R               COLHDG('G/L group' 'code')
     A                                      REFFLD(SSGRUP)
     A            LHCOST    R               COLHDG('Cost center')
H001 A*                                     REFFLD(SSCOU3)
H001 A                                      REFFLD(SSCOST)
     A*SS26       LHPRCD    R               COLHDG('Product code')
SS26 A*R1025      LHPRCD    R               COLHDG('Business' 'Unit/Product' -
SS26 A*R1025                                'Code')
R1025A            LHPRCD    R               COLHDG('Category Code')
H001 A*                                     REFFLD(SSCOU3)
H001 A                                      REFFLD(SSPROC)
M001 A            LHGLBK    R               COLHDG('GL' 'Book')
M001 A                                      REFFLD(SSCOD1)
SS04 A            LHSSID    R               COLHDG('Source' 'Sys ID')
M001 A*R1025                                REFFLD(SSCOD4)
R1025A                                      REFFLD(SSCODA)
R1025A            LHGLSD    R               COLHDG('GL Source' 'ID')
R1025A                                      REFFLD(SSCODA)
SS04 A            LHGLRR    R               COLHDG('Reconciliation' 'Ref No')
M001 A*SS04                                 REFFLD(SSCOUD)
SS04 A                                      REFFLD(SSGLNO)
SS04 A            LHTXN     R               COLHDG('Transaction' 'Ref No')
SS04 A                                      REFFLD(SSREFN)
R1038A            LHRESI    R               COLHDG('Resident Indicator')
R1038A                                      REFFLD(SSCOD2)
R1038A            LHCUSC    R               COLHDG('Customer Category')
R1038A                                      REFFLD(SSCOD2)
R1038A            LHGLAS    R               COLHDG('GL Account Status')
R1038A                                      REFFLD(SSCOD2)
R1038A            LHSUBL    R               COLHDG('Sub Ledger Code')
R1038A                                      REFFLD(SSCOU5)
     ** Running Balance
M001 A            LHCBAL    R               COLHDG('Run Bal' 'Principal')
M001 A                                      REFFLD(SSAMT4)
M001 A            LHOSBL    R               COLHDG('Run Bal' 'Outstanding')
M001 A                                      REFFLD(SSAMT4)
     ** Other Info
M001 A            LHSUMM    R               COLHDG('Transaction' 'Summary')
M001 A                                      REFFLD(SSCOD1)
M001 A            LHTMOD    R               COLHDG('Transaction' 'Mode')
M001 A                                      REFFLD(SSCOD4)
     A            LHAXTC    R               COLHDG('Auxilary' 'Trans Code')
     A***                                   REFFLD(SSCOD4)
HXXX A                                      REFFLD(SSCODA)
     A            LHBOPC    R               COLHDG('BOP Code')
     A                                      REFFLD(SSCOU5)
M001 A*SS01       LHRATP    R               COLHDG('Rate' 'Type')
M001 A*SS01                                 REFFLD(SSCOD1)
M001 A*SS01       LHERAT    R               COLHDG('Exchange' 'Rate')
M001 A*SS01                                 REFFLD(SSAMTQ)
M001 A            LHDEAL    R               COLHDG('Dealer' 'Code')
M001 A*R1025                                REFFLD(SSCOD3)
R1025A                                      REFFLD(SSCODA)
M001 A            LHCONN    R               COLHDG('Deal' 'No./Contract No.')
M001 A*R1025                                REFFLD(SSCODA)
R1025A                                      REFFLD(SSCODF)
R1025A            LHRMNO    R               COLHDG('Remmitance' 'No.')
R1025A                                      REFFLD(SSDESS)
SS12 A            LHCOID    R               COLHDG('Collateral ID')
SS12 A                                      REFFLD(SSDCID)
SS12 A            LHCMID    R               COLHDG('Salesman Comm code')
SS12 A*R1001                                REFFLD(SSCODB)
R1001A                                      REFFLD(SSCODA)
M001 A            LHSWFT    R               COLHDG('Swift/Draft/CO' 'No./Mas')
M001 A*SS04                                 REFFLD(SSCODB)
SS04 A                                      REFFLD(SSREFN)
SS26 A            LHSERP    R               COLHDG('Cheque Prefix')
SS26 A                                      REFFLD(SSCOD3)
     A            LHSER     R               COLHDG('Cheque Number')
     A*SS26                                 REFFLD(SSCOU7)
SS26 A                                      REFFLD(SSCOU9)
     A            LHROUT    R               COLHDG('Routing No')
     A                                      REFFLD(SSCOU9)
M001 A            LHRACC    R               COLHDG('Retail/GL/Card' -
M001 A                                      'Account No.')
M001 A*SS26                                 REFFLD(SSCODJ)
SS26 A                                      REFFLD(SSACCN)
M001 A            LHRTYP    R               COLHDG('Retail/GL/Card' 'A/C Type')
M001 A                                      REFFLD(SSCOD1)
M001 A            LHRCUR    R               COLHDG('Retail/GL/Card' -
M001 A                                      'Currency')
M001 A                                      REFFLD(SSCURC)
SS26 A            LHRACN    R               COLHDG('Retail/GL/Card' -
SS26 A                                      'Name')
SS26 A                                      REFFLD(SSDESM)
M001 A            LHPAYE    R               COLHDG('Payee' 'Name')
M001 A                                      REFFLD(SSNAML)
M001 A*R1025      LHNOSA    R               COLHDG('Nostro' 'Agent')
M001 A*R1025                                REFFLD(SSCODC)
R1025A            LHNOSA    R               COLHDG('Bank/Nostro' 'Agent')
R1025A                                      REFFLD(SSCODF)
M001 A            LHYREF    R               COLHDG('Your' 'Reference')
M001 A                                      REFFLD(SSGLNO)
M001 A            LHOREF    R               COLHDG('Our' 'Reference')
M001 A                                      REFFLD(SSGLNO)
H001 A            LHAREF    R               COLHDG('Additional' 'Ref No')
V001 A                                      REFFLD(SSMSG0)
M001 A            LHSRMK    R               COLHDG('Statement' 'Remarks')
M001 A                                      REFFLD(SSDESM)
M001 A            LHTEXT    R               COLHDG('Transaction' 'Text')
M001 A                                      REFFLD(SSDESM)
V001 A            LHCPF     R               COLHDG('CPF Payment')
V001 A                                      REFFLD(SSCOD1)
V001 A            LHCPD8    R               COLHDG('CPF Payment' 'Date')
V001 A                                      REFFLD(SSDAT8)
R1001A            LHPUR     R               COLHDG('Transaction' 'Purpose Code')
R1001A                                      REFFLD(SSCOD2)
R1031A            LHRCPT    R               COLHDG('Receipt Number')
R1031A                                      REFFLD(SSGLNO)
     ** Status Change
     A*SS26       LHOSTS    R               COLHDG('Old' 'Status')
     A*SS26                                 REFFLD(SSCOU1)
     A*SS26       LHNSTS    R               COLHDG('New' 'Status')
     A*SS26                                 REFFLD(SSCOU1)
M001 A*SS26       LHONPL    R               COLHDG('Old NPL' 'Status')
M001 A*SS26                                 REFFLD(SSCOD1)
M001 A*SS26       LHNNPL    R               COLHDG('New NPL' 'Status')
M001 A*SS26                                 REFFLD(SSCOD1)
     A*SS26       LHORAT    R               COLHDG('Old' 'Rate')
     A*SS26                                 REFFLD(SSPERD)
     A*SS26       LHNRAT    R               COLHDG('New' 'Rate')
     A*SS26                                 REFFLD(SSPERD)
AM17 A*SS26       LHOVAL    R               COLHDG('Old' 'Value')
AM17 A*SS26                                 REFFLD(SSCODA)
AM17 A*SS26       LHNVAL    R               COLHDG('New' 'Value')
AM17 A*SS26                                 REFFLD(SSCODA)
     ** EFT Info
     A            LHEFTA    R               COLHDG('EFT NR')
     A                                      REFFLD(SSACCN)
     A            LHEFTT    R               COLHDG('EFT Type')
     A                                      REFFLD(SSCOD1)
     A            LHEFTC    R               COLHDG('EFT type code')
     A                                      REFFLD(SSCOD3)
V001 A            LHEFTH    R               COLHDG('Additional' 'Infomation')
V001 A                                      VARLEN(10)
V001 A                                      REFFLD(SSDESX)
M001 A            LHCCID    R               COLHDG('CREATED' 'USER')
M001 A                                      REFFLD(SSCODA)
M001 A            LHCCD8    R               COLHDG('CREATED' 'DATE')
M001 A                                      REFFLD(SSDAT8)
M001 A            LHCCTM    R               COLHDG('CREATED' 'TIME')
M001 A                                      REFFLD(SSTIM6)
SS13 A            LHSTIM    R               COLHDG('SYSTEM' 'TIME')
SS13 A                                      REFFLD(SSTIM6)
R1002A            LHCRRS    R               COLHDG('Cheque Return' +
R1002A                                      'Reason Code')
R1002A                                      REFFLD(SSCOD2)
R1002A            LHACIN    R               COLHDG('Run Bal' +
R1002A                                      'Accrued Interest')
R1002A                                      REFFLD(SSAMTG)
R1002A            LHINTS    R               COLHDG('Run Bal' +
R1002A                                      'IIS')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHINTX    R               COLHDG('Run Bal' +
R1002A                                      'Taxable IIS')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHINTN    R               COLHDG('Run Bal' +
R1002A                                      'Non-Taxable IIS')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHRINT    R               COLHDG('Run Bal' +
R1002A                                      'Rest Int')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHRISP    R               COLHDG('Run Bal' +
R1002A                                      'Rest IIS')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHRISX    R               COLHDG('Run Bal' +
R1002A                                      'Rest Taxable IIS')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHRISN    R               COLHDG('Run Bal' +
R1002A                                      'Rest Non-Taxable' +
R1002A                                      'IIS')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHMORI    R               COLHDG('Run Bal' +
R1002A                                      'Accr Mora Interest')
R1002A                                      REFFLD(SSAMTG)
R1002A            LHPENI    R               COLHDG('Run Bal' +
R1002A                                      'Late Charge')
R1002A                                      REFFLD(SSAMTH)
R1002A            LHLCSP    R               COLHDG('Run Bal' +
R1002A                                      'LC-In-Susp')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHRLC     R               COLHDG('Run Bal' +
R1002A                                      'Rest Late Charge')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHMISC    R               COLHDG('Run Bal' +
R1002A                                      'Misc Cost')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHOTHC    R               COLHDG('Run Bal' +
R1002A                                      'other charges')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHCOMF    R               COLHDG('Run Bal' +
R1002A                                      'Comm Fee')
R1002A                                      REFFLD(SSAMTH)
R1002A            LHBKSC    R               COLHDG('Run Bal' +
R1002A                                      'Bank Discount')
R1002A                                      REFFLD(SSAMT4)
R1002A            LHIREB    R               COLHDG('Run Bal' +
R1002A                                      'Interest Rebate')
R1002A                                      REFFLD(SSAMT4)
V001 A*M001       LHCSEQ    R               COLHDG('CBAS Sequence' 'Number')
V001 A*M001                                 REFFLD(SSCOU5)
     A* FOR LNHCDT FILE
     A            LHCIFN    R               COLHDG('CIF' 'number')
     A                                      REFFLD(SSCIFN)
     A            LHDLRN    R               COLHDG('Dealer' 'number')
H001 A***                                   REFFLD(SSCOU7)
H001 A                                      REFFLD(SSCOUB)
     A*************************************************************************
M033 A* HISTORY Remark - LNHISR (Key = LNHISTL3 key)
     A*************************************************************************
M003 A*                - LHACCT
     A*                - LHATYP
     A*                - LHEFDT
     A*                - LHSEQN
     A*                - LHDORC
     A*                - LHAFFT
     A*                - LHAMT
     A*
M033 A            LHARMK    R               COLHDG('Additional Remark')
M033 A                                      REFFLD(SSDESC)
     A*************************************************************************
     A* EXCEPTION FILE - LNEXCP
     A*************************************************************************
     A            XCPCOD    R               COLHDG('Exception' 'Code')
     A                                      REFFLD(SSCOU3)
     A            LCHG      R               COLHDG('Late Charges' 'Assessed')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            CHGDUE    R               COLHDG('Total' 'Chg Due')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BRATE     R               REFFLD(SSPERD)
     A            BPREV8    R               REFFLD(SSDAT8)
     A            JRCRAT    R               REFFLD(SSPERD)
     A            L1PMTN    R               COLHDG('Total Payments' 'Made LTD')
     A                                      REFFLD(SSCOU3)
     A            BNPDT8    R               REFFLD(SSDAT8)
     A            BNIPD8    R               REFFLD(SSDAT8)
     A            SSPDT8    R               REFFLD(SSDAT8)
     A            SSIPD8    R               REFFLD(SSDAT8)
     A            SSDUD8    R               COLHDG('Billing Due date')
     A                                      REFFLD(SSDAT8)
R1025A            FEEORG    R               COLHDG('Original Fee Amount')
R1025A                                      REFFLD(SSAMT4)
R1025A            FEECHG    R               COLHDG('Fee Charge Amount')
R1025A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A* LNSCHD - SCHEDULED PAYMENTS -CODE
     A*************************************************************************
M001 A            SKKRID    R               COLHDG('Record' 'Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            SKEY      R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            SSEQ      R               COLHDG('Sequence' 'Number')
     A                                      REFFLD(SSCOU3)
OS99 A            SORDER    R               COLHDG('Schedule' 'Order')
OS99 A                                      REFFLD(SSCOU3)
     A            SDAT8     R               COLHDG('Begin Date')
     A                                      REFFLD(SSDAT8)
     A            SPCOD     R               COLHDG('Payment Code')
     A                                      REFFLD(SSCOU1)
OS99 A            SYBASE    R               COLHDG('Year Base')
OS99 A                                      REFFLD(SSCOU1)
     A*OS99       STRM      R               COLHDG('Pymt Term')
OS99 A            STRM      R               COLHDG('No of Month' 'Payment')
     A                                      REFFLD(SSCOU3)
     A*Instalment/Principal
     A*OS99       SPMAD     R               COLHDG('NPymts Made')
OS99 A            SPMAD     R               COLHDG('No of Month' 'Payment Made')
     A                                      REFFLD(SSCOU3)
     A            SPAMT     R               COLHDG('Payment Amount')
     A                                      REFFLD(SSAMT4)
     A            SPFRQ     R               COLHDG('Payment Freq')
     A                                      REFFLD(SSCOU3)
OS99 A            SNPDAY    R               COLHDG('Payment Day' 'of Month')
OS99 A                                      REFFLD(SSDAT2)
     A*Interest
OS99 A            SPIAD     R               COLHDG('No of Month' 'Interest' -
OS99 A                                      'Payment Made')
OS99 A                                      REFFLD(SSCOU3)
OS99 A            SIPAMT    R               COLHDG('Interest' 'Payment Amount')
OS99 A                                      REFFLD(SSAMT4)
OS99 A            SIPFRQ    R               COLHDG('Interest' 'Payment Freq')
OS99 A                                      REFFLD(SSCOU3)
OS99 A            SNIPDY    R               COLHDG('Interest Payment Day' -
OS99 A                                      'of Month')
OS99 A                                      REFFLD(SSDAT2)
     A*Others
SS26 A            SPRPAM    R               COLHDG('Principal' 'Payment Amount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            SMIPAM    R               COLHDG('Mora Int' 'Payment Amount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            SRIPAM    R               COLHDG('Rest. Int' 'Payment Amount')
SS26 A                                      REFFLD(SSAMT4)
R1002A            SPOVTC    R               COLHDG('Override Auto-split' +
R1002A                                      'Transaction Code')
R1002A                                      REFFLD(SSCOU3)
K0003A            SPOAM     R               COLHDG('% OF ORIGINAL LOAN' +
K0003A                                      'AMOUNT')
K0003A                                      REFFLD(SSPERD)
     A*************************************************************************
     A* LNPSCH - ALTERNATE PAYMENT SCHEDULE WORK FILE
     A*************************************************************************
     A            LPWACT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LPWTYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LPWDU8    R               COLHDG('Payment' 'Due Date')
     A                                      REFFLD(SSDAT8)
V001 A            LPWSEQ    R               COLHDG('Sequence' 'Number')
V001 A                                      REFFLD(SSCOU3)
OS99 A            LPWODR    R               COLHDG('Sequence' 'Order')
OS99 A                                      REFFLD(SSCOU3)
V001 A            LPWNO     R               COLHDG('Serial No')
V001 A                                      REFFLD(SSCOU3)
     A            LPWCOD    R               COLHDG('Payment' 'Code')
     A                                      REFFLD(SSCOU1)
OS99 A            LPWYBS    R               COLHDG('Year base')
OS99 A                                      REFFLD(SSCOU1)
     A            LPWSCH    R               COLHDG('Alternate' 'Pymt Sched')
     A                                      REFFLD(SSCOD1)
OS99 A            LPWDTF    R               COLHDG('Schedule Flag')
OS99 A                                      REFFLD(SSCOD1)
     A*Instalment/Principal
V001 A            LPWFRQ    R               COLHDG('Pymt' 'Freq')
V001 A                                      REFFLD(SSCOU3)
V001 A            LPWPMT    R               COLHDG('Pymt Amount')
V001 A                                      REFFLD(SSAMT4)
OS99 A            LPWDAY    R               COLHDG('Pymt Day' 'of Month')
OS99 A                                      REFFLD(SSDAT2)
     A*Interest
OS99 A            LPWIFR    R               COLHDG('Int Pymt' 'Freq')
OS99 A                                      REFFLD(SSCOU3)
OS99 A            LPWIPM    R               COLHDG('Int Pymt Amount')
OS99 A                                      REFFLD(SSAMT4)
OS99 A            LPWIDY    R               COLHDG('Int Pymt Day' 'of Month')
OS99 A                                      REFFLD(SSDAT2)
     A*Others
SS26 A            LPWPRP    R               COLHDG('Principal' 'Payment Amount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LPWMIP    R               COLHDG('Mora Int' 'Payment Amount')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LPWRIP    R               COLHDG('Rest. Int' 'Payment Amount')
SS26 A                                      REFFLD(SSAMT4)
R1028A            LPWOVT    R               COLHDG('Override auto-splt' 'Tran.')
R1028A                                      REFFLD(SSCOU3)
     A*************************************************************************
     A* ARM/ESCROW - LNMORT
     A*************************************************************************
M001 A            EEMRID    R               COLHDG('Record' 'Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            EPRDES    R               COLHDG('Property' 'Desc.')
     A                                      REFFLD(SSCODF)
     A            ETXREF    R               COLHDG('Tax Reference' 'Number')
     A                                      REFFLD(SSCODF)
     A            ESCYTD    R               COLHDG('YTD Escrow' ' Interest')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EPAY1     R               COLHDG('Payment' 'Amount 1')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EPAY2     R               COLHDG('Payment' 'Amount 2')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EPAY3     R               COLHDG('Payment' 'Amount 3')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EACC1     R               COLHDG('Accrued' 'Interest 1')
     A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
     A            EACC2     R               COLHDG('Accrued' 'Interest 2')
     A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
     A            EACC3     R               COLHDG('Accrued' 'Interest 3')
     A*OS01                                 REFFLD(SSAMTA)
OS01 A                                      REFFLD(SSAMTG)
     A            EBAL1     R               COLHDG('Balance of' 'Escrow 1')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EBAL2     R               COLHDG('Balance of' 'Escrow 2')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EBAL3     R               COLHDG('Balance of' 'Escrow 3')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            ERT1      R               COLHDG('Master Rate N' 'For 1')
H001 A*                                     REFFLD(SSCOU3)
     A                                      REFFLD(SSCOU5)
     A            ERT2      R               COLHDG('Master Rate N' 'For 2')
H001 A*                                     REFFLD(SSCOU3)
     A                                      REFFLD(SSCOU5)
     A            ERT3      R               COLHDG('Master Rate N' 'For 3')
H001 A*                                     REFFLD(SSCOU3)
     A                                      REFFLD(SSCOU5)
     A            EDLOC1    R               COLHDG('Distribution' 'Location 1')
     A                                      REFFLD(SSCOU3)
     A            EDLOC2    R               COLHDG('Distribution' 'Location 2')
     A                                      REFFLD(SSCOU3)
     A            EDLOC3    R               COLHDG('Distribution' 'Location 3')
     A                                      REFFLD(SSCOU3)
     A            EDLOC4    R               COLHDG('Distribution' 'Location 4')
     A                                      REFFLD(SSCOU3)
     A            EDLOC5    R               COLHDG('Distribution' 'Location 5')
     A                                      REFFLD(SSCOU3)
     A            EDLOC6    R               COLHDG('Distribution' 'Location 6')
     A                                      REFFLD(SSCOU3)
     A            EDLOC7    R               COLHDG('Distribution' 'Location 7')
     A                                      REFFLD(SSCOU3)
     A            EDLOC8    R               COLHDG('Distribution' 'Location 8')
     A                                      REFFLD(SSCOU3)
     A            EDAMT1    R               COLHDG('Next Dist.' 'Amount 1')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EDAMT2    R               COLHDG('Next Dist.' 'Amount 2')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EDAMT3    R               COLHDG('Next Dist.' 'Amount 3')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EDAMT4    R               COLHDG('Next Dist.' 'Amount 4')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EDAMT5    R               COLHDG('Next Dist.' 'Amount 5')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EDAMT6    R               COLHDG('Next Dist.' 'Amount 6')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EDAMT7    R               COLHDG('Next Dist.' 'Amount 7')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EDAMT8    R               COLHDG('Next Dist.' 'Amount 8')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EDT1      R               COLHDG('Next Dist.' 'Date 1')
     A                                      REFFLD(SSDAT4)
     A            EDT2      R               COLHDG('Next Dist.' 'Date 2')
     A                                      REFFLD(SSDAT4)
     A            EDT3      R               COLHDG('Next Dist.' 'Date 3')
     A                                      REFFLD(SSDAT4)
     A            EDT4      R               COLHDG('Next Dist.' 'Date 4')
     A                                      REFFLD(SSDAT4)
     A            EDT5      R               COLHDG('Next Dist.' 'Date 5')
     A                                      REFFLD(SSDAT4)
     A            EDT6      R               COLHDG('Next Dist.' 'Date 6')
     A                                      REFFLD(SSDAT4)
     A            EDT7      R               COLHDG('Next Dist.' 'Date 7')
     A                                      REFFLD(SSDAT4)
     A            EDT8      R               COLHDG('Next Dist.' 'Date 8')
     A                                      REFFLD(SSDAT4)
     A            ETRM1     R               COLHDG('Term of' 'Dist. 1')
     A                                      REFFLD(SSCOU3)
     A            ETRM2     R               COLHDG('Term of' 'Dist. 2')
     A                                      REFFLD(SSCOU3)
     A            ETRM3     R               COLHDG('Term of' 'Dist. 3')
     A                                      REFFLD(SSCOU3)
     A            ETRM4     R               COLHDG('Term of' 'Dist. 4')
     A                                      REFFLD(SSCOU3)
     A            ETRM5     R               COLHDG('Term of' 'Dist. 5')
     A                                      REFFLD(SSCOU3)
     A            ETRM6     R               COLHDG('Term of' 'Dist. 6')
     A                                      REFFLD(SSCOU3)
     A            ETRM7     R               COLHDG('Term of' 'Dist. 7')
     A                                      REFFLD(SSCOU3)
     A            ETRM8     R               COLHDG('Term of' 'Dist. 8')
     A                                      REFFLD(SSCOU3)
     A            EPRDS1    R               COLHDG('Property Desc' 'On Dist 1')
     A                                      REFFLD(SSCOD1)
     A            EPRDS2    R               COLHDG('Property Desc' 'On Dist 2')
     A                                      REFFLD(SSCOD1)
     A            EPRDS3    R               COLHDG('Property Desc' 'On Dist 3')
     A                                      REFFLD(SSCOD1)
     A            EPRDS4    R               COLHDG('Property Desc' 'On Dist 4')
     A                                      REFFLD(SSCOD1)
     A            EPRDS5    R               COLHDG('Property Desc' 'On Dist 5')
     A                                      REFFLD(SSCOD1)
     A            EPRDS6    R               COLHDG('Property Desc' 'On Dist 6')
     A                                      REFFLD(SSCOD1)
     A            EPRDS7    R               COLHDG('Property Desc' 'On Dist 7')
     A                                      REFFLD(SSCOD1)
     A            EPRDS8    R               COLHDG('Property Desc' 'On Dist 8')
     A                                      REFFLD(SSCOD1)
     A            EABL1     R               COLHDG('Bal Field to' 'Affect 1')
     A                                      REFFLD(SSCOU1)
     A            EABL2     R               COLHDG('Bal Field to' 'Affect 2')
     A                                      REFFLD(SSCOU1)
     A            EABL3     R               COLHDG('Bal Field to' 'Affect 3')
     A                                      REFFLD(SSCOU1)
     A            EABL4     R               COLHDG('Bal Field to' 'Affect 4')
     A                                      REFFLD(SSCOU1)
     A            EABL5     R               COLHDG('Bal Field to' 'Affect 5')
     A                                      REFFLD(SSCOU1)
     A            EABL6     R               COLHDG('Bal Field to' 'Affect 6')
     A                                      REFFLD(SSCOU1)
     A            EABL7     R               COLHDG('Bal Field to' 'Affect 7')
     A                                      REFFLD(SSCOU1)
     A            EABL8     R               COLHDG('Bal Field to' 'Affect 8')
     A                                      REFFLD(SSCOU1)
     A            ECAPUP    R               COLHDG('Rate Cap' 'Upwards')
     A                                      REFFLD(SSPERD)
     A            ECAPDN    R               COLHDG('Rate Cap' 'Downwards')
     A                                      REFFLD(SSPERD)
     A            ECRDT8    R               COLHDG('Rate Cap' 'Review Date')
     A                                      REFFLD(SSDAT8)
     A            ECRDAY    R               COLHDG('Rate Cap' 'Review Day')
     A                                      REFFLD(SSDAT2)
     A            ECRTRM    R               COLHDG('Rate Cap' 'Period')
     A                                      REFFLD(SSCOU3)
     A            ECRTCD    R               COLHDG('Rate Cap' 'Period Code')
     A                                      REFFLD(SSCOD1)
     A            ERMETH    R               COLHDG('Rounding' 'Method')
     A                                      REFFLD(SSCOD1)
     A            ERAMT     R               COLHDG('Round to' 'Amount')
     A                                      REFFLD(SSPERD)
     A            ECPRT     R               COLHDG('Rate at Beg' 'Of Period')
     A                                      REFFLD(SSPERD)
     A            EPRVRT    R               COLHDG('Previous' 'Rate')
     A                                      REFFLD(SSPERD)
     A            ENWRT     R               COLHDG('New Rate')
     A                                      REFFLD(SSPERD)
     A            ENWRD8    R               COLHDG('New Rate' 'Effective Date')
     A                                      REFFLD(SSDAT8)
     A            EPMCAP    R               COLHDG('Payment' 'Amount Cap')
     A                                      REFFLD(SSPERD)
     A            ENPDYS    R               COLHDG('Notice Pre-Days')
     A                                      REFFLD(SSCOU3)
     A            ENESC1    R               COLHDG('New Escrow 1' 'Payment')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            ENESC2    R               COLHDG('New Escrow 2' 'Payment')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            ENESC3    R               COLHDG('New Escrow 3' 'Payment')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            EOLDPM    R               COLHDG('Old Payment' 'Amount')
     A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A* PAST DUE FILE - LNPDUE
     A*************************************************************************
     A            PDIREP    R               COLHDG('Print on' 'Past due report')
     A                                      REFFLD(SSCOD1)
     A            PDIHIS    R               COLHDG('Print PD' 'History card')
     A                                      REFFLD(SSCOD1)
     A            PDIRTC    R               COLHDG('Print RTC' 'Notice')
     A                                      REFFLD(SSCOD1)
WA007A            PDICOD    R               COLHDG('Print PD' 'Notice Code')
     A                                      REFFLD(SSCOD1)
     A            PDI1N     R               COLHDG('Print 1st' 'PD Notice')
     A                                      REFFLD(SSCOD1)
     A            PDI2N     R               COLHDG('Print 2nd' 'PD Notice')
     A                                      REFFLD(SSCOD1)
     A            PDI3N     R               COLHDG('Print 3rd' 'PD Notice')
     A                                      REFFLD(SSCOD1)
     A            PDI4N     R               COLHDG('Print 4th' 'PD Notice')
     A                                      REFFLD(SSCOD1)
     A            PDI5N     R               COLHDG('Print 5th' 'PD Notice')
     A                                      REFFLD(SSCOD1)
     A            PDI6N     R               COLHDG('Print 6th' 'PD Notice')
     A                                      REFFLD(SSCOD1)
     A            PDIPRN    R               COLHDG('Principal' 'Due')
     A                                      REFFLD(SSAMT4)
     A            PDIINT    R               COLHDG('Interest' 'Due')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            PDIESC    R               COLHDG('Escrow' 'Due')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            PDILC     R               COLHDG('Late chgs' 'Due')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M017 A            PDICF     R               COLHDG('Commitment Fees' 'Due')
M017 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            PDIOTH    R               COLHDG('Other chg' 'Due')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            PDIMSC    R               COLHDG('Misc cost' 'Due')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            PDITOT    R               COLHDG('Total Amt' 'Due')
     A                                      REFFLD(SSAMT4)
     A            PDSFSD    R               COLHDG('Security Deposit Due')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     ** No of Payments Due
     A            NPMTDU    R               COLHDG('No of Payments' 'Past due')
     A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
     A            NIPMTD    R               COLHDG('No of Int Pymts' 'Past due')
     A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
M017 A            NLPMTD    R               COLHDG('No of LC/CC Pmt' 'Past due')
M017 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
M017 A            NCPMTD    R               COLHDG('No of CF Pmt' 'Past due')
M017 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
M017 A            NMPMTD    R               COLHDG('No of MC Pymts' 'Past due')
M017 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
M017 A            NOPMTD    R               COLHDG('No of OC Pymts' 'Past due')
M017 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
     ** No of Months Due
M001 A            PDMTHS    R               COLHDG('Months' 'past due')
M001 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
M001 A            IPDMTH    R               COLHDG('Months Interest' 'past due')
M001 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
M017 A            LPDMTH    R               COLHDG('Months LC/CC' 'past due')
M017 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
M017 A            CPDMTH    R               COLHDG('Months CF' 'past due')
M017 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
M017 A            MPDMTH    R               COLHDG('Months MC' 'past due')
M017 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
M017 A            OPDMTH    R               COLHDG('Months OC' 'past due')
M017 A*SS29                                 REFFLD(SSCOU3)
SS29 A                                      REFFLD(SSCOU5)
     ** No of Days Due
     A            PDDAYS    R               COLHDG('Days' 'Past Due')
     A                                      REFFLD(SSCOU5)
     A            IPDDAY    R               COLHDG('Days Int' 'Past Due')
     A                                      REFFLD(SSCOU5)
M017 A            LPDDAY    R               COLHDG('Days LC/CC' 'Past Due')
M017 A                                      REFFLD(SSCOU5)
M017 A            CPDDAY    R               COLHDG('Days CF' 'Past Due')
M017 A                                      REFFLD(SSCOU5)
M017 A            MPDDAY    R               COLHDG('Days MC' 'Past Due')
M017 A                                      REFFLD(SSCOU5)
M017 A            OPDDAY    R               COLHDG('Days OC' 'Past Due')
M017 A                                      REFFLD(SSCOU5)
SS12 A            P4THSC    R               COLHDG('HP 4th Schd flag')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            P1STRA    R               COLHDG('HP 1st RA flag')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            P2NDRA    R               COLHDG('HP 2nd RA flag')
SS12 A                                      REFFLD(SSCOD1)
V001 A*M017       NCPPDU    R               COLHDG('No. of CPF Payment' 'P.due')
V001 A*M017                                 REFFLD(SSCOU3)
V001 A*M017       CPPDAY    R               COLHDG('No.of days past' 'due(CPF)')
V001 A*M017                                 REFFLD(SSCOU3)
V001 A*M017       PDICPF    R               COLHDG('CPF amount' 'Due')
V001 A*M017                                 REFFLD(SSAMT3)
     A*************************************************************************
     A** LOAN TRANSACTION FILE - LNAATRNL
     A*************************************************************************
     A            LTACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LTACTY    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LTTRAN    R               COLHDG('Transaction' 'Code 1')
     A                                      REFFLD(SSTRAN)
     A            LTDORC    R               COLHDG('Debit/Credit' 'Code')
     A                                      REFFLD(SSCOD1)
     A            LTCTYP    R               COLHDG('Charge' 'Type')
     A                                      REFFLD(SSCOD2)
     A            LTAFFT    R               COLHDG('Affects' 'Code')
     A*V001                                 REFFLD(SSCOD1)
V001 A                                      REFFLD(SSCOD2)
     A            LTAMT     R               COLHDG('Account' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LTCUR     R               COLHDG('Account' 'Currency')
     A                                      REFFLD(SSCURC)
     A            LTDEC     R               COLHDG('Decimal positions')
     A                                      REFFLD(SSCOD1)
SS04 A            LTRATP    R               COLHDG('Rate' 'Type')
SS04 A                                      REFFLD(SSCOD2)
SS04 A            LTERAT    R               COLHDG('Exchange' 'Rate')
SS04 A                                      REFFLD(SSAMTQ)
SS04 A            LTCAMT    R               COLHDG('Converted amount')
     A                                      REFFLD(SSAMT4)
SS04 A            LTCCUR    R               COLHDG('Converted currency' )
     A                                      REFFLD(SSCURC)
SS04 A            LTCRTP    R               COLHDG('Converted' 'Rate Type')
SS04 A                                      REFFLD(SSCOD1)
SS04 A            LTCERT    R               COLHDG('Converted' 'Exchange Rate')
SS04 A                                      REFFLD(SSAMTQ)
SS04 A            LTBKAM    R               COLHDG('Bank amount')
SS04 A                                      REFFLD(SSAMT4)
SS04 A            LTBKCR    R               COLHDG('Bank currency')
SS04 A                                      REFFLD(SSCURC)
R1046A            LTBKRT    R               COLHDG('Bank' 'Exchange Rate')
R1046A                                      REFFLD(SSAMTQ)
R1046A            LTRVRT    R               COLHDG('Revalue' 'Exchange Rate')
R1046A                                      REFFLD(SSAMTQ)
M033 A            LTABK     R               COLHDG('Account' 'Bank')
M033 A                                      REFFLD(SSBANK)
SS26 A            LTCCOU    R               COLHDG('Controller' 'Country')
SS26 A                                      REFFLD(SSSTA3)
M033 A            LTCBK     R               COLHDG('Controller' 'Bank')
M033 A                                      REFFLD(SSBANK)
     A            LTABR     R               COLHDG('Account' 'Branch')
     A                                      REFFLD(SSBRAN)
     A            LTCBR     R               COLHDG('Controller' 'Branch')
     A                                      REFFLD(SSBRAN)
AM17 A            LTOPS8    R               COLHDG('Original Posting' 'Date')
AM17 A                                      REFFLD(SSDAT8)
     A            LTEFD8    R               COLHDG('Effective' 'Date')
     A                                      REFFLD(SSDAT8)
SS04 A            LTNDT8    R               COLHDG('Overnight' 'System Date')
SS04 A                                      REFFLD(SSDAT8)
AM01 A            LTINS8    R               COLHDG('Billing' 'Due Date')
M001 A                                      REFFLD(SSDAT8)
     A            LTTIME    R               COLHDG('Time')
     A                                      REFFLD(SSTIM6)
V001 A            LTETIM    R               COLHDG('Effective' 'Time')
V001 A                                      REFFLD(SSTIM6)
SS04 A            LTNTIM    R               COLHDG('Overnight' 'System Time')
SS04 A                                      REFFLD(SSTIM6)
     A            LTSRC     R               COLHDG('Input' 'Source')
     A                                      REFFLD(SSCOD1)
     A            LTBATN    R               COLHDG('Batch' 'Number')
     A*V004                                 REFFLD(SSCOU3)
V004 A                                      REFFLD(SSCOU5)
     A            LTSEQN    R               COLHDG('Sequence' 'Number')
     A                                      REFFLD(SSCOU9)
AM17 A            LTOSEQ    R               COLHDG('Original' 'Seq Number')
AM17 A                                      REFFLD(SSCOU9)
V001 A            LTPODR    R               COLHDG('Posting' 'Order')
V001 A                                      REFFLD(SSCOU5)
     A            LTUSER    R               COLHDG('User' 'ID')
     A                                      REFFLD(SSCODA)
     A            LTSPID    R               COLHDG('Supervisor ID')
     A                                      REFFLD(SSCODA)
R1013A            LTSPI2    R               COLHDG('Supervisor' 'ID 2')
R1013A                                      REFFLD(SSCODA)
     A            LTREAS    R               COLHDG('Reason' 'code')
     A                                      REFFLD(SSCOD2)
M001 A            LTREV     R               COLHDG('TLTRAN Rev' 'Generated')
M001 A                                      REFFLD(SSCOD1)
R1038A            LTPUR     R               COLHDG('Transaction' 'Purpose Code')
R1038A                                      REFFLD(SSCOD2)
R1038A            LTCRRS    R               COLHDG('Cheque Return' +
R1038A                                      'Reason Code')
R1038A                                      REFFLD(SSCOD2)
     ** PAR3 Default
SS04 A            LTRTRN    R               COLHDG('Rev Tran' 'Code')
SS04 A                                      REFFLD(SSTRAN)
     A            LTAFNP    R               COLHDG('Affects next' 'Pymt date')
     A                                      REFFLD(SSCOD1)
     A            LTAFAR    R               COLHDG('Affects' 'Amount Released')
     A                                      REFFLD(SSCOD1)
     A            LTEPEN    R               COLHDG('Subject to penalty')
     A                                      REFFLD(SSCOD1)
     A            LTRBAL    R               COLHDG('Affect rest balance')
     A                                      REFFLD(SSCOD1)
     A            LTPSEQ    R               COLHDG('Posting' 'Sequence')
     A                                      REFFLD(SSCOD1)
     A            LTAFRE    R               COLHDG('Affects' 'Amount refund')
     A                                      REFFLD(SSCOD1)
SS16 A            LTAFRD    R               COLHDG('Affects Redraw Limit')
SS16 A                                      REFFLD(SSCOD1)
SS16 A            LTRDRW    R               COLHDG('Redraw %')
SS16 A                                      REFFLD(SSPERD)
M001 A            LTTTYP    R               COLHDG('Transaction Type')
     A                                      REFFLD(SSCOD2)
M001 A            LTCORF    R               COLHDG('Correction Flag')
     A                                      REFFLD(SSCOD1)
BA01 A            LTREDM    R               COLHDG('Redemption' 'Transaction')
BA01 A                                      REFFLD(SSCOD1)
M033 A            LTWAIV    R               COLHDG('Waiver' 'Transaction')
M033 A                                      REFFLD(SSCOD1)
M033 A            LTADJF    R               COLHDG('Affect Susp/Prov' 'Balance')
     A                                      REFFLD(SSCOD1)
     A            LTPART    R               COLHDG('Part Change' 'Pmt Code')
     A                                      REFFLD(SSCOD1)
     A            LTSETT    R               COLHDG('Settlement' 'Transaction')
     A                                      REFFLD(SSCOD1)
AM01 A            LTEXAF    R               COLHDG('Excess Amount' -
     A                                      'Affect Code')
     A                                      REFFLD(SSCOD2)
     ** GL Recon
V001 A            LTGLIF    R               COLHDG('GL Interface' 'Number')
     A                                      REFFLD(SSCOU3)
SS04 A            LTSSID    R               COLHDG('Source' 'System ID')
M001 A*R1025                                REFFLD(SSCOD4)
R1025A                                      REFFLD(SSCODA)
R1025A            LTGLSD    R               COLHDG('GL Source' 'ID')
R1025A                                      REFFLD(SSCODA)
SS04 A            LTGLRR    R               COLHDG('Reconciliation' 'Ref No')
M001 A*SS04                                 REFFLD(SSCOUD)
SS04 A                                      REFFLD(SSGLNO)
SS04 A            LTTXN     R               COLHDG('Transaction' 'Ref No')
SS04 A                                      REFFLD(SSREFN)
     ** Other Info
M001 A            LTTMOD    R               COLHDG('Transaction' 'Mode')
M001 A                                      REFFLD(SSCOD4)
     A            LTAXTC    R               COLHDG('Auxilary' 'Trans Code')
HXXX A                                      REFFLD(SSCODA)
     A            LTBOPC    R               COLHDG('BOP Code')
     A                                      REFFLD(SSCOU5)
M001 A*SS04       LTRATP    R               COLHDG('Rate' 'Type')
M001 A*SS04                                 REFFLD(SSCOD1)
M001 A*SS04       LTERAT    R               COLHDG('Exchange' 'Rate')
M001 A*SS04                                 REFFLD(SSAMTQ)
M001 A            LTDEAL    R               COLHDG('Dealer' 'Code')
M001 A*R1025                                REFFLD(SSCOD3)
R1025A                                      REFFLD(SSCODA)
M001 A            LTCONN    R               COLHDG('Deal No.' '/Contract No.')
M001 A*R1025                                REFFLD(SSCODA)
R1025A                                      REFFLD(SSCODF)
R1025A            LTRMNO    R               COLHDG('Remmitance' 'No.')
R1025A                                      REFFLD(SSDESS)
SS12 A            LTCOID    R               COLHDG('Collateral ID')
SS12 A                                      REFFLD(SSDCID)
SS12 A            LTCMID    R               COLHDG('Salesman Comm code')
SS12 A*R1001                                REFFLD(SSCODB)
R1001A                                      REFFLD(SSCODA)
M001 A            LTSWFT    R               COLHDG('Swift/Draft' '/CO No./Mas')
M001 A*SS04                                 REFFLD(SSCODB)
SS04 A                                      REFFLD(SSREFN)
SS26 A            SERPRE    R               COLHDG('Cheque Prefix')
SS26 A                                      REFFLD(SSCOD3)
     A            SERIAL    R               COLHDG('Cheque Number')
     A*SS26                                 REFFLD(SSCOU7)
SS26 A                                      REFFLD(SSCOU9)
     A            ROUTE     R               COLHDG('Routing No')
     A                                      REFFLD(SSCOU9)
M001 A            LTRACC    R               COLHDG('Retail/GL/Card' -
M001 A                                      'Account No.')
M001 A                                      REFFLD(SSACCN)
M001 A            LTRTYP    R               COLHDG('Retail/GL/Card' -
M001 A                                      'A/C Type')
M001 A                                      REFFLD(SSCOD1)
M001 A            LTRCUR    R               COLHDG('Retail/GL/Card' -
M001 A                                      'Currency')
M001 A                                      REFFLD(SSCURC)
SS26 A            LTRACN    R               COLHDG('Retail/GL/Card' -
SS26 A                                      'Name')
SS26 A                                      REFFLD(SSDESM)
M001 A            LTPAYE    R               COLHDG('Payee' 'Name')
M001 A                                      REFFLD(SSNAML)
M001 A*R1025      LTNOSA    R               COLHDG('Nostro' 'Agent')
M001 A*R1025                                REFFLD(SSCODC)
R1025A            LTNOSA    R               COLHDG('Bank/Nostro' 'Agent')
R1025A                                      REFFLD(SSCODF)
M001 A            LTOREF    R               COLHDG('Our' 'Reference')
M001 A                                      REFFLD(SSGLNO)
M001 A            LTYREF    R               COLHDG('Your' 'Reference')
M001 A                                      REFFLD(SSGLNO)
V001 A            LTAREF    R               COLHDG('Additional' 'Ref No.')
V001 A                                      REFFLD(SSMSG0)
M001 A            LTSRMK    R               COLHDG('Statement' 'Remark')
M001 A                                      REFFLD(SSDESM)
M001 A            LTTEXT    R               COLHDG('Transaction' 'Text')
M001 A                                      REFFLD(SSDESM)
V001 A            LTCPF     R               COLHDG('CPF Payment')
V001 A                                      REFFLD(SSCOD1)
V001 A            LTCPD8    R               COLHDG('CPF Payment' 'Date')
V001 A                                      REFFLD(SSDAT8)
     A            LTEFTA    R               COLHDG('EFT No')
     A                                      REFFLD(SSACCN)
     A            LTEFTT    R               COLHDG('EFT Type')
     A                                      REFFLD(SSCOD1)
     A            LTEFTC    R               COLHDG('EFT type code')
     A                                      REFFLD(SSCOD3)
V001 A            LTEFTH    R               COLHDG('Additional' 'Infomation')
V001 A                                      VARLEN(10)
V001 A                                      REFFLD(SSDESX)
R1031A            LTRCPT    R               COLHDG('Receipt Number')
R1031A                                      REFFLD(SSGLNO)
     A** FOR POST DATED CHEQUE FILE
     A** NEW FIELDS ADDED FOR VERSION 5
M001 A            LTTCID    R               COLHDG('CREATED' 'USER')
M001 A                                      REFFLD(SSCODA)
M001 A            LTTCD8    R               COLHDG('CREATED' 'DATE')
M001 A                                      REFFLD(SSDAT8)
M001 A            LTTCTM    R               COLHDG('CREATED' 'TIME')
M001 A                                      REFFLD(SSTIM6)
SS13 A            LTSTIM    R               COLHDG('SYSTEM' 'TIME')
SS13 A                                      REFFLD(SSTIM6)
CI11 A            LTMBAT    R               COLHDG('Batch number')
CI11 A                                      REFFLD(SSCOU5)
     ** Field removed from LNTRNL
     A*M001       LTCHKP    R               COLHDG('Check' 'prefix')
     A*M001                                 REFFLD(SSCOD3)
     A*M001       LTPURC    R               COLHDG('Purchase' 'cheque')
     A*M001                                 REFFLD(SSCOD1)
     A**V001      LTBRAM    R               COLHDG('Branch amount')
     A**V001                                REFFLD(SSAMT4)
     A**V001      LTBRCR    R               COLHDG('Branch currency'   )
     A**V001                                REFFLD(SSCURC)
     A*V001       LHGLIF    R               COLHDG('GL Interface' 'Number')
     A**V001      LTREV     R               COLHDG('TLTRAN Rev' 'Generated')
     A**V001                                REFFLD(SSCOD1)
     A**V001      LTCURR    R               COLHDG('Currency')
     A**V001                                REFFLD(SSCURC)
     A**V001      LTCDEC    R               COLHDG('Decimals')
     A**V001                                REFFLD(SSCOD1)
     A*************************************************************************
     A** LOAN TRANSACTION FILE FOR SPLIT PAYMENTS (LNTRN2)
     A*************************************************************************
     A*SS03       LT2BAT    R               COLHDG('Batch' 'Number')
     A*V005                                 REFFLD(SSCOU3)
V005 A*SS03                                 REFFLD(SSCOU5)
     A*SS03       LT2SEQ    R               COLHDG('Sequence' 'Number')
     A*SS03                                 REFFLD(SSCOU9)
     A*SS03       LT2ACT    R               COLHDG('Account' 'Number')
     A*SS03                                 REFFLD(SSACCN)
     A*SS03       LT2TYP    R               COLHDG('Account' 'Type')
     A*SS03                                 REFFLD(SSACCT)
     A*SS03       LT2AMT    R               COLHDG('Amount')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LT2CUR    R               COLHDG('Currency')
     A*SS03                                 REFFLD(SSCURC)
     A*SS03       LT2DEC    R               COLHDG('Decimal positions')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LT2CAM    R               COLHDG('Converted amount')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LT2CCR    R               COLHDG('Converted currency')
     A*SS03                                 REFFLD(SSCURC)
     A**V001      LT2BRA    R               COLHDG('Branch amount')
     A**V001                                REFFLD(SSAMT4)
     A**V001      LT2BRC    R               COLHDG('Branch currency'   )
     A**V001                                REFFLD(SSCURC)
     A**V001      LT2BKA    R               COLHDG('Bank amount')
     A**V001                                REFFLD(SSAMT4)
     A**V001      LT2BKC    R               COLHDG('Bank currency')
     A**V001                                REFFLD(SSCURC)
     A*SS03       LT2TRN    R               COLHDG('Tran' ' Code')
     A*SS03                                 REFFLD(SSTRAN)
     A*SS03       LT2PRN    R               COLHDG('Principal')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LT2INT    R               COLHDG('Interest')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LT2ESC    R               COLHDG('Escrow')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LT2LTC    R               COLHDG('Late' 'Charges')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LT2OTH    R               COLHDG('Other' 'Charges')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LT2MSC    R               COLHDG('Misc Cost')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LT2POF    R               COLHDG('Payoff' 'Code')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LT2DA6    R               COLHDG('Date')
     A*SS03                                 REFFLD(SSDAT8)
     A*SS03       LT2SRC    R               COLHDG('Source of' 'Transaction')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LT2ETA    R               COLHDG('EFT No')
     A*SS03                                 REFFLD(SSACCN)
     A*SS03       LT2ETT    R               COLHDG('EFT Type')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LT2ETC    R               COLHDG('EFT type code')
     A*SS03                                 REFFLD(SSCOD3)
     A*SS03       LT2USR    R               COLHDG('User' 'ID')
     A*SS03                                 REFFLD(SSCODA)
     A*SS03       LT2ADJ    R               COLHDG('Int Adj' 'Flag(Y/N)')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LT2TIM    R               COLHDG('Time')
     A*SS03                                 REFFLD(SSTIM6)
     A*SS03       LT2AFR    R               COLHDG('Affects' 'Amount refund')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LT2REA    R               COLHDG('Exception' 'code')
     A*SS03                                 REFFLD(SSCOD2)
     A*SS03       LT2SID    R               COLHDG('Supervisor ID')
     A*SS03                                 REFFLD(SSCODA)
     A*************************************************************************
     A** LOAN EXTENSION FEE FILE-LNEXFE
     A*************************************************************************
     A            LNEFEE    R               COLHDG('Extension' 'Fee')
     A                                      REFFLD(SSAMT4)
     A            LNEFD8    R               COLHDG('Ext Fee' 'Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
     A** LOAN STATEMENT REQUEST - LNHREQ
     A*************************************************************************
     A*M001       LHRTYP    R               COLHDG('Type of' 'Request')
     A*M001                                 REFFLD(SSCOD2)
M001 A            LHTYPR    R               COLHDG('Type of' 'Request')
M001 A                                      REFFLD(SSCOD2)
     A            LHRACT    R               COLHDG('Account' 'Requested')
     A                                      REFFLD(SSACCN)
     A            LHRPDD    R               COLHDG('Past Due' 'Days')
     A                                      REFFLD(SSCOU5)
     A*************************************************************************
     A** BILLING FILE FOR INTEREST ONLY LOANS - LNBILL
     A*************************************************************************
     A            LBLACT    R               COLHDG('Loan' 'Acct N')
     A                                      REFFLD(SSACCN)
     A            LBLDT8    R               COLHDG('Billing' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LBLAMT    R               COLHDG('Billing' 'Amount')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A** BILLING NOTICE FILE-LNBNOT
     A*************************************************************************
     A            MATCOD    R               COLHDG('Maturing' 'Code')
     A                                      REFFLD(SSCOD1)
     A            LBCDT8    R               COLHDG('Due' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LBCPRN    R               COLHDG('Current' 'Principal')
     A                                      REFFLD(SSAMT4)
     A            LBCINT    R               COLHDG('Current' 'Interest')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBCESC    R               COLHDG('Current' 'Escrow')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LBCLC     R               COLHDG('Current' 'Late Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
WD005A            LBCCF     R               COLHDG('Current' 'Com Fee')
WD005A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBCOC     R               COLHDG('Current' 'Other Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBCMC     R               COLHDG('Current' 'Misc Cost')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
V999 A            LBCREF    R               COLHDG('Current' 'Refund')
V999 A                                      REFFLD(SSAMT4)
V999 A            LBCPRF    R               COLHDG('Current' 'Profit')
V999 A                                      REFFLD(SSAMT4)
V999 A            LBCCOM    R               COLHDG('Current' 'Comission')
V999 A                                      REFFLD(SSAMT4)
M043 A            LBCRIN    R               COLHDG('Current' 'Restruc. Int.')
M043 A                                      REFFLD(SSAMT4)
SS26 A            LBCMIN    R               COLHDG('Current' 'Moratorium Int.')
SS26 A                                      REFFLD(SSAMT4)
M043 A            LBCRLC    R               COLHDG('Current' 'Restruc. LC.')
M043 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LBCVAT    R               COLHDG('Current' 'VAT')
SS26 A                                      REFFLD(SSAMT4)
     A            LBCTOT    R               COLHDG('Current' 'Total')
     A                                      REFFLD(SSAMT4)
     A            LBPPRN    R               COLHDG('Past due' 'Principal')
     A                                      REFFLD(SSAMT4)
     A            LBPINT    R               COLHDG('Past due' 'Interest')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBPESC    R               COLHDG('Past due' 'Escrow')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LBPLC     R               COLHDG('Past due' 'Late Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
WD005A            LBPCF     R               COLHDG('Past due' 'Com Fee')
WD005A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBPOC     R               COLHDG('Past due' 'Other Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBPMC     R               COLHDG('Past due' 'Misc Cost')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
V999 A            LBPREF    R               COLHDG('Past due' 'Refund')
V999 A                                      REFFLD(SSAMT4)
V999 A            LBPPRF    R               COLHDG('Past due' 'Profit')
V999 A                                      REFFLD(SSAMT4)
V999 A            LBPCOM    R               COLHDG('Past due' 'Comission')
V999 A                                      REFFLD(SSAMT4)
M043 A            LBPRIN    R               COLHDG('Past due' 'Restruc. Int.')
M043 A                                      REFFLD(SSAMT4)
SS26 A            LBPMIN    R               COLHDG('Past due' 'Moratorium Int.')
SS26 A                                      REFFLD(SSAMT4)
M043 A            LBPRLC    R               COLHDG('Past due' 'Restruc. LC.')
M043 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LBPVAT    R               COLHDG('Past due' 'VAT')
SS26 A                                      REFFLD(SSAMT4)
     A            LBPTOT    R               COLHDG('Past due' 'Total')
     A                                      REFFLD(SSAMT4)
     A            LBTPRN    R               COLHDG('Total' 'Principal')
     A                                      REFFLD(SSAMT4)
     A            LBTINT    R               COLHDG('Total' 'Interest')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBTESC    R               COLHDG('Total' 'Escrow')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LBTLC     R               COLHDG('Total' 'Late Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
WD005A            LBTCF     R               COLHDG('Total' 'Com Fee')
WD005A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBTOC     R               COLHDG('Total' 'Other Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBTMC     R               COLHDG('Total' 'Misc Cost')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
V999 A            LBTREF    R               COLHDG('Total' 'Refund')
V999 A                                      REFFLD(SSAMT4)
V999 A            LBTPRF    R               COLHDG('Total' 'Profit')
V999 A                                      REFFLD(SSAMT4)
V999 A            LBTCOM    R               COLHDG('Total' 'Comission')
V999 A                                      REFFLD(SSAMT4)
M043 A            LBTRIN    R               COLHDG('Total' 'Restruc. Int.')
M043 A                                      REFFLD(SSAMT4)
SS26 A            LBTMIN    R               COLHDG('Total' 'Moratorium Int.')
SS26 A                                      REFFLD(SSAMT4)
M043 A            LBTRLC    R               COLHDG('Total' 'Restruc. LC.')
M043 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LBTVAT    R               COLHDG('Total' 'VAT')
SS26 A                                      REFFLD(SSAMT4)
     A            LBTTOT    R               COLHDG('Total' 'Amount')
     A                                      REFFLD(SSAMT4)
M043 A            LBCID     R               COLHDG('Restructure/Mora' 'Ind')
M043 A                                      REFFLD(SSCOD1)
SS12 A            LBCPM8    R               COLHDG('Dealer Paym date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            DLRNO6    R               COLHDG('Dealer No')
SS12 A                                      REFFLD(SSCOUB)
SS12 A            SDLRNO    R               COLHDG('Sub-Dealer No')
SS12 A                                      REFFLD(SSCOUB)
M001 A            LBCCID    R               COLHDG('Created' 'User')
M001 A                                      REFFLD(SSCODA)
M001 A            LBCCD8    R               COLHDG('Created' 'Date')
M001 A                                      REFFLD(SSDAT8)
M001 A            LBCCTM    R               COLHDG('Created' 'Time')
M001 A                                      REFFLD(SSTIM6)
     A*****************************************************************
     A** PAST DUE REPORT FILE FOR PRINTING NOTICES-LNPNOT
     A            NOTNUM    R               COLHDG('Notice' 'Number')
     A                                      REFFLD(SSCOU1)
     A*************************************************************************
     A** PAST DUE REPORT TOTAL FILE - LNPTOT
     A*************************************************************************
     A            LNPNUM    R               COLHDG('Total Number' 'Past due')
     A                                      REFFLD(SSCOU5)
     A            LNPAMT    R               COLHDG('Total Amount' 'Past due')
     A                                      REFFLD(SSAMT4)
     A            LNTNUM    R               COLHDG('Total Number' 'This Type')
     A                                      REFFLD(SSCOU5)
     A            LNTAMT    R               COLHDG('Total Amount' 'This type')
     A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A** NEW, EXTENDED, RENEWED LOAN FILE - LNMSTO
     A*************************************************************************
     A            LNMSOI    R               COLHDG('Identifier')
     A                                      REFFLD(SSCOD1)
     A*
     A*************************************************************************
     A** LOAN DEPOSIT RELATIONSHIP FILE - LNDEPR
     A*************************************************************************
V002 A**          RLACTP    R               COLHDG('Account' 'Type')
V002 A**                                    REFFLD(SSACCT)
V002 A**          RLCURC    R               COLHDG('Account' 'Currency')
V002 A**                                    REFFLD(SSCURC)
V002 A**          RLASEQ    R               COLHDG('Account' 'Currency Seq')
V002 A**                                    REFFLD(SSASEQ)
R1033A            RLACTN    R               COLHDG('Account' 'No')
R1033A                                      REFFLD(SSACCN)
HLB  A            RLACTP    R               REFFLD(SSACCT)
HLB  A                                      COLHDG('Account Type')
HLB  A            RLSNME    R               REFFLD(SSNAMS)
HLB  A                                      COLHDG('Short Name')
     A            RLACCT    R               REFFLD(SSACCN)
     A                                      COLHDG('Related' 'Account No')
     A            RLACTY    R               COLHDG('Related' 'Account type')
     A                                      REFFLD(SSCOD1)
HLB  A            RLFSNM    R               REFFLD(SSNAMS)
HLB  A                                      COLHDG('Related' 'Account'-
HLB  A                                      'Formatted' 'Short Name')
M006 A            RLTYPE    R               REFFLD(SSCOD2)
M006 A                                      COLHDG('Relationship' 'Type')
M038 A            RLATOA    R               REFFLD(SSCOD2)
M038 A                                      COLHDG('Account to' 'Account'-
M038 A                                      'Relationship')
V002 A**          RLRCUR    R               COLHDG('Related' 'Acct Curr')
V002 A**                                    REFFLD(SSCURC)
V002 A**          RLRASQ    R               COLHDG('Related' 'Acct Curr Seq')
V002 A**                                    REFFLD(SSASEQ)
     A            RLAMT     R               COLHDG('Related Amount')
     A                                      REFFLD(SSAMT4)
     A            RLRATD    R               COLHDG('Rate' 'Difference')
     A                                      REFFLD(SSPERD)
     A            RLEDT8    R               COLHDG('Expiration' 'Date')
     A                                      REFFLD(SSDAT8)
     A            RLDESC    R               COLHDG('Remarks')
     A                                      REFFLD(SSDESC)
HLB  A            RLCALF    R               REFFLD(SSCOD1)
HLB  A                                      COLHDG('Fin Calc.' 'profit/refund')
HLB  A            RLLIMT    R               REFFLD(SSAMT4)
HLB  A                                      COLHDG('Yesterday' 'OD/DD Limit')
HLB  A            RLUTIL    R               REFFLD(SSAMT4)
HLB  A                                      COLHDG('Yesterday' 'OD/DD Utilised')
HLB  A            RLMAXR    R               REFFLD(SSPERD)
HLB  A                                      COLHDG('OD/DD' 'Maximum refund %')
SS18 A            RLEXCE    R               COLHDG('Excess Amount')
SS18 A                                      REFFLD(SSAMT4)
SS18 A            RLCLMT    R               COLHDG('Current Limit')
SS18 A                                      REFFLD(SSAMT4)
SS18 A            RLSLMT    R               COLHDG('Schedule Limt')
SS18 A                                      REFFLD(SSAMT4)
SS18 A            RLPRIN    R               COLHDG('Principal Due')
SS18 A                                      REFFLD(SSAMT4)
SS18 A            RLPPYB    R               COLHDG('Principal' 'Fin. Payable')
SS18 A                                      REFFLD(SSAMT4)
SS18 A            RLYLMT    R               COLHDG('Yesterday Drawing' 'Limit')
SS18 A                                      REFFLD(SSAMT4)
SS18 A            RLDLMI    R               COLHDG('Decrease Limit Indi')
SS18 A                                      REFFLD(SSCOD1)
SS18 A            RLMATI    R               COLHDG('Acc Matured Ind.')
SS18 A                                      REFFLD(SSCOD1)
R1033A            RLDRST    R               COLHDG('Acc Dormant Status')
R1033A                                      REFFLD(SSCOD1)
R1033A            RLDRD8    R               COLHDG('Acc Dormant Date')
R1033A                                      REFFLD(SSDAT8)
SS02 A            RLTSEQ    R               COLHDG('ODTIER' '-Tier Seq')
     A                                      REFFLD(SSACCN)
SS18 A            RLCOD1    R               COLHDG('Reserve Code 1')
SS18 A                                      REFFLD(SSCOD1)
SS18 A            RLCOD2    R               COLHDG('Reserve Code 2')
SS18 A                                      REFFLD(SSCOD1)
SS18 A            RLAMT1    R               COLHDG('Reserve Amount 1')
SS18 A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A* LOAN ESCROW DIST CHECK FILE - LNEDCK
     A*************************************************************************
     A            LNECDN    R               COLHDG('Distribution' 'Code')
     A                                      REFFLD(SSCOU5)
     A            LNEACT    R               COLHDG('Loan' 'Acct Nr')
     A                                      REFFLD(SSACCN)
     A            LNESEQ    R               COLHDG('Seq' 'Number')
     A                                      REFFLD(SSCOU3)
     A            LNEAMT    R               COLHDG('Distribution' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LNEDTC    R               COLHDG('Dist' 'Tran code')
     A                                      REFFLD(SSCOU3)
     A            LNEDRN    R               COLHDG('Dist' 'Reference number')
     A                                      REFFLD(SSCODF)
     A*************************************************************************
     A*** Loan POSTING FILE -  LNPOST
     A*************************************************************************
     A*M001       PSTCST    R               COLHDG('Cost center')
H001 A*                                     REFFLD(SSCOU3)
H001 A*M001                                 REFFLD(SSCOST)
     A*M001       PSTPRD    R               COLHDG('Product code')
H001 A*                                     REFFLD(SSCOU3)
H001 A*M001                                 REFFLD(SSPROC)
     A            LNPTYP    R               COLHDG('LNPOST type')
     A                                      REFFLD(SSCOD1)
     A*** VALUES - N = Normal loan
     A***          P = Participation
     A***          C = Partial charge off
     A***          8 = Full charge off
M001 A            LNCUID    R               COLHDG('Created' 'User')
M001 A                                      REFFLD(SSCODA)
M001 A            LNCDT8    R               COLHDG('Created' 'Date')
M001 A                                      REFFLD(SSDAT8)
M001 A            LNCTIM    R               COLHDG('Created' 'Time')
M001 A                                      REFFLD(SSTIM6)
     A*************************************************************************
     A** LNMTRN - TELLER MEMO POST FILE
     A*************************************************************************
     A*SS03       LTMTEL    R               COLHDG('Supervisor Number')
     A*SS03                                 REFFLD(SSCODA)
     A*SS03       LTMSEQ    R               COLHDG('Sequence Number')
     A*SS03                                 REFFLD(SSCOU9)
     A*SS03       LTMTIM    R               COLHDG('Time Entered')
     A*SS03                                 REFFLD(SSTIM6)
     A*SS03       LTMACT    R               COLHDG('Account Number')
     A*SS03                                 REFFLD(SSACCN)
     A*SS03       LTMTYP    R               COLHDG('Account Type')
     A*SS03                                 REFFLD(SSACCT)
CI43 A*SS03       LTMPAC    R               COLHDG('Part/Chg off' 'Acct Num')
     A*SS03                                 REFFLD(SSACCN)
CI43 A*SS03       LTMPID    R               COLHDG('Participation' 'Code')
     A*SS03                                 REFFLD(SSCOD1)
CI43 A*SS03       LTMNUM    R               COLHDG('Account' 'Group Number')
     A*SS03                                 REFFLD(SSACCN)
CI43 A*SS03       LTMMCL    R               COLHDG('Multi CCY Loan' 'Code')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LTMAMT    R               COLHDG('Amount')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LTMCUR    R               COLHDG('Currency')
     A*SS03                                 REFFLD(SSCURC)
     A*SS03       LTMDEC    R               COLHDG('Decimal positions')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LTMCAM    R               COLHDG('Converted amount')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LTMCCR    R               COLHDG('Converted currency')
     A*SS03                                 REFFLD(SSCURC)
     A*SS03       LTMBRA    R               COLHDG('Branch amount')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LTMBRC    R               COLHDG('Branch currency'   )
     A*SS03                                 REFFLD(SSCURC)
     A*SS03       LTMBKA    R               COLHDG('Bank amount')
     A*SS03                                 REFFLD(SSAMT4)
     A*SS03       LTMBKC    R               COLHDG('Bank currency')
     A*SS03                                 REFFLD(SSCURC)
CI11 A*SS03       LTMMOD    R               COLHDG('Mode of payment')
CI11 A*SS03                                 REFFLD(SSCURC)
     A*SS03       LTMDC     R               COLHDG('Debit/Credit')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LTMCTP    R               COLHDG('Charge' 'Type')
     A*SS03                                 REFFLD(SSCOD2)
     A*SS03       LTMCOR    R               COLHDG('Correction')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LTMDA6    R               COLHDG('Date')
     A*SS03                                 REFFLD(SSDAT8)
     A*SS03       LTMED6    R               COLHDG('Effective' 'Date')
     A*SS03                                 REFFLD(SSDAT8)
LC01 A*SS03       LMINS7    R               COLHDG('Instalment' 'Due Date')
LC01 A*SS03                                 REFFLD(SSDAT7)
LC01 A*SS03       LMINS6    R               COLHDG('Instalment' 'Due Date')
LC01 A*SS03                                 REFFLD(SSDAT8)
LC01 A*SS03       LMLCII    R               COLHDG('Late Charge' 'Indicator')
LC01 A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LTMSRC    R               COLHDG('Source')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LTMACU    R               COLHDG('Entered after Cutoff')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LTMJOB    R               COLHDG('Job Name')
     A*SS03                                 REFFLD(SSCODA)
     A*SS03       LTMREM    R               COLHDG('Remarks')
     A*SS03                                 REFFLD(SSDESC)
     A*SS03       LTMUSR    R               COLHDG('User Name')
     A*SS03                                 REFFLD(SSCODA)
     A*SS03       LTMAFT    R               COLHDG('Affects Code')
     A*V001                                 REFFLD(SSCOD1)
V001 A*SS03                                 REFFLD(SSCOD2)
V010 A*SS03       LTMRAT    R               COLHDG('Rate Type')
     A*SS03                                 REFFLD(SSCOD1)
V010 A*SS03       LTMRAC    R               COLHDG('Retail/GL' 'Account No.')
     A*SS03                                 REFFLD(SSCODJ)
V010 A*SS03       LTMNOS    R               COLHDG('Nostro Agent')
     A*SS03                                 REFFLD(SSCODC)
     A*SS03       LTMTRN    R               COLHDG('Transaction Code')
     A*SS03                                 REFFLD(SSTRAN)
     A*SS03       LTMADJ    R               COLHDG('Int Adj' 'Flag(Y/N)')
     A*SS03                                 REFFLD(SSCOD1)
     A*SS03       LTMREA    R               COLHDG('Reason' 'code')
     A*SS03                                 REFFLD(SSCOD2)
V003 A*SS03       LTMCPF    R               COLHDG('CPF Payment')
V003 A*SS03                                 REFFLD(SSCOD1)
V003 A*SS03       LTMCP7    R               COLHDG('CPF Payment' 'Date')
V003 A*SS03                                 REFFLD(SSDAT7)
V003 A*SS03       LTMCP6    R               COLHDG('CPF Payment' 'Date')
V003 A*SS03                                 REFFLD(SSDAT8)
V003 A*SS03       LTMETM    R               COLHDG('Effective' 'Time')
V003 A*SS03                                 REFFLD(SSTIM6)
V003 A*SS03       LTMPOR    R               COLHDG('Posting' 'Order')
V003 A*SS03                                 REFFLD(SSCOU5)
V003 A*SS03       LTMEFH    R               COLHDG('Additional' 'Infomation')
V003 A*SS03                                 VARLEN(10)
V003 A*SS03                                 REFFLD(SSDESX)
V003 A*SS03       LTMCSQ    R               COLHDG('CBAS Sequence' 'Number')
V003 A*SS03                                 REFFLD(SSCOU5)
     A*************************************************************************
     A** SPECIFIC PROVISION FILE (LNPROV)
     A*************************************************************************
M001 A*SS01       SPCRID    R               COLHDG('Record Identifier')
M001 A*SS01                                 REFFLD(SSCOD1)
     A*SS01       SPACNO    R               COLHDG('Account No.')
     A*SS01                                 REFFLD(SSACCN)
     A*SS01       SPACTP    R               COLHDG('Account' 'Type')
     A*SS01                                 REFFLD(SSACCT)
M026 A*SS01       SPYEAR    R               COLHDG('Financial Year')
M026 A*SS01                                 REFFLD(SSDAT4)
     A*SS01       SPCIFN    R               COLHDG('CIF No.')
     A*SS01                                 REFFLD(SSCIFN)
     A*SS01       SPSNME    R               COLHDG('Short Name')
     A*SS01                                 REFFLD(SSDESS)
     A*SS01       SPFSNM    R               REFFLD(SSNAMS)
     A*SS01                                 COLHDG('Formatted' 'short name')
M026 A*SS01       SPREMK    R               COLHDG('Remark')
M026 A*SS01                                 REFFLD(SSDESL)
M026 A*SS01       SPOPRO    R               COLHDG('Opening Spec Prov')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR01    R               COLHDG('Spec Prov' 'Additional 01')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR02    R               COLHDG('Spec Prov' 'Additional 02')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR03    R               COLHDG('Spec Prov' 'Additional 03')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR04    R               COLHDG('Spec Prov' 'Additional 04')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR05    R               COLHDG('Spec Prov' 'Additional 05')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR06    R               COLHDG('Spec Prov' 'Additional 06')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR07    R               COLHDG('Spec Prov' 'Additional 07')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR08    R               COLHDG('Spec Prov' 'Additional 08')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR09    R               COLHDG('Spec Prov' 'Additional 09')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR10    R               COLHDG('Spec Prov' 'Additional 10')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR11    R               COLHDG('Spec Prov' 'Additional 11')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPR12    R               COLHDG('Spec Prov' 'Additional 12')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT01    R               COLHDG('Spec Prov' 'Transfer 01')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT02    R               COLHDG('Spec Prov' 'Transfer 02')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT03    R               COLHDG('Spec Prov' 'Transfer 03')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT04    R               COLHDG('Spec Prov' 'Transfer 04')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT05    R               COLHDG('Spec Prov' 'Transfer 05')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT06    R               COLHDG('Spec Prov' 'Transfer 06')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT07    R               COLHDG('Spec Prov' 'Transfer 07')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT08    R               COLHDG('Spec Prov' 'Transfer 08')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT09    R               COLHDG('Spec Prov' 'Transfer 09')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT10    R               COLHDG('Spec Prov' 'Transfer 10')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT11    R               COLHDG('Spec Prov' 'Transfer 11')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPT12    R               COLHDG('Spec Prov' 'Transfer 12')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW01    R               COLHDG('Spec Prov' 'W/Back 01')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW02    R               COLHDG('Spec Prov' 'W/Back 02')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW03    R               COLHDG('Spec Prov' 'W/Back 03')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW04    R               COLHDG('Spec Prov' 'W/Back 04')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW05    R               COLHDG('Spec Prov' 'W/Back 05')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW06    R               COLHDG('Spec Prov' 'W/Back 06')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW07    R               COLHDG('Spec Prov' 'W/Back 07')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW08    R               COLHDG('Spec Prov' 'W/Back 08')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW09    R               COLHDG('Spec Prov' 'W/Back 09')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW10    R               COLHDG('Spec Prov' 'W/Back 10')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW11    R               COLHDG('Spec Prov' 'W/Back 11')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPPW12    R               COLHDG('Spec Prov' 'W/Back 12')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA01    R               COLHDG('Spec Prov' 'W/Back Adj 01')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA02    R               COLHDG('Spec Prov' 'W/Back Adj 02')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA03    R               COLHDG('Spec Prov' 'W/Back Adj 03')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA04    R               COLHDG('Spec Prov' 'W/Back Adj 04')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA05    R               COLHDG('Spec Prov' 'W/Back Adj 05')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA06    R               COLHDG('Spec Prov' 'W/Back Adj 06')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA07    R               COLHDG('Spec Prov' 'W/Back Adj 07')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA08    R               COLHDG('Spec Prov' 'W/Back Adj 08')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA09    R               COLHDG('Spec Prov' 'W/Back Adj 09')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA10    R               COLHDG('Spec Prov' 'W/Back Adj 10')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA11    R               COLHDG('Spec Prov' 'W/Back Adj 11')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWA12    R               COLHDG('Spec Prov' 'W/Back Adj 12')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT01    R               COLHDG('Spec Prov' 'W/Back Trf 01')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT02    R               COLHDG('Spec Prov' 'W/Back Trf 02')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT03    R               COLHDG('Spec Prov' 'W/Back Trf 03')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT04    R               COLHDG('Spec Prov' 'W/Back Trf 04')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT05    R               COLHDG('Spec Prov' 'W/Back Trf 05')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT06    R               COLHDG('Spec Prov' 'W/Back Trf 06')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT07    R               COLHDG('Spec Prov' 'W/Back Trf 07')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT08    R               COLHDG('Spec Prov' 'W/Back Trf 08')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT09    R               COLHDG('Spec Prov' 'W/Back Trf 09')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT10    R               COLHDG('Spec Prov' 'W/Back Trf 10')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT11    R               COLHDG('Spec Prov' 'W/Back Trf 11')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWT12    R               COLHDG('Spec Prov' 'W/Back Trf 12')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO01    R               COLHDG('Spec Prov' 'W/Off 01')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO02    R               COLHDG('Spec Prov' 'W/Off 02')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO03    R               COLHDG('Spec Prov' 'W/Off 03')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO04    R               COLHDG('Spec Prov' 'W/Off 04')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO05    R               COLHDG('Spec Prov' 'W/Off 05')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO06    R               COLHDG('Spec Prov' 'W/Off 06')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO07    R               COLHDG('Spec Prov' 'W/Off 07')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO08    R               COLHDG('Spec Prov' 'W/Off 08')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO09    R               COLHDG('Spec Prov' 'W/Off 09')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO10    R               COLHDG('Spec Prov' 'W/Off 10')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO11    R               COLHDG('Spec Prov' 'W/Off 11')
M026 A*SS01                                 REFFLD(SSAMT4)
M026 A*SS01       SPWO12    R               COLHDG('Spec Prov' 'W/Off 12')
M026 A*SS01                                 REFFLD(SSAMT4)
M001 A*SS01       SPWUID    R               COLHDG('User ID')
M001 A*SS01                                 REFFLD(SSCODA)
M001 A*SS01       SPWWID    R               COLHDG('Workstation ID')
M001 A*SS01                                 REFFLD(SSCODA)
M001 A*SS01       SPWDT6    R               COLHDG('Last Maint' 'Date')
M001 A*SS01                                 REFFLD(SSDAT8)
M001 A*SS01       SPWDT7    R               COLHDG('Last Maint' 'Date')
M001 A*SS01                                 REFFLD(SSDAT7)
M001 A*SS01       SPWTIM    R               COLHDG('Last Maint' 'Time')
M001 A*SS01                                 REFFLD(SSTIM6)
M001 A*SS01       SPBCID    R               COLHDG('Created' 'User')
M001 A*SS01                                 REFFLD(SSCODA)
M001 A*SS01       SPBCD6    R               COLHDG('Created' 'Date')
M001 A*SS01                                 REFFLD(SSDAT8)
M001 A*SS01       SPBCD7    R               COLHDG('Created' 'Date')
M001 A*SS01                                 REFFLD(SSDAT7)
M001 A*SS01       SPBCTM    R               COLHDG('Created' 'Time')
M001 A*SS01                                 REFFLD(SSTIM6)
     ** Field removed from LNPROV
     A*M026       SPYMTH    R               COLHDG('Year/Month')
     A*M026                                 REFFLD(SSDAT8)
     A*A044       SPPROV    R               COLHDG('Specific' 'Provision')
A044 A*M026       SPPROV    R               COLHDG('Total Spec.' 'Prov.')
     A*M026                                 REFFLD(SSAMT4)
     A*A044       SPPWOF    R               COLHDG('W/Off' 'Provision')
A044 A*M026       SPPWOF    R               COLHDG('Spec. Prov. - mth')
     A*M026                                 REFFLD(SSAMT4)
     A*A044       SPPWBK    R               COLHDG('W/Back' 'Provision')
A044 A*M026       SPPWBK    R               COLHDG('Spec. Prov.' 'W/Back')
     A*M026                                 REFFLD(SSAMT4)
     A*A044       SPWOFF    R               COLHDG('W/Off' 'Amount')
A044 A*M026       SPWOFF    R               COLHDG('Spec. Prov.' 'W/Off')
     A*M026                                 REFFLD(SSAMT4)
     A*M026       SPWOD6    R               COLHDG('Date' 'Written Off')
     A*M026                                 REFFLD(SSDAT8)
     A*M026       SPWOD7    R               COLHDG('Date' 'Written Off')
     A*M026                                 REFFLD(SSDAT7)
     A*M026       SPWOBY    R               COLHDG('W/O Approved by')
     A*M026                                 REFFLD(SSOFFC)
     A*M026       SPWOA6    R               COLHDG('W/O Approved date')
     A*M026                                 REFFLD(SSDAT8)
     A*M026       SPWOA7    R               COLHDG('W/O Approved date')
     A*M026                                 REFFLD(SSDAT7)
     A*M026       SPWBCK    R               COLHDG('W/Back' 'Amount')
     A*M026                                 REFFLD(SSAMT4)
     A*M026       SPWBD6    R               COLHDG('Date' 'Write Back')
     A*M026                                 REFFLD(SSDAT8)
     A*M026       SPWBD7    R               COLHDG('Date' 'Write Back')
     A*M026                                 REFFLD(SSDAT7)
     A*M026       SPWBBY    R               COLHDG('W/B Approved by')
     A*M026                                 REFFLD(SSOFFC)
     A*M026       SPWBA6    R               COLHDG('W/B Approved date')
     A*M026                                 REFFLD(SSDAT8)
     A*M026       SPWBA7    R               COLHDG('W/B Approved date')
     A*M026                                 REFFLD(SSDAT7)
A046 A*M026       SPPRCT    R               COLHDG('Last Mth SP %')
A046 A*M026                                 REFFLD(SSPERD)
A046 A*M026       SPLMCV    R               COLHDG('Last Mth Col Value')
A046 A*M026                                 REFFLD(SSAMT4)
     A*************************************************************************
     A** INT. IN SUSP WRITE OFF AND WRITE BACK FILE - LNIWOB
     A*************************************************************************
M001 A*SS01       LWARID    R               COLHDG('Record Identifier')
M001 A*SS01                                 REFFLD(SSCOD1)
     A*SS01       LWACNO    R               COLHDG('Account No.')
     A*SS01                                 REFFLD(SSACCN)
     A*SS01       LWACTP    R               COLHDG('Account' 'Type')
     A*SS01                                 REFFLD(SSACCT)
     A*SS01       LWYEAR    R               COLHDG('Year')
     A*SS01                                 REFFLD(SSDAT4)
M026 A*SS01       LWOIIS    R               COLHDG('Opening Int-In-Susp')
M026 A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP01    R               COLHDG('Int-In-Susp 01')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP02    R               COLHDG('Int-In-Susp 02')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP03    R               COLHDG('Int-In-Susp 03')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP04    R               COLHDG('Int-In-Susp 04')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP05    R               COLHDG('Int-In-Susp 05')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP06    R               COLHDG('Int-In-Susp 06')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP07    R               COLHDG('Int-In-Susp 07')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP08    R               COLHDG('Int-In-Susp 08')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP09    R               COLHDG('Int-In-Susp 09')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP10    R               COLHDG('Int-In-Susp 10')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP11    R               COLHDG('Int-In-Susp 11')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LNSP12    R               COLHDG('Int-In-Susp 12')
     A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL01    R               COLHDG('IIS Claw back 01')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL02    R               COLHDG('IIS Claw back 02')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL03    R               COLHDG('IIS Claw back 03')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL04    R               COLHDG('IIS Claw back 04')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL05    R               COLHDG('IIS Claw back 05')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL06    R               COLHDG('IIS Claw back 06')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL07    R               COLHDG('IIS Claw back 07')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL08    R               COLHDG('IIS Claw back 08')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL09    R               COLHDG('IIS Claw back 09')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL10    R               COLHDG('IIS Claw back 10')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL11    R               COLHDG('IIS Claw back 11')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNCL12    R               COLHDG('IIS Claw back 12')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT01    R               COLHDG('IIS Transfer 01')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT02    R               COLHDG('IIS Transfer 02')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT03    R               COLHDG('IIS Transfer 03')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT04    R               COLHDG('IIS Transfer 04')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT05    R               COLHDG('IIS Transfer 05')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT06    R               COLHDG('IIS Transfer 06')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT07    R               COLHDG('IIS Transfer 07')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT08    R               COLHDG('IIS Transfer 08')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT09    R               COLHDG('IIS Transfer 09')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT10    R               COLHDG('IIS Transfer 10')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT11    R               COLHDG('IIS Transfer 11')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LNIT12    R               COLHDG('IIS Transfer 12')
M020 A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB01    R               COLHDG('Write' 'Back 01')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB02    R               COLHDG('Write' 'Back 02')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB03    R               COLHDG('Write' 'Back 03')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB04    R               COLHDG('Write' 'Back 04')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB05    R               COLHDG('Write' 'Back 05')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB06    R               COLHDG('Write' 'Back 06')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB07    R               COLHDG('Write' 'Back 07')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB08    R               COLHDG('Write' 'Back 08')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB09    R               COLHDG('Write' 'Back 09')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB10    R               COLHDG('Write' 'Back 10')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB11    R               COLHDG('Write' 'Back 11')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWB12    R               COLHDG('Write' 'Back 12')
     A*SS01                                 REFFLD(SSAMT4)
HLB  A* NPL ENHANCEMENT.
H001 A*SS01       LWAJ01    R               COLHDG('Write' 'Back Adj 01')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ02    R               COLHDG('Write' 'Back Adj 02')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ03    R               COLHDG('Write' 'Back Adj 03')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ04    R               COLHDG('Write' 'Back Adj 04')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ05    R               COLHDG('Write' 'Back Adj 05')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ06    R               COLHDG('Write' 'Back Adj 06')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ07    R               COLHDG('Write' 'Back Adj 07')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ08    R               COLHDG('Write' 'Back Adj 08')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ09    R               COLHDG('Write' 'Back Adj 09')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ10    R               COLHDG('Write' 'Back Adj 10')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ11    R               COLHDG('Write' 'Back Adj 11')
H001 A*SS01                                 REFFLD(SSAMT4)
H001 A*SS01       LWAJ12    R               COLHDG('Write' 'Back Adj 12')
H001 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR01    R               COLHDG('Write' 'Back Transfer 01')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR02    R               COLHDG('Write' 'Back Transfer 02')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR03    R               COLHDG('Write' 'Back Transfer 03')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR04    R               COLHDG('Write' 'Back Transfer 04')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR05    R               COLHDG('Write' 'Back Transfer 05')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR06    R               COLHDG('Write' 'Back Transfer 06')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR07    R               COLHDG('Write' 'Back Transfer 07')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR08    R               COLHDG('Write' 'Back Transfer 08')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR09    R               COLHDG('Write' 'Back Transfer 09')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR10    R               COLHDG('Write' 'Back Transfer 10')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR11    R               COLHDG('Write' 'Back Transfer 11')
M020 A*SS01                                 REFFLD(SSAMT4)
M020 A*SS01       LWTR12    R               COLHDG('Write' 'Back Transfer 12')
M020 A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO01    R               COLHDG('Write' 'Off 01')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO02    R               COLHDG('Write' 'Off 02')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO03    R               COLHDG('Write' 'Off 03')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO04    R               COLHDG('Write' 'Off 04')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO05    R               COLHDG('Write' 'Off 05')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO06    R               COLHDG('Write' 'Off 06')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO07    R               COLHDG('Write' 'Off 07')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO08    R               COLHDG('Write' 'Off 08')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO09    R               COLHDG('Write' 'Off 09')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO10    R               COLHDG('Write' 'Off 10')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO11    R               COLHDG('Write' 'Off 11')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LWWO12    R               COLHDG('Write' 'Off 12')
     A*SS01                                 REFFLD(SSAMT4)
M001 A*SS01       LWWUID    R               COLHDG('User ID')
M001 A*SS01                                 REFFLD(SSCODA)
M001 A*SS01       LWWWID    R               COLHDG('Workstation ID')
M001 A*SS01                                 REFFLD(SSCODA)
M001 A*SS01       LWWDT6    R               COLHDG('Last Maint' 'Date')
M001 A*SS01                                 REFFLD(SSDAT8)
M001 A*SS01       LWWDT7    R               COLHDG('Last Maint' 'Date')
M001 A*SS01                                 REFFLD(SSDAT7)
M001 A*SS01       LWWTIM    R               COLHDG('Last Maint' 'Time')
M001 A*SS01                                 REFFLD(SSTIM6)
M001 A*SS01       LNWCID    R               COLHDG('Created' 'User')
M001 A*SS01                                 REFFLD(SSCODA)
M001 A*SS01       LNWCD6    R               COLHDG('Created' 'Date')
M001 A*SS01                                 REFFLD(SSDAT8)
M001 A*SS01       LNWCD7    R               COLHDG('Created' 'Date')
M001 A*SS01                                 REFFLD(SSDAT7)
M001 A*SS01       LNWCTM    R               COLHDG('Created' 'Time')
M001 A*SS01                                 REFFLD(SSTIM6)
     A*************************************************************************
     A* Account Fees Information - LNDFEE
UOBS A* LOAN FEE DEBITING FILE - LNDFEE (H001)
     A*************************************************************************
M001 A            LFERID    R               COLHDG('Record Identifier')
M001 A                                      REFFLD(SSCOD1)
H001 A            LFEACC    R               COLHDG('Account number')
H001 A                                      REFFLD(SSACCN)
     A            LFEACT    R               COLHDG('Account Type')
H001 A                                      REFFLD(SSACCT)
A031 A            LFESEQ    R               COLHDG('Sequence' 'Number')
A031 A                                      REFFLD(SSCOU9)
M004 A            LFECDE    R               COLHDG('Fee code')
M004 A                                      REFFLD(SSCOD2)
     A            LFEAMT    R               COLHDG('Fee Amt' 'To Charge')
H001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LFEDU8    R               COLHDG('Due Date')
H001 A                                      REFFLD(SSDAT8)
M005 A            LFLDU8    R               COLHDG('Last Effective Date')
M005 A                                      REFFLD(SSDAT8)
M025 A            LFLST8    R               COLHDG('Last Start Date')
M025 A                                      REFFLD(SSDAT8)
     A            LFEDAY    R               COLHDG('Due Day')
H001 A                                      REFFLD(SSCOU2)
     A            LFEFRQ    R               COLHDG('Frequency')
H001 A                                      REFFLD(SSCOU3)
     A            LFEFCD    R               COLHDG('Freq' 'Code')
H001 A                                      REFFLD(SSCOD1)
     A            LFECTP    R               COLHDG('Fee' 'Charge Type')
H001 A                                      REFFLD(SSCOD2)
     A            LFECCD    R               COLHDG('Charge To' 'Misc/Othchg')
H001 A                                      REFFLD(SSCOD1)
     A            LFEXP8    R               COLHDG('Expiry' 'Date')
H001 A                                      REFFLD(SSDAT8)
M001 A            LFSTR8    R               COLHDG('Start' 'Date')
M001 A                                      REFFLD(SSDAT8)
     A            LFEMD8    R               COLHDG('Maintenance' 'Date')
H001 A                                      REFFLD(SSDAT8)
M001 A            LFEPCT    R               COLHDG('Fee Percentage')
M001 A                                      REFFLD(SSPERD)
M001 A            LFEPAM    R               COLHDG('% on Fixed Amount')
M001 A                                      REFFLD(SSAMT4)
M001 A            LFEIND    R               COLHDG('Amount Indicator')
M001 A                                      REFFLD(SSCOD1)
M038 A            LFEEAF    R               COLHDG('Earn Additional' 'Day Fee')
M038 A                                      REFFLD(SSCOD1)
AM01 A*AM09       LFEMEM    R               COLHDG('Memo posting of fee')
AM01 A*AM09                                 REFFLD(SSCOD1)
M001 A            LFEYBS    R               COLHDG('Year' 'Base')
M001 A                                      REFFLD(SSCOU1)
AM03 A            LFEMIN    R               COLHDG('Minimum charge')
AM03 A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
AM03 A            LFEMAX    R               COLHDG('Maximum charge')
AM03 A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
OS02 A            LFEETR    R               COLHDG('Excess Tier Fee %')
OS02 A                                      REFFLD(SSPERD)
OS02 A            LFETMN    R               COLHDG('Tiered' 'Minimum charge')
OS02 A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
OS02 A            LFETMX    R               COLHDG('Tiered' 'Maximum charge')
OS02 A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
R1040A            LFEVEN    R               COLHDG('Event Code')
R1040A                                      REFFLD(SSCOD2)
K0003A            LFESMC    R               COLHDG('SCHEME CODE')
K0003A                                      REFFLD(SSCODA)
     A*************************************************************************
     A* MONTHLY DEFAULT POSITION FILE - LNDFLT
     A*************************************************************************
M001 A*SS01       LFACCN    R               COLHDG('Account' 'Number')
M001 A*SS01                                 REFFLD(SSACCN)
V001 A*SS01       LFATYP    R               COLHDG('Account' 'Type')
V001 A*SS01                                 REFFLD(SSACCT)
V001 A*SS01       LFCIFN    R               COLHDG('CIF' 'Number')
V001 A*SS01                                 REFFLD(SSCIFN)
V001 A*SS01       LFBRN     R               COLHDG('Branch' 'Number')
V001 A*SS01                                 REFFLD(SSBRAN)
V001 A*SS01       LFTYPE    R               COLHDG('Loan' 'Type')
V001 A*SS01                                 REFFLD(SSPROD)
     A*SS01       LFDLNO    R               COLHDG('Dealer' 'Number')
H001 A***                                   REFFLD(SSCOU7)
H001 A*SS01                                 REFFLD(SSCOUB)
     A*SS01       LFSNME    R               COLHDG('Short' 'Name')
     A*SS01                                 REFFLD(SSDESS)
     A*SS01       LFFSNE    R               REFFLD(SSNAMS)
     A*SS01                                 COLHDG('Formatted' 'short name')
OS05 A* INSTALMENT - AMOUNT DUE
     A*SS01       LFDFA1    R               COLHDG('Amount' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFDFA2    R               COLHDG('Amount' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFDFA3    R               COLHDG('Amount' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFDFA4    R               COLHDG('Amount' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFDFA5    R               COLHDG('Amount' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFDFA6    R               COLHDG('Amount' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
OS05 A* INSTALMENT - NO OF PAYMENT DUE
     A*SS01       LFDFN1    R               COLHDG('No of Instl'  'In Default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFN2    R               COLHDG('No of Instl'  'In Default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFN3    R               COLHDG('No of Instl'  'In Default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFN4    R               COLHDG('No of Instl'  'In Default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFN5    R               COLHDG('No of Instl'  'In Default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFN6    R               COLHDG('No of Instl'  'In Default')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* INSTALMENT - NO OF MONTHS (AGING)
     A*SS01       LFDFM1    R               COLHDG('N Mths in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFM2    R               COLHDG('N Mths in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFM3    R               COLHDG('N Mths in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFM4    R               COLHDG('N Mths in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFM5    R               COLHDG('N Mths in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFDFM6    R               COLHDG('N Mths in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* INSTALMENT - NO OF DAYS (AGING)
     A*SS01       LFDFD1    R               COLHDG('N Days in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFDFD2    R               COLHDG('N Days in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFDFD3    R               COLHDG('N Days in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFDFD4    R               COLHDG('N Days in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFDFD5    R               COLHDG('N Days in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFDFD6    R               COLHDG('N Days in Dft' 'Instalment')
     A*SS01                                 REFFLD(SSCOU5)
OS05 A* INTEREST - AMOUNT DUE
     A*SS01       LFINA1    R               COLHDG('Interest' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFINA2    R               COLHDG('Interest' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFINA3    R               COLHDG('Interest' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFINA4    R               COLHDG('Interest' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFINA5    R               COLHDG('Interest' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFINA6    R               COLHDG('Interest' 'In Default')
     A*SS01                                 REFFLD(SSAMT4)
OS05 A* INTEREST - NO OF PAYMENT DUE
     A*SS01       LFINN1    R               COLHDG('No of Int.'  'In default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINN2    R               COLHDG('No of Int.'  'In default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINN3    R               COLHDG('No of Int.'  'In default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINN4    R               COLHDG('No of Int.'  'In default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINN5    R               COLHDG('No of Int.'  'In default')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINN6    R               COLHDG('No of Int.'  'In default')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* INTEREST - NO OF MONTHS DUE (AGINGS)
     A*SS01       LFINM1    R               COLHDG('N Mths in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINM2    R               COLHDG('N Mths in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINM3    R               COLHDG('N Mths in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINM4    R               COLHDG('N Mths in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINM5    R               COLHDG('N Mths in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFINM6    R               COLHDG('N Mths in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* INTEREST - NO OF DAYS DUE (AGINGS)
     A*SS01       LFIND1    R               COLHDG('N Days in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIND2    R               COLHDG('N Days in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIND3    R               COLHDG('N Days in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIND4    R               COLHDG('N Days in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIND5    R               COLHDG('N Days in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIND6    R               COLHDG('N Days in Dft' 'Interest')
     A*SS01                                 REFFLD(SSCOU5)
OS05 A* LATE CHG - AMOUNT DUE
M035 A*SS01       LFLCA1    R               COLHDG('LC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFLCA2    R               COLHDG('LC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFLCA3    R               COLHDG('LC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFLCA4    R               COLHDG('LC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFLCA5    R               COLHDG('LC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFLCA6    R               COLHDG('LC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
OS05 A* LATE CHG - NO OF PAYMENT DUE
M035 A*SS01       LFLCN1    R               COLHDG('No. of' 'LC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFLCN2    R               COLHDG('No. of' 'LC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFLCN3    R               COLHDG('No. of' 'LC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFLCN4    R               COLHDG('No. of' 'LC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFLCN5    R               COLHDG('No. of' 'LC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFLCN6    R               COLHDG('No. of' 'LC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
OS05 A* LATE CHG - NO OF MONTHS DUE (AGINGS)
     A*SS01       LFLCM1    R               COLHDG('N Mths in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFLCM2    R               COLHDG('N Mths in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFLCM3    R               COLHDG('N Mths in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFLCM4    R               COLHDG('N Mths in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFLCM5    R               COLHDG('N Mths in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFLCM6    R               COLHDG('N Mths in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* LATE CHG - NO OF DAYS DUE (AGINGS)
     A*SS01       LFLCD1    R               COLHDG('N Days in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFLCD2    R               COLHDG('N Days in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFLCD3    R               COLHDG('N Days in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFLCD4    R               COLHDG('N Days in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFLCD5    R               COLHDG('N Days in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFLCD6    R               COLHDG('N Days in Dft' 'Late Chg')
     A*SS01                                 REFFLD(SSCOU5)
OS05 A* COMM FEE - AMOUNT DUE
M035 A*SS01       LFCFA1    R               COLHDG('CF' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFCFA2    R               COLHDG('CF' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFCFA3    R               COLHDG('CF' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFCFA4    R               COLHDG('CF' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFCFA5    R               COLHDG('CF' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFCFA6    R               COLHDG('CF' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
OS05 A* COMM FEE - NO OF PAYMENT DUE
M035 A*SS01       LFCFN1    R               COLHDG('No. of' 'CF in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFCFN2    R               COLHDG('No. of' 'CF in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFCFN3    R               COLHDG('No. of' 'CF in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFCFN4    R               COLHDG('No. of' 'CF in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFCFN5    R               COLHDG('No. of' 'CF in dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFCFN6    R               COLHDG('No. of' 'CF in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
OS05 A* COMM FEE - NO OF MONTHS DUE (AGINGS)
     A*SS01       LFCFM1    R               COLHDG('N Mths in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFCFM2    R               COLHDG('N Mths in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFCFM3    R               COLHDG('N Mths in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFCFM4    R               COLHDG('N Mths in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFCFM5    R               COLHDG('N Mths in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFCFM6    R               COLHDG('N Mths in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* COMM FEE - NO OF DAYS DUE (AGINGS)
     A*SS01       LFCFD1    R               COLHDG('N Days in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFCFD2    R               COLHDG('N Days in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFCFD3    R               COLHDG('N Days in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFCFD4    R               COLHDG('N Days in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFCFD5    R               COLHDG('N Days in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFCFD6    R               COLHDG('N Days in Dft' 'Comm Fee')
     A*SS01                                 REFFLD(SSCOU5)
OS05 A* OTHER CHG - AMOUNT DUE
M035 A*SS01       LFOCA1    R               COLHDG('OC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFOCA2    R               COLHDG('OC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFOCA3    R               COLHDG('OC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFOCA4    R               COLHDG('OC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFOCA5    R               COLHDG('OC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFOCA6    R               COLHDG('OC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
OS05 A* OTHER CHG - NO OF PAYMENT DUE
M035 A*SS01       LFOCN1    R               COLHDG('No. of' 'OC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFOCN2    R               COLHDG('No. of' 'OC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFOCN3    R               COLHDG('No. of' 'OC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFOCN4    R               COLHDG('No. of' 'OC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFOCN5    R               COLHDG('No. of' 'OC in dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFOCN6    R               COLHDG('No. of' 'OC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
OS05 A* OTHER CHG - NO OF MONTHS DUE (AGINGS)
     A*SS01       LFOCM1    R               COLHDG('N Mths in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFOCM2    R               COLHDG('N Mths in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFOCM3    R               COLHDG('N Mths in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFOCM4    R               COLHDG('N Mths in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFOCM5    R               COLHDG('N Mths in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFOCM6    R               COLHDG('N Mths in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* OTHER CHG - NO OF DAYS DUE (AGINGS)
     A*SS01       LFOCD1    R               COLHDG('N Days in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFOCD2    R               COLHDG('N Days in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFOCD3    R               COLHDG('N Days in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFOCD4    R               COLHDG('N Days in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFOCD5    R               COLHDG('N Days in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFOCD6    R               COLHDG('N Days in Dft' 'Oth Chg')
     A*SS01                                 REFFLD(SSCOU5)
OS05 A* MISC COST - AMOUNT DUE
M035 A*SS01       LFMCA1    R               COLHDG('MC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFMCA2    R               COLHDG('MC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFMCA3    R               COLHDG('MC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFMCA4    R               COLHDG('MC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFMCA5    R               COLHDG('MC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
M035 A*SS01       LFMCA6    R               COLHDG('MC' 'In Default')
M035 A*SS01                                 REFFLD(SSAMT4)
OS05 A* MISC COST - NO OF PAYMENT DUE
M035 A*SS01       LFMCN1    R               COLHDG('No. of' 'MC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFMCN2    R               COLHDG('No. of' 'MC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFMCN3    R               COLHDG('No. of' 'MC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFMCN4    R               COLHDG('No. of' 'MC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFMCN5    R               COLHDG('No. of' 'MC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
M035 A*SS01       LFMCN6    R               COLHDG('No. of' 'MC in Dft')
M035 A*SS01                                 REFFLD(SSCOU3)
OS05 A* MISC COST - NO OF MONTHS DUE (AGINGS)
     A*SS01       LFMCM1    R               COLHDG('N Mths in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFMCM2    R               COLHDG('N Mths in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFMCM3    R               COLHDG('N Mths in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFMCM4    R               COLHDG('N Mths in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFMCM5    R               COLHDG('N Mths in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFMCM6    R               COLHDG('N Mths in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* MISC COST - NO OF DAYS DUE (AGINGS)
     A*SS01       LFMCD1    R               COLHDG('N Days in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFMCD2    R               COLHDG('N Days in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFMCD3    R               COLHDG('N Days in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFMCD4    R               COLHDG('N Days in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFMCD5    R               COLHDG('N Days in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFMCD6    R               COLHDG('N Days in Dft' 'Misc Cost')
     A*SS01                                 REFFLD(SSCOU5)
OS05 A* INT/PRIN  - NO OF PAYMENT DUE
     A*SS01       LFIPN1    R               COLHDG('N Int/Prin' 'In dft')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPN2    R               COLHDG('N Int/Prin' 'In dft')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPN3    R               COLHDG('N Int/Prin' 'In dft')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPN4    R               COLHDG('N Int/Prin' 'In dft')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPN5    R               COLHDG('N Int/Prin' 'In dft')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPN6    R               COLHDG('N Int/Prin' 'In dft')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* INT/PRIN  - NO OF MTHS DUE (AGINGS)
     A*SS01       LFIPM1    R               COLHDG('N Mths in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPM2    R               COLHDG('N Mths in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPM3    R               COLHDG('N Mths in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPM4    R               COLHDG('N Mths in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPM5    R               COLHDG('N Mths in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU3)
     A*SS01       LFIPM6    R               COLHDG('N Mths in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU3)
OS05 A* INT/PRIN  - NO OF DAYS DUE (AGINGS)
     A*SS01       LFIPD1    R               COLHDG('N Days in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIPD2    R               COLHDG('N Days in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIPD3    R               COLHDG('N Days in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIPD4    R               COLHDG('N Days in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIPD5    R               COLHDG('N Days in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFIPD6    R               COLHDG('N Days in Dft' 'Int/Instl')
     A*SS01                                 REFFLD(SSCOU5)
     A*SS01       LFOS0     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS1     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS2     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS3     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS4     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS5     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS6     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS7     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS8     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS9     R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS10    R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS11    R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFOS12    R               COLHDG('Outstanding' 'Balance')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL0     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL1     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL2     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL3     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL4     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL5     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL6     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL7     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL8     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL9     R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL10    R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL11    R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*SS01       LFRL12    R               COLHDG('Release'  'Amount')
     A*SS01                                 REFFLD(SSAMT4)
     A*OS05       LFSTS1    R               COLHDG('status R/L')
     A*OS05                                 REFFLD(SSCOD1)
     A*OS05       LFSTS2    R               COLHDG('status R/L')
     A*OS05                                 REFFLD(SSCOD1)
     A*OS05       LFSTS3    R               COLHDG('status R/L')
     A*OS05                                 REFFLD(SSCOD1)
     A*OS05       LFSTS4    R               COLHDG('status R/L')
     A*OS05                                 REFFLD(SSCOD1)
     A*OS05       LFSTS5    R               COLHDG('status R/L')
     A*OS05                                 REFFLD(SSCOD1)
     A*OS05       LFSTS6    R               COLHDG('status R/L')
     A*OS05                                 REFFLD(SSCOD1)
     A*************************************************************************
     A* CREDIT LINE SUMMARY INFORMATION - LNLSUM
     A*************************************************************************
     A            LLSNME    R               COLHDG('Short' 'Name')
     A                                      REFFLD(SSDESS)
     A            LLREFD    R               COLHDG('Refund' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LLOSBL    R               COLHDG('Outstanding' 'Bal')
     A                                      REFFLD(SSAMT4)
     A            LLRLTD    R               COLHDG('Release LTD')
     A                                      REFFLD(SSAMT4)
     A            LLRYTD    R               COLHDG('Release YTD')
     A                                      REFFLD(SSAMT4)
     A            LLRHTD    R               COLHDG('Release HTD')
     A                                      REFFLD(SSAMT4)
     A            LLRMTD    R               COLHDG('Release MTD')
     A                                      REFFLD(SSAMT4)
     A            LLCD10    R               COLHDG('Current PD 10-29')
     A                                      REFFLD(SSCOU3)
     A            LLCD30    R               COLHDG('Current PD 30-59')
     A                                      REFFLD(SSCOU3)
     A            LLCD60    R               COLHDG('Current PD 60-89')
     A                                      REFFLD(SSCOU3)
     A            LLCD90    R               COLHDG('Current PD > 90')
     A                                      REFFLD(SSCOU3)
     A            LLPD10    R               COLHDG('Last Yr 10-29')
     A                                      REFFLD(SSCOU3)
     A            LLPD30    R               COLHDG('Last Yr 30-59')
     A                                      REFFLD(SSCOU3)
     A            LLPD60    R               COLHDG('Last Yr PD 60-89')
     A                                      REFFLD(SSCOU3)
     A            LLPD90    R               COLHDG('Last Yr PD > 90')
     A                                      REFFLD(SSCOU3)
     A            LLLD10    R               COLHDG('LTD PD 10-29')
     A                                      REFFLD(SSCOU3)
     A            LLLD30    R               COLHDG('LTD PD 30-59')
     A                                      REFFLD(SSCOU3)
     A            LLLD60    R               COLHDG('LTD PD 60-89')
     A                                      REFFLD(SSCOU3)
     A            LLLD90    R               COLHDG('LTD PD > 90')
     A                                      REFFLD(SSCOU3)
     A*************************************************************************
A032 A* NOTICE/REMINDER MAILING FILE(LNREMD)
     A*************************************************************************
A032 A            LRMACT    R               COLHDG('Account' 'Number')
A032 A                                      REFFLD(SSACCN)
A032 A            LRMATY    R               COLHDG('Account' 'Type')
A032 A                                      REFFLD(SSACCT)
A032 A            LRMCDE    R               COLHDG('Notice' 'Code')
A032 A                                      REFFLD(SSCOD2)
A032 A            LRMPTY    R               COLHDG('Product' 'Type')
A032 A                                      REFFLD(SSPROD)
A032 A            LRMCUR    R               COLHDG('Currency')
A032 A                                      REFFLD(SSCURC)
A032 A            LRMSEQ    R               COLHDG('Seq')
A032 A                                      REFFLD(SSCOU3)
A032 A            LRMDSC    R               COLHDG('Description')
A032 A                                      REFFLD(SSDESM)
A032 A            LRMCHG    R               COLHDG('Charges')
A032 A                                      REFFLD(SSAMT4)
A032 A            LRMCTY    R               COLHDG('Charge' 'Type')
A032 A                                      REFFLD(SSCOD2)
A032 A            LRMCOC    R               COLHDG('Charge to MC or OC')
A032 A                                      REFFLD(SSCOD1)
A032 A            LRMGFG    R               COLHDG('Charge to' 'guarantor flag')
A032 A                                      REFFLD(SSCOD1)
A032 A            LRMPHM    R               COLHDG('Hold Mail(Y/N)')
A032 A                                      REFFLD(SSCOD1)
A032 A            LRMGHM    R               COLHDG('Hold Guarantor'  +
A032 A                                      'Mail(Y/N)')
A032 A                                      REFFLD(SSCOD1)
A032 A            LRMHMC    R               COLHDG('Hold Mail' 'Srv.Charge')
A032 A                                      REFFLD(SSAMT4)
A032 A            LRMHMT    R               COLHDG('Hold Mail' 'Charge Type')
A032 A                                      REFFLD(SSCOD2)
A032 A            LRMMOC    R               COLHDG('Hold Mail' +
A032 A                                              'Charges to MC or OC')
A032 A                                      REFFLD(SSCOD1)
A032 A            LRMPNC    R               COLHDG('Generate Notice Y/N')
A032 A                                      REFFLD(SSCOD1)
A032 A            LRMGNC    R               COLHDG('Generate Guarantor'  +
A032 a                                      'Notice Y/N')
A032 A                                      REFFLD(SSCOD1)
     A*************************************************************************
     A* LNFLOT - FLOAT
     A*************************************************************************
     A            FOSTAT    R               COLHDG('Float record status')
     A                                      REFFLD(SSCOD1)
     A            FOTYPE    R               COLHDG('Float record type')
     A                                      REFFLD(SSCOD1)
     A            FOCIFN    R               COLHDG('CIF number')
     A                                      REFFLD(SSCIFN)
     A            BRANCH    R               COLHDG('Branch number')
     A                                      REFFLD(SSBRAN)
     A            FODDA8    R               COLHDG('Float deposit date')
     A                                      REFFLD(SSDAT8)
     A            FODBAT    R               COLHDG('Float deposit batch')
     A                                      REFFLD(SSCOU3)
     A            FODSEQ    R               COLHDG('Float deposit seq')
     A                                      REFFLD(SSCOU9)
     A            FOEXP8    R               COLHDG('Float expiration' 'MMDDYY')
     A                                      REFFLD(SSDAT8)
     A            FOOTAC    R               COLHDG('Accrual' 'float')
     A                                      REFFLD(SSAMT4)
     A            FOOTAV    R               COLHDG('Check availability' 'float')
     A                                      REFFLD(SSAMT4)
     A            FOOTCA    R               COLHDG('Cash availability' 'float')
     A                                      REFFLD(SSAMT4)
     A            FODAMT    R               COLHDG('Float deposit amount')
     A                                      REFFLD(SSAMT4)
     A            FODTC     R               COLHDG('Float deposit T/C')
     A                                      REFFLD(SSCOU3)
     A            FODRT     R               COLHDG('Float deposit' 'R/T number')
     A                                      REFFLD(SSCOU9)
     A            FOSERI    R               COLHDG('Float deposit' 'serial -
     A                                      number')
     A                                      REFFLD(SSCOU7)
     A            EFTACC    R               COLHDG('EFT number')
     A                                      REFFLD(SSACCN)
     A            EFTACT    R               COLHDG('EFT type')
     A                                      REFFLD(SSCOD1)
     A            EFTTYP    R               COLHDG('EFT type code')
     A*M012                                 VALUES('ACH' 'AFT' 'ATM' 'ODP' -
     A*M012                                 '   ' 'SCG' 'NSF' 'FWH')
     A                                      REFFLD(SSCOD3)
     A* ACH=Automated clearing house
     A* AFT=Automated funds transfer
     A* ATM=Automatic teller machine
     A* ODP=Overdraft protection
     A* SCG=Service charge
     A* NSF=NSF reentry
     A* FWH=Federal withholding transfer
     A*************************************************************************
     A* LNCOMT - COMMITMENT FILE
     A*************************************************************************
M001 A            LCARID    R               COLHDG('Record' 'Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            LCACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LCATYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LCSEQ     R               COLHDG('Sequence number')
     A                                      REFFLD(SSCOU3)
H001 A            LCTSEQ    R               COLHDG('Tranche seq.')
H001 A                                      REFFLD(SSCOU3)
     A            LCRLAM    R               COLHDG('Release Amount')
     A                                      REFFLD(SSAMT4)
     A            LCDRLM    R               COLHDG('Drawing Limit')
     A                                      REFFLD(SSAMT4)
     A            LCUTAM    R               COLHDG('Utilized Amount')
     A                                      REFFLD(SSAMT4)
     A            LCIND     R               COLHDG('Indicator')
     A                                      REFFLD(SSCOD1)
H001 A            LCCOMR    R               COLHDG('Commitment' 'Rate')
H001 A                                      REFFLD(SSPERD)
     A            LCRLD8    R               COLHDG('Release date')
     A                                      REFFLD(SSDAT8)
     A            LCEXD8    R               COLHDG('Expiration date')
     A                                      REFFLD(SSDAT8)
R1029A            LCFCD8    R               COLHDG('Fee Charge Date')
R1029A                                      REFFLD(SSDAT8)
     A*************************************************************************
     A* WORK FILE (LNWORK)
     A*************************************************************************
     A            BRNAME    R               COLHDG('Branch' 'Name')
     A                                      REFFLD(SSDESS)
     A            CFNAME    R               COLHDG('Name')
     A                                      REFFLD(SSNAML)
     A            TYPDSC    R               COLHDG('Loan Type' 'Description')
     A                                      REFFLD(SSDESS)
     A            COLSTS    R               COLHDG('Collection Status' '-Repo')
     A                                      REFFLD(SSCOD1)
     A            OSBAL     R               COLHDG('Total' 'Outstanding')
     A                                      REFFLD(SSAMT4)
     A            REBATE    R               COLHDG('Unearn' 'Interest')
     A                                      REFFLD(SSAMT4)
     A            PRIN      R               COLHDG('Principal')
     A                                      REFFLD(SSAMT4)
     A            TOTINT    R               COLHDG('Total Int.' 'Receivable')
     A                                      REFFLD(SSAMT4)
     A            INTCUR    R               COLHDG('Int. Receivable' 'Curr. Yr')
     A                                      REFFLD(SSAMT4)
     A            INTPRV    R               COLHDG('Int. Receivable' 'Prior Yr')
     A                                      REFFLD(SSAMT4)
     A            ISPPRV    R               COLHDG('Int-In-Susp' 'Prev. Yr End')
     A                                      REFFLD(SSAMT4)
     A            ISPCUR    R               COLHDG('Int-In-Susp' 'Current Yr')
     A                                      REFFLD(SSAMT4)
     A            ISPWBK    R               COLHDG('Int-In-Susp' 'Write Back')
     A                                      REFFLD(SSAMT4)
     A            ISPWOF    R               COLHDG('Int-In-Susp' 'Write Off')
     A                                      REFFLD(SSAMT4)
     A            ISPCY     R               COLHDG('Int-In-Susp' 'Cur.Yr Portn')
     A                                      REFFLD(SSAMT4)
     A            ISPPY     R               COLHDG('Int-In-Susp' 'Pr. Yr Portn')
     A                                      REFFLD(SSAMT4)
     A            SPPRV     R               COLHDG('Spec. Prov.' 'Prev. Yr End')
     A                                      REFFLD(SSAMT4)
     A            SPCUR     R               COLHDG('Spec. Prov.' 'Current Year')
     A                                      REFFLD(SSAMT4)
     A            SPWBK     R               COLHDG('Write Back' 'Provision')
     A                                      REFFLD(SSAMT4)
     A            SPWOF     R               COLHDG('Write Off' 'Provision')
     A                                      REFFLD(SSAMT4)
     A            WOFF      R               COLHDG('Write Off' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            RCOV      R               COLHDG('Recovered' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            PRINN     R               COLHDG('No. mth in arr' 'Principal')
     A                                      REFFLD(SSCOU3)
     A            INTN      R               COLHDG('No. mth in arr' 'Interest')
     A                                      REFFLD(SSCOU3)
     A            CREF      R               COLHDG('Cross Reference')
     A                                      REFFLD(SSCOU5)
     A            RMK1      R               COLHDG('Remark 1')
     A                                      REFFLD(SSDESM)
     A            RMK2      R               COLHDG('Remark 2')
     A                                      REFFLD(SSDESM)
     A            RMK3      R               COLHDG('Remark 3')
     A                                      REFFLD(SSDESM)
     A            RMK4      R               COLHDG('Remark 4')
     A                                      REFFLD(SSDESM)
     A            RMK5      R               COLHDG('Remark 5')
     A                                      REFFLD(SSDESM)
     A            RMK6      R               COLHDG('Remark 6')
     A                                      REFFLD(SSDESM)
     A            RMK7      R               COLHDG('Remark 7')
     A                                      REFFLD(SSDESM)
     A            RMK8      R               COLHDG('Remark 8')
     A                                      REFFLD(SSDESM)
     A            RMK9      R               COLHDG('Remark 9')
     A                                      REFFLD(SSDESM)
     A            RMK10     R               COLHDG('Remark 10')
     A                                      REFFLD(SSDESM)
     A            CCDCID    R               COLHDG('Collateral' 'ID')
     A                                      REFFLD(SSDCID)
     A            CCDESC    R               COLHDG('Collateral' 'Description')
     A                                      REFFLD(SSDESC)
     A            LAND      R               COLHDG('Land Area')
     A                                      REFFLD(SSCODA)
     A            LOC1      R               COLHDG('Location 1')
     A                                      REFFLD(SSDESM)
     A            LOC2      R               COLHDG('Location 2')
     A                                      REFFLD(SSDESM)
     A            SHARE     R               COLHDG('Share' 'Counter')
     A                                      REFFLD(SSCODA)
     A            SHAREN    R               COLHDG('Number of' 'Shares')
     A                                      REFFLD(SSCOU9)
     A            MVALUE    R               COLHDG('Current Market' 'Value')
     A                                      REFFLD(SSAMT4)
     A            VDATE8    R               COLHDG('Valuation' 'Date')
     A                                      REFFLD(SSDAT8)
     A            VALUER    R               COLHDG('Valuer' 'Name')
     A                                      REFFLD(SSDESM)
     A            FORSAL    R               COLHDG('Forced Sale' 'Value')
     A                                      REFFLD(SSAMT4)
     A            PURCDE    R               COLHDG('Land Use' '(Purpose Code)')
     A                                      REFFLD(SSCOD2)
     A*************************************************************************
     A* ELECTRONIC DIARY FILE  (LNELEC)
     A*************************************************************************
M001 A            ELARID    R               COLHDG('Record Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            ELACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            ELTYPE    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            ELDAT8    R               COLHDG('Date' 'Logged')
     A                                      REFFLD(SSDAT8)
     A            ELCIFN    R               COLHDG('CIF' 'No')
     A                                      REFFLD(SSCIFN)
     A            ELSNME    R               COLHDG('Short' 'Name')
     A                                      REFFLD(SSDESS)
     A            ELFSNM    R               REFFLD(SSNAMS)
     A                                      COLHDG('Formatted' 'short name')
     A            ELSRCE    R               COLHDG('Source' 'Of Log')
     A                                      REFFLD(SSCOD2)
     A            ELUSER    R               COLHDG('User' 'ID')
     A                                      REFFLD(SSCODA)
     A            ELWSTN    R               COLHDG('W/S' 'ID')
     A                                      REFFLD(SSCODA)
     A            ELTIME    R               COLHDG('Time' 'Logged')
     A                                      REFFLD(SSTIM6)
     A            ELCAN8    R               COLHDG('Cancel' 'Date')
     A                                      REFFLD(SSDAT8)
     A            ELCUSR    R               COLHDG('Cancelling' 'User')
     A                                      REFFLD(SSCODA)
     A            ELGENT    R               COLHDG('Agent' 'ID')
     A                                      REFFLD(SSCOD8)
     A            ELNPD8    R               COLHDG('Next Paym' 'Due Date')
     A                                      REFFLD(SSDAT8)
     A            ELIPD8    R               COLHDG('Next Int Paym' 'Due Date')
     A                                      REFFLD(SSDAT8)
     A            E1EFF8    R               COLHDG('Effective' 'Date')
     A                                      REFFLD(SSDAT8)
AM12 A            E1EXP8    R               COLHDG('Expiry' 'Date')
AM12 A                                      REFFLD(SSDAT8)
     A            E1PERS    R               COLHDG('Person' 'Quoted')
     A                                      REFFLD(SSDESM)
     A            E1CTNO    R               COLHDG('Contact' 'Number')
     A                                      REFFLD(SSDESS)
     A            E1CBAL    R               COLHDG('Current' 'Balance')
     A                                      REFFLD(SSAMT4)
     A            E1ACCR    R               COLHDG('Accrued' 'Int')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1DISC    R               COLHDG('Bank' 'Disc')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1BREB    R               COLHDG('Bank' 'Disc Reb')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
H001 A            E1DIS2    R               COLHDG('Bank' 'Disc 2')
H001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
H001 A            E1BRE2    R               COLHDG('Bank' 'Disc Reb 2')
H001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1DLSC    R               COLHDG('Dealer' 'Disc')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1DREB    R               COLHDG('Dealer' 'Disc Reb')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1CPRM    R               COLHDG('MRTA' 'Ins Prem')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1CREB    R               COLHDG('MRTA' 'Ins Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1APRM    R               COLHDG('A & H' 'Ins Prem')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1AREB    R               COLHDG('A & H' 'Ins Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1MPRM    R               COLHDG('Misc' 'Ins Prem')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1MREB    R               COLHDG('Misc' 'Ins Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1LDUE    R               COLHDG('Late' 'Charge Due')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1OTHC    R               COLHDG('Other' 'Charges')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1EREB    R               COLHDG('Escrow' 'Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1ARMS    R               COLHDG('ARM' 'Ins-Susp')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1MISC    R               COLHDG('Misc' 'Cost')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1COMF    R               COLHDG('Commitmt' 'Fees')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1PENI    R               COLHDG('Penalty' 'Interest Acc')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M001 A            E1LIEU    R               COLHDG('Int In' 'Lieu of Notice')
M001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M001 A            E1CANL    R               COLHDG('Cancellation Fees')
M001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1PROV    R               COLHDG('Prov' 'Charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            E1IADJ    R               COLHDG('Interest' 'Adj')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1ESCR    R               COLHDG('Escrow' 'Balance')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
H001 A            E1PRED    R               COLHDG('Prepaid' 'Rental' 'Amt')
H001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
H001 A            E1SDEP    R               COLHDG('Security' 'Deposit')
H001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
H001 A            E1PENA    R               COLHDG('Early'' Settle' 'Penalty')
H001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            E1PAYA    R               COLHDG('Payoff' 'Amt')
     A                                      REFFLD(SSAMT4)
     A            E2ERVC    R               COLHDG('Ext,Res,Var' )
     A                                      REFFLD(SSCOD1)
     A            E2DESC    R               COLHDG('Message' 'Desc')
     A                                      REFFLD(SSDESS)
     A            E3TNOT    R               COLHDG('Type of' 'Notice')
     A                                      REFFLD(SSCOD2)
     A            E3AAMT    R               COLHDG('Amt in' 'Arrears')
     A                                      REFFLD(SSAMT4)
     A            E3TPAY    R               COLHDG('Total' 'Amt Pay')
     A                                      REFFLD(SSAMT4)
     A            E3AMTP    R               COLHDG('Amt' 'Paid')
     A                                      REFFLD(SSAMT4)
     A            E3OUTB    R               COLHDG('O/S' 'Balance')
     A                                      REFFLD(SSAMT4)
     A            E3AODE    R               COLHDG('O/D in' 'Arrears')
     A                                      REFFLD(SSAMT4)
     A            E3LCHG    R               COLHDG('Late' 'Charge')
     A                                      REFFLD(SSAMT4)
     A            E3MISC    R               COLHDG('Misc' 'Costs')
     A                                      REFFLD(SSAMT4)
     A            E3OTHE    R               COLHDG('Other' 'Charges')
     A                                      REFFLD(SSAMT4)
     A            E3AITM    R               COLHDG('Instal in' 'Arr')
     A                                      REFFLD(SSAMT4)
     A            E3CORE    R               COLHDG('Cost of' 'stor')
     A                                      REFFLD(SSAMT4)
     A            E3REPO    R               COLHDG('Cost of' 'Repo')
     A                                      REFFLD(SSAMT4)
     A            E3REDL    R               COLHDG('Cost of' 'Re-Del')
     A                                      REFFLD(SSAMT4)
     A            E3BLOS    R               COLHDG('Bal' 'O/S')
     A                                      REFFLD(SSAMT4)
     A            E3BLDE    R               COLHDG('Bal' 'Due')
     A                                      REFFLD(SSAMT4)
     A            E3SREB    R               COLHDG('Statu' 'Rebates')
     A                                      REFFLD(SSAMT4)
H001 A            E3SPMT    R               COLHDG('Short' 'Payment')
H001 A                                      REFFLD(SSAMT4)
A010 A            E35SRB    R               COLHDG('5th Schd Rebate')
A010 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A** PAYMENTS BILLED FILE - LNPMTB
     A*************************************************************************
M001 A            LBARID    R               COLHDG('Record Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            LBACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LBATYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
M003 A            LBAMNO    R               COLHDG('Main Account' 'Number')
  |  A*SS13                                 REFFLD(SSCOUB)
SS13 A                                      REFFLD(SSTMNO)
  |  A            LBALLL    R               COLHDG('Lender In' 'Syndication Ln')
SS23 A                                      REFFLD(SSTLLL)
  |  A            LBADDD    R               COLHDG('Drawdown' 'Sequence Number')
SS23 A                                      REFFLD(SSTDDD)
     A            LBDUD8    R               COLHDG('Due date')
     A                                      REFFLD(SSDAT8)
     A            LBTAMT    R               COLHDG('O/S Billed' 'Total amount')
     A                                      REFFLD(SSAMT4)
     A            LBPRN     R               COLHDG('O/S Billed' 'Prin Amt')
     A                                      REFFLD(SSAMT4)
     A            LBINT     R               COLHDG('O/S Billed' 'Int Amt')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBESC     R               COLHDG('O/S Billed' 'Escrow Amt')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBLC      R               COLHDG('O/S Billed' 'Late Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
WD005A            LBCF      R               COLHDG('O/S Billed' 'Com Fee')
WD005A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
CI41 A            LBDL      R               COLHDG('O/S Billed' 'Dealer')
CI41 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBOC      R               COLHDG('O/S Billed' 'Other Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBMC      R               COLHDG('O/S Billed' 'Misc Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBREF     R               COLHDG('O/S Billed' 'Refund')
     A                                      REFFLD(SSAMT4)
     A            LBPRF     R               COLHDG('O/S Billed' 'Profit')
     A                                      REFFLD(SSAMT4)
     A            LBCOM     R               COLHDG('O/S Billed' 'Comission')
     A                                      REFFLD(SSAMT4)
A006 A            LBRIN     R               COLHDG('O/S Billed' 'Restruc. Int.')
A006 A                                      REFFLD(SSAMT4)
SS26 A            LBMIN     R               COLHDG('O/S Billed' 'Moratorium' -
SS26 A                                      'Int.')
SS26 A                                      REFFLD(SSAMT4)
M018 A            LBRLC     R               COLHDG('O/S Billed' 'Restruc. LC.')
M018 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LBVAT     R               COLHDG('O/S Billed' 'VAT')
SS26 A                                      REFFLD(SSAMT4)
     A            LBTAMO    R               COLHDG('Org Billed' 'Total amount')
     A                                      REFFLD(SSAMT4)
     A            LBPRNO    R               COLHDG('Org Billed' 'Prin Amt')
     A                                      REFFLD(SSAMT4)
     A            LBINTO    R               COLHDG('Org Billed' 'Int Amt')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBESCO    R               COLHDG('Org Billed' 'Escrow Amt')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBLCO     R               COLHDG('Org Billed' 'Late Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
WD005A            LBCFO     R               COLHDG('Org Billed' 'Com Fee')
WD005A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
CI41 A            LBDLO     R               COLHDG('Org Billed' 'Dealer')
CI41 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBOCO     R               COLHDG('Org Billed' 'Other Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBMCO     R               COLHDG('Org Billed' 'Misc Chgs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LBREFO    R               COLHDG('Org Billed' 'Refund')
     A                                      REFFLD(SSAMT4)
     A            LBPRFO    R               COLHDG('Org Billed' 'Profit')
     A                                      REFFLD(SSAMT4)
     A            LBCOMO    R               COLHDG('Org Billed' 'Comission')
     A                                      REFFLD(SSAMT4)
A006 A            LBRINO    R               COLHDG('Org Billed' 'Restruc. Int.')
A006 A                                      REFFLD(SSAMT4)
SS26 A            LBMINO    R               COLHDG('Org Billed' 'Moratorium' -
SS26 A                                      'Int.')
SS26 A                                      REFFLD(SSAMT4)
M018 A            LBRLCO    R               COLHDG('Org Billed' 'Restruc. LC.')
M018 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LBVATO    R               COLHDG('Org Billed' 'VAT')
SS26 A                                      REFFLD(SSAMT4)
M023 A            LBTAMF    R               COLHDG('Fcast Billed' 'Total Amt')
M023 A                                      REFFLD(SSAMT4)
M023 A            LBPRNF    R               COLHDG('Fcast Billed' 'Prin Amt')
M023 A                                      REFFLD(SSAMT4)
M023 A            LBINTF    R               COLHDG('Fcast Billed' 'Int Amt')
M023 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M023 A            LBESCF    R               COLHDG('Fcast Billed' 'Escrow Amt')
M023 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M023 A            LBLCF     R               COLHDG('Fcast Billed' 'Late Chgs')
M023 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M023 A            LBCFF     R               COLHDG('Fcast Billed' 'Com Fee')
M023 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M023 A            LBDLF     R               COLHDG('Fcast Billed' 'Dealer')
M023 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M023 A            LBOCF     R               COLHDG('Fcast Billed' 'Other Chgs')
M023 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M023 A            LBMCF     R               COLHDG('Fcast Billed' 'Misc Chgs')
M023 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M023 A            LBREFF    R               COLHDG('Fcast Billed' 'Refund')
M023 A                                      REFFLD(SSAMT4)
M023 A            LBPRFF    R               COLHDG('Fcast Billed' 'Profit')
M023 A                                      REFFLD(SSAMT4)
M023 A            LBCOMF    R               COLHDG('Fcast Billed' 'Comission')
M023 A                                      REFFLD(SSAMT4)
M023 A            LBRINF    R               COLHDG('Fcast Billed' 'Restruc Int')
M023 A                                      REFFLD(SSAMT4)
SS26 A            LBMINF    R               COLHDG('Fcast Billed' 'Moratorium' -
SS26 A                                      'Int.')
SS26 A                                      REFFLD(SSAMT4)
M023 A            LBRLCF    R               COLHDG('Fcast Billed' 'Restruc LC')
M023 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
SS26 A            LBVATF    R               COLHDG('Fcast Billed' 'VAT')
SS26 A                                      REFFLD(SSAMT4)
M031 A            LBRMID    R               COLHDG('Restructure/Mora' 'Ind')
M031 A                                      REFFLD(SSCOD1)
M001 A            LBSPAM    R               COLHDG('Subsidized' 'Amount')
M001 A                                      REFFLD(SSAMT4)
M001 A            LBSEMP    R               COLHDG('Employer' 'Code')
M001 A                                      REFFLD(SSCOD4)
SS12 A            LBPMT8    R               COLHDG('Dealer Paym date')
SS12 A                                      REFFLD(SSDAT8)
M001 A            LBCRD8    R               COLHDG('Billing Creation' 'date')
M001 A                                      REFFLD(SSDAT8)
     *** Field removed from LNPMTB
CI31 A*M018       LBLCW     R               COLHDG('O/S Billed' 'L/C Waive')
CI31 A*M018                                 REFFLD(SSAMT3)
CI34 A*M018       LBLCWO    R               COLHDG('Org Billed' 'LC Waive')
CI34 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCAP    R               COLHDG('L/C per overdue Prin')
LC01 A*M018                                 REFFLD(SSAMTA)
LC01 A*M018       LBLCAI    R               COLHDG('L/C per overdue Int')
LC01 A*M018                                 REFFLD(SSAMTA)
LC01 A*M018       LBLCAL    R               COLHDG('L/C per overdue L/C')
LC01 A*M018                                 REFFLD(SSAMTA)
LC01 A*M018       LBLCAM    R               COLHDG('L/C per overdue Misc')
LC01 A*M018                                 REFFLD(SSAMTA)
CI34 A*M018       LBLCMP    R               COLHDG('L/C waivable' 'from Prin')
CI34 A*M018                                 REFFLD(SSAMTA)
CI34 A*M018       LBLCMI    R               COLHDG('L/C waivable' 'from Int')
CI34 A*M018                                 REFFLD(SSAMTA)
CI34 A*M018       LBLCML    R               COLHDG('L/C waivable' 'from L/C')
CI34 A*M018                                 REFFLD(SSAMTA)
CI34 A*M018       LBLCMM    R               COLHDG('L/C waivable' 'from Misc')
CI34 A*M018                                 REFFLD(SSAMTA)
LC01 A*M018       LBLCCP    R               COLHDG('L/C Assessed - Prin')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCCI    R               COLHDG('L/C Assessed - Int')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCCL    R               COLHDG('L/C Assessed - L/C')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCCM    R               COLHDG('L/C Assessed - Misc')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCPP    R               COLHDG('L/C Paid - Prin')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCPI    R               COLHDG('L/C Paid - Int')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCPL    R               COLHDG('L/C Paid - L/C')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCPM    R               COLHDG('L/C Paid - Misc')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCWP    R               COLHDG('L/C Waived - Prin')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCWI    R               COLHDG('L/C Waived - Int')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCWL    R               COLHDG('L/C Waived - L/C')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCWM    R               COLHDG('L/C Waived - Misc')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCOP    R               COLHDG('L/C Total O/S - Prin')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCOI    R               COLHDG('L/C Total O/S - Int')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCOL    R               COLHDG('L/C Total O/S - L/C')
LC01 A*M018                                 REFFLD(SSAMT3)
LC01 A*M018       LBLCOM    R               COLHDG('L/C Total O/S - Misc')
LC01 A*M018                                 REFFLD(SSAMT3)
     A*************************************************************************
     A* ALTERNATE RATE FILE - LNRATE
     A*************************************************************************
M001 A            ARTRID    R               COLHDG('Record' 'Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            AACCT     R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            AACTYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            ARATE     R               COLHDG('Loan' 'interest rate')
     A                                      REFFLD(SSPERD)
M001 A            ADLRRT    R               COLHDG('Dealer' 'Rate')
M001 A                                      REFFLD(SSPERD)
     A            APRTN     R               COLHDG('Prime Rate' 'Number')
     A                                      REFFLD(SSRATE)
     A            APVARI    R               COLHDG('Prime' 'Variance')
     A                                      REFFLD(SSPERD)
     A            APVCD     R               COLHDG('Prime Variance' 'Code')
     A                                      REFFLD(SSCOD1)
     A            APFLOR    R               COLHDG('Prime Rate' 'Floor')
     A                                      REFFLD(SSPERD)
     A            APCEIL    R               COLHDG('Prime Rate' 'Ceili ng')
     A                                      REFFLD(SSPERD)
     A            APRTRM    R               COLHDG('Prime' 'Review Ter m')
     A                                      REFFLD(SSTERM)
     A            APRCD     R               COLHDG('Prime Review' 'Term Code')
     A                                      REFFLD(SSCOD1)
     A            APRVD8    R               COLHDG('Prime' 'Review Date')
     A                                      REFFLD(SSDAT8)
M001 A            APRDAY    R               COLHDG('Rate' 'Review Day')
M001 A                                      REFFLD(SSCOU2)
SS26 A            APFXRT    R               COLHDG('Fixed' 'Interest Rate')
SS26 A                                      REFFLD(SSPERD)
SS26 A            APFMRT    R               COLHDG('Moratorium' 'Interest' -
SS26 A                                      'Rate')
SS26 A                                      REFFLD(SSPERD)
SS26 A            APMFIN    R               COLHDG('Max' 'Fixed Interest' -
SS26 A                                      'Amt')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            APMFMI    R               COLHDG('Max' 'Moratorium ' -
SS26 A                                      'Interest Amt')
SS26 A                                      REFFLD(SSAMT4)
     A            AEFFD8    R               COLHDG('Rate eff date')
     A                                      REFFLD(SSDAT8)
M008 A            AEBKD8    R               COLHDG('Backdated Date')
M008 A                                      REFFLD(SSDAT8)
M001 A            AYBFLG    R               COLHDG('Auto Update' 'Year Base')
M001 A                                      REFFLD(SSCOD1)
H001 A*           AEFFTM    R               COLHDG('Rate' 'Due Term')
H001 A*                                     REFFLD(SSTERM)
H001 A*           AEFFTC    R               COLHDG('Rate due' 'Term Code')
H001 A*                                     REFFLD(SSCOD1)
H001 A*           AEFDFM    R               COLHDG('Due from' '1st Rel/Ful rel')
H001 A*                                     REFFLD(SSCOD1)
     A            ADYBSE    R               COLHDG('Year base')
     A                                      REFFLD(SSCOD1)
M001 A            ALYBSE    R               COLHDG('Late Charge' 'Year Base')
M001 A                                      REFFLD(SSCOD1)
M001 A            ACYBSE    R               COLHDG('Commitment Fee' 'Year Base')
M001 A                                      REFFLD(SSCOD1)
     A            ARESTM    R               COLHDG('Rest' 'Method')
     A                                      REFFLD(SSCOD1)
     A            ADLM8     R               COLHDG('Date last' 'maint')
     A                                      REFFLD(SSDAT8)
     A            APMTCD    R               COLHDG('Upd when' 'pmtcod auto chg')
     A                                      REFFLD(SSCOD1)
M001 A            AREVD8    R               COLHDG('Rate User' 'Manual Review +
M001 A                                      Date 6')
M001 A                                      REFFLD(SSDAT8)
M001 A            ARTERM    R               COLHDG('Rate User' 'Manual Review +
M001 A                                      Term')
M001 A                                      REFFLD(SSCOU5)
M001 A            ARCODE    R               COLHDG('Rate User Manual' 'Review +
M001 A                                      Term Code')
M001 A                                      REFFLD(SSCOD1)
M001 A            ARVDAY    R               COLHDG('Rate User Manual' 'Review +
M001 A                                      Day')
M001 A                                      REFFLD(SSCOU2)
M001 A            AVFLOR    R               COLHDG('Rate' 'Var. Floor')
M001 A                                      REFFLD(SSPERD)
M001 A            AVCEIL    R               COLHDG('Rate' 'Var. Ceilling')
M001 A                                      REFFLD(SSPERD)
H001 A            AREAMO    R               COLHDG('Reamortize' 'Paym Amt')
H001 A                                      REFFLD(SSCOD1)
A007 A            AINTRT    R               COLHDG('Int. Rate Type')
A007 A*M009                                 REFFLD(SSCOD3)
M009 A                                      REFFLD(SSCODA)
R1002A            LAAPPR    R               COLHDG('Approving Authority')
R1002A                                      REFFLD(SSOFFC)
R1002A            LAARD8    R               COLHDG('Approval Date')
R1002A                                      REFFLD(SSDAT8)
G004 A            ACPRAT    R               COLHDG('CPR Rate')
G004 A                                      REFFLD(SSPERD)
     A*************************************************************************
     A* OUTSTANDING MISC CHARGE BREAKDOWN FILE - LNMISO
     A*************************************************************************
     A            LNMACT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LNMATP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
SS26 A            LNMPSP    R               COLHDG('Payment Split' 'Priority')
SS26 A                                      REFFLD(SSCOU2)
     A            LNMCTP    R               COLHDG('Charge' 'Type')
     A                                      REFFLD(SSCOD2)
     A            LNMMSD    R               COLHDG('Total' 'MiscD Chg Amount')
     A                                      REFFLD(SSAMT4)
     A            LNMOTH    R               COLHDG('Total' 'Other Chg Amount')
     A                                      REFFLD(SSAMT4)
R1034A            LNMIVT    R               COLHDG('In/Ex of VAT')
R1034A                                      REFFLD(SSCOD1)
R1034A            LNMVAT    R               COLHDG('VAT Amount')
R1034A                                      REFFLD(SSAMT4)
     A*************************************************************************
AM01 A* OUTSTANDING MISC CHARGE BREAKDOWN FILE - LNMIDO
     A*************************************************************************
     A            LMDACT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LMDATP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
SS26 A            LMDPSP    R               COLHDG('Payment Split' 'Priority')
SS26 A                                      REFFLD(SSCOU2)
     A            LMDMO     R               COLHDG('MISC/OC')
     A                                      REFFLD(SSCOD1)
     A            LMDCTP    R               COLHDG('Charge' 'Type')
     A                                      REFFLD(SSCOD2)
     A            LMDAMT    R               COLHDG('O/S Amount')
     A                                      REFFLD(SSAMT4)
     A            LMDUE8    R               COLHDG('Due Date')
     A                                      REFFLD(SSDAT8)
     A            LMPSD8    R               COLHDG('Posting Date')
     A                                      REFFLD(SSDAT8)
R1034A            LMDIVT    R               COLHDG('In/Ex of VAT')
R1034A                                      REFFLD(SSCOD1)
R1034A            LMDVAT    R               COLHDG('VAT Amount')
R1034A                                      REFFLD(SSAMT4)
     A*************************************************************************
V001 A* OUTSTANDING MISC CHARGE BREAKDOWN FILE - LNMISO
     A*************************************************************************
V001 A*
V001 A            LWMACT    R               COLHDG('Account' 'Number')
V001 A                                      REFFLD(SSACCN)
V001 A            LWMATP    R               COLHDG('Account' 'Type')
V001 A                                      REFFLD(SSACCT)
V001 A            LWMCTP    R               COLHDG('Charge' 'Type')
V001 A                                      REFFLD(SSCOD2)
V001 A            LWMMSD    R               COLHDG('Total' 'MiscD Chg Amount')
V001 A                                      REFFLD(SSAMT4)
V001 A            LWMOTH    R               COLHDG('Total' 'Other Chg Amount')
V001 A                                      REFFLD(SSAMT4)
     A*************************************************************************
SS28 A* MISC CHARGE MTD FILE FOR INCOME - LNMISG
     A*************************************************************************
     A            LNMMCI    R               COLHDG('Income' 'MiscD Chg')
     A                                      REFFLD(SSAMT4)
     A            LNMOCI    R               COLHDG('Income' 'Other Chg')
     A                                      REFFLD(SSAMT4)
     A            LNMMCW    R               COLHDG('Waive' 'MiscD Chg')
     A                                      REFFLD(SSAMT4)
     A            LNMOCW    R               COLHDG('Waive' 'Other Chg')
SS28 A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A* Captital repayment notice file - LNPMTN
     A*************************************************************************
M001 A            LPMRID    R               COLHDG('Record' 'Indentifier')
M001 A                                      REFFLD(SSCOD1)
     A            LPNSEQ    R               COLHDG('Sequence no')
     A                                      REFFLD(SSCOU3)
     A            LPNNAM    R               COLHDG('Notice amount')
     A                                      REFFLD(SSAMT4)
     A            LPNUAM    R               COLHDG('Used amount')
     A                                      REFFLD(SSAMT4)
     A            LPNND8    R               COLHDG('Notice' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LPNED8    R               COLHDG('Expiration' 'Date')
     A                                      REFFLD(SSDAT8)
M001 A            LPPRD8    R               COLHDG('Proposed Redemption' 'Date')
M001 A                                      REFFLD(SSDAT8)
     A            LPNFD8    R               COLHDG('Last Maint' 'Date')
     A                                      REFFLD(SSDAT8)
M001 A            LPBCID    R               COLHDG('Created' 'User')
M001 A                                      REFFLD(SSCODA)
M001 A            LPNCD8    R               COLHDG('Notice Creation' 'Date 6')
M001 A                                      REFFLD(SSDAT8)
M001 A            LPBCTM    R               COLHDG('Created' 'Time')
M001 A                                      REFFLD(SSTIM6)
     A*************************************************************************
M002 ** LOAN SUBSIDY HISTORY FILE - LNSUBH
     A*************************************************************************
M002 A            LNHATP    R               COLHDG('Account Type')
M002 A                                      REFFLD(SSACCT)
M002 A            LNHPD8    R               COLHDG('Subsidy Payment' 'Due Date')
M002 A                                      REFFLD(SSDAT8)
M002 A            LNHEMC    R               COLHDG('Employer Code')
M002 A                                      REFFLD(SSCOD4)
M002 A            LNHACC    R               COLHDG('Subsidized' 'Accrues Int')
M002 A                                      REFFLD(SSAMT4)
M002 A            LNHPMT    R               COLHDG('Subsidized' 'Payment Amt')
M002 A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A* Loans subsidized by third party - LNSUBS
     A*************************************************************************
M001 A            LNSRID    R               COLHDG('Record Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            LNSPMT    R               COLHDG('Payment amount')
     A                                      REFFLD(SSAMT4)
     A            LNSFPM    R               COLHDG('Final payment amont')
     A                                      REFFLD(SSAMT4)
     A            LNSPCT    R               COLHDG('Pct of interest')
     A                                      REFFLD(SSPERD)
R1014A            LNSRAT    R               COLHDG('Subsidy Interest' 'Rate')
R1014A                                      REFFLD(SSPERD)
     A            LNSCEL    R               COLHDG('Rate ceiling' 'subsidized')
     A                                      REFFLD(SSPERD)
     A            LNSCMX    R               COLHDG('Max rate for' 'employee')
     A                                      REFFLD(SSPERD)
     A            LNSBAL    R               COLHDG('Balance subsidized')
     A                                      REFFLD(SSAMT4)
     A            LNSACC    R               COLHDG('Subsidized accrual')
     A                                      REFFLD(SSAMTG)
R1014A            LNSACO    R               COLHDG('Subsidy Amount Due')
R1014A                                      REFFLD(SSAMT4)
     A            LNSPAM    R               COLHDG('Last pmt billed' 'amount')
     A                                      REFFLD(SSAMT4)
     A            LNSEX8    R               COLHDG('Expiration' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LNSPM8    R               COLHDG('Last pmt billed' 'Date')
     A                                      REFFLD(SSDAT8)
M003 A            LNSEMP    R               COLHDG('Employer Code')
M003 A                                      REFFLD(SSCODA)
M003 A            LNSENT    R               COLHDG('Employee Entity Code')
M003 A                                      REFFLD(SSCODA)
M003 A            LNSOPR    R               COLHDG('Employee' 'Operation Code')
M003 A                                      REFFLD(SSCODA)
     A** ADD FIELD FOR PACKAGE FINANCING
     A            LNSREF    R               COLHDG('Reference Number')
     A                                      REFFLD(SSDESS)
     A            LNSDLR    R               COLHDG('Dealer/' 'Participation N')
H001 A***                                   REFFLD(SSCOU7)
H001 A                                      REFFLD(SSCOUB)
     A            LNSAUT    R               COLHDG('Auto' 'Code')
     A                                      REFFLD(SSCOD3)
     A            LNSSCM    R               COLHDG('Scheme' 'Number')
     A                                      REFFLD(SSCOD5)
M001 A            LNSYTD    R               COLHDG('YTD Employer' 'Subs Amt')
M001 A                                      REFFLD(SSAMT4)
M001 A            LNSLTD    R               COLHDG('LTD Employer' 'Subs Amt')
M001 A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A* LOAN LOAN STATEMENT MESSAGE  FILE
     A*************************************************************************
     A            SMSGL1    R               COLHDG('Statement Message')
     A                                      REFFLD(SSMSG0)
     A            SMSGL2    R               COLHDG('Statement Message')
     A                                      REFFLD(SSMSG0)
     A            SMSGL3    R               COLHDG('Statement Message')
     A                                      REFFLD(SSMSG0)
     A            SMSGL4    R               COLHDG('Statement Message')
     A                                      REFFLD(SSMSG0)
     A            SMSGL5    R               COLHDG('Statement Message')
     A                                      REFFLD(SSMSG0)
     A            SMSGL6    R               COLHDG('Statement Message')
     A                                      REFFLD(SSMSG0)
     A*************************************************************************
     A* LOAN REPORT REQUEST FILE
     A*************************************************************************
     A            REPPGM    R               COLHDG('Program Name')
     A                                      REFFLD(SSCODA)
     A            DSTBRR    R               COLHDG('Branch Requested')
     A                                      REFFLD(SSBRAN)
     A*************************************************************************
     A** PAYMENT AMOUNT HISTORY FILE - LNPMTH
     A*************************************************************************
M001 A            LNHRID    R               COLHDG('Record Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            LNHACT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LNHTYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LNHNAM    R               COLHDG('New Pmt' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LNHOAM    R               COLHDG('Old Pmt' 'Amount')
     A                                      REFFLD(SSAMT4)
R1054A            LNHNFR    R               COLHDG('New Pymt' 'Frequency')
R1054A                                      REFFLD(SSCOU3)
R1054A            LNHOFR    R               COLHDG('Old Pymt' 'Frequency')
R1054A                                      REFFLD(SSCOU3)
R1054A            LNHNFC    R               COLHDG('New Pymt' 'Freq Code')
R1054A                                      REFFLD(SSCOD1)
R1054A            LNHOFC    R               COLHDG('Old Pymt' 'Freq Code')
R1054A                                      REFFLD(SSCOD1)
R1054A            LNHNIF    R               COLHDG('New Int Pymt' 'Frequency')
R1054A                                      REFFLD(SSCOU3)
R1054A            LNHOIF    R               COLHDG('Old Int Pymt' 'Frequency')
R1054A                                      REFFLD(SSCOU3)
R1054A            LNHNIC    R               COLHDG('New Int Pymt' 'Freq Code')
R1054A                                      REFFLD(SSCOD1)
R1054A            LNHOIC    R               COLHDG('Old Int Pymt' 'Freq Code')
R1054A                                      REFFLD(SSCOD1)
     A            LNHDT8    R               COLHDG('Pmt change' 'Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
     A** PAYMENT AMOUNT FUTURE FILE - LNPMTF
     A*************************************************************************
M001 A            LNFRID    R               COLHDG('Record Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            LNFACT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LNFTYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LNFNAM    R               COLHDG('New Pmt' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LNFDT8    R               COLHDG('Pmt effective' 'Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
     A** RESTRUCTURE FILE - LNREST
     A*************************************************************************
M001 A            LRARIC    R               COLHDG('Record' 'Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            LRACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LRACTY    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LRBRN     R               COLHDG('Branch' 'Number')
     A                                      REFFLD(SSBRAN)
     A            LRTYPE    R               COLHDG('Loan' 'Type')
V001 A                                      REFFLD(SSPROD)
     A            LREFD8    R               COLHDG('Effective' 'date')
     A                                      REFFLD(SSDAT8)
     A            LRPMT     R               COLHDG('Payment' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LRPFRQ    R               COLHDG('Payment' 'Frequency')
     A                                      REFFLD(SSCOU3)
     A            LRPFCD    R               COLHDG('Payment' 'Freq Code')
     A                                      REFFLD(SSCOD1)
     A            LRNPD8    R               COLHDG('Next Pymt' 'Due Date')
     A                                      REFFLD(SSDAT8)
     A            LRPRTM    R               COLHDG('Partial' 'Pymt Amt')
     A                                      REFFLD(SSAMT4)
     A            LRIFRQ    R               COLHDG('Int Payment' 'Frequency')
     A                                      REFFLD(SSCOU3)
     A            LRIFCD    R               COLHDG('Int Payment' 'Freq Code')
     A                                      REFFLD(SSCOD1)
     A            LRNIP8    R               COLHDG('Next Int Pymt' 'Due Date')
     A                                      REFFLD(SSDAT8)
     A            LRLRD8    R               COLHDG('Last Rebate' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LRNRD8    R               COLHDG('Next Rebate' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LRPBAL    R               COLHDG('Prev Rest' 'Balance')
     A                                      REFFLD(SSAMT4)
     A            LRPCOD    R               COLHDG('Payment' 'Code')
     A                                      REFFLD(SSCOU1)
     A            LRALTP    R               COLHDG('Alternate' 'payment schedu')
     A                                      REFFLD(SSCOD1)
     A            LRDRWN    R               COLHDG('Drawndown' 'Schedule')
     A                                      REFFLD(SSCOD1)
     A            LRALTR    R               COLHDG('Alternate' 'Rate')
     A                                      REFFLD(SSCOD1)
     A            LRFDRT    R               COLHDG('Recal RATE' 'FD Pledged')
     A                                      REFFLD(SSCOD1)
     A            LRLCCD    R               COLHDG('Late Charge' 'Code')
     A                                      REFFLD(SSCOU3)
     A            LRCOMN    R               COLHDG('Commitment fee' 'rate no')
H001 A*                                     REFFLD(SSCOU3)
H001 A                                      REFFLD(SSCOU5)
     A            LRCLAS    R               COLHDG('Constitution')
     A                                      REFFLD(SSCOD1)
     A            LRMINC    R               COLHDG('Minimum' 'Charge')
     A                                      REFFLD(SSAMT1)
     A            LRCZRO    R               COLHDG('Close On' 'Zero Bal Code')
     A                                      REFFLD(SSCOD1)
     A            LRSTS     R               COLHDG('Status')
     A                                      REFFLD(SSCOU1)
     A            LRAMOR    R               COLHDG('Reamortize' 'Payment Amt')
     A                                      REFFLD(SSCOD1)
     A            LRESCR    R               COLHDG('Escrow information')
     A                                      REFFLD(SSCOD1)
     A            LRHARM    R               COLHDG('ARM information')
     A                                      REFFLD(SSCOD1)
     A            LRPART    R               COLHDG('Participation' 'code')
     A                                      REFFLD(SSCOD1)
     A            LRDEPT    R               COLHDG('Dept' ' Code')
     A                                      REFFLD(SSCOU3)
     A            LRMAIL    R               COLHDG('Hold mail')
     A                                      REFFLD(SSCOD1)
     A            LRRMIN    R               COLHDG('Reminder Code')
     A                                      REFFLD(SSCOD1)
     A            LRSPUE    R               COLHDG('Send Past' 'Due Notice')
     A                                      REFFLD(SSCOD1)
     A            LRSTMT    R               COLHDG('Include on' 'Stmt Code')
     A                                      REFFLD(SSCOD1)
     A            LRBILN    R               COLHDG('Print Billing' 'Notice')
     A                                      REFFLD(SSCOD1)
     A            LRPRAT    R               COLHDG('Print Rate' 'Chg Notice')
     A                                      REFFLD(SSCOD1)
     A            LRCOUP    R               COLHDG('Print Coupon' 'Book Flag')
     A                                      REFFLD(SSCOD1)
     A            LRCTRM    R               COLHDG('Default Coupon' 'Book Term')
     A                                      REFFLD(SSCOU3)
     A            LRCFPD    R               COLHDG('Cal 1st Instl' 'Date')
     A                                      REFFLD(SSCOD1)
R1029A            LRRCFP    R               COLHDG('Recal 1st Instl' 'Date')
R1029A                                      REFFLD(SSCOD1)
     A            LRUPPC    R               COLHDG('Auto update' 'Pymt cpde')
     A                                      REFFLD(SSCOD1)
     A            LRDFPC    R               COLHDG('Default' 'Pymt cpde(Upt)')
     A                                      REFFLD(SSCOU1)
     A            LRRUMD    R               COLHDG('Auto extend' 'maturity dat')
     A                                      REFFLD(SSCOD1)
     A            LRMTHN    R               COLHDG('Nmth grace on' 'BKDISC cal')
     A                                      REFFLD(SSCOU3)
     A            LRINAL    R               COLHDG('NPL-allocate' 'Int first')
     A                                      REFFLD(SSCOD1)
     A            LRSIC1    R               COLHDG('SIC Code 1')
     A                                      REFFLD(SSCOD1)
     A            LRSIC2    R               COLHDG('SIC Code 2')
     A                                      REFFLD(SSCOD1)
     A            LRSIC3    R               COLHDG('SIC Code 3')
     A                                      REFFLD(SSCOD1)
     A            LRSIC4    R               COLHDG('SIC Code 4')
     A                                      REFFLD(SSCOD1)
M001 A            LRIBSE    R               COLHDG('Interest' 'Base')
M001 A                                      REFFLD(SSCOU1)
M001 A            LRIFRE    R               COLHDG('Mode of' 'Interest')
M001 A                                      REFFLD(SSCOD1)
M001 A            LRYBSE    R               COLHDG('Year' 'Base')
M001 A                                      REFFLD(SSCOU1)
M001 A            LRRPUR    R               COLHDG('Reamortise Pmt amt' 'Upon R-
M001 A                                      estructuring')
M001 A                                      REFFLD(SSCOD1)
     A*************************************************************************
     A**NEW FIELDS ADDED FOR VER3
     A*************************************************************************
     A            LRUPDO    R               COLHDG('Disburse' 'on/bef day')
     A                                      REFFLD(SSCOU2)
     A            LRDAFP    R               COLHDG('Day for auto' '1st pymt')
     A                                      REFFLD(SSCOU2)
     A            LRCPAM    R               COLHDG('Reamortise when' 'CP')
     A                                      REFFLD(SSCOD1)
     A            LRMDRC    R               COLHDG('Update Mat dt' '-Rate chg')
     A                                      REFFLD(SSCOD1)
     A            LRMDCP    R               COLHDG('Update Mat date' '- C/P')
     A                                      REFFLD(SSCOD1)
     A            LRROLM    R               COLHDG('Rollover' 'method')
     A                                      REFFLD(SSCOD1)
     A            LRCNIP    R               COLHDG('Auto set' 'NIPDT')
     A                                      REFFLD(SSCOD1)
     A            LRUPIO    R               COLHDG('Disburse' 'on/bef day')
     A                                      REFFLD(SSCOU2)
     A            LRDANI    R               COLHDG('Day for auto' 'NIPDT')
     A                                      REFFLD(SSCOU2)
     A            LRGRP     R               COLHDG('GL Group' 'Code')
     A                                      REFFLD(SSGRUP)
     A            ETOTIN    R               COLHDG('Total Interest' 'Paid')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            STS       R               COLHDG('STATUS')
     A                                      REFFLD(SSCOD1)
     A            ACTYP     R               COLHDG('Account type')
     A                                      REFFLD(SSCOD1)
     A            NXTPDD    R               COLHDG('Next Pay Due Day')
     A                                      REFFLD(SSDAT2)
     A            CAPCST    R
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            FEEREP    R
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            AMMTHD    R
     A                                      REFFLD(SSCOD1)
     A            YIELD     R
     A                                      REFFLD(SSPERD)
     A            LNCRYN    R
     A                                      REFFLD(SSCOD1)
     A            MYST      R
     A                                      REFFLD(SSCOD1)
     A            BLNK      R
     A                                      REFFLD(SSCOD1)
     A            STAT      R
     A                                      REFFLD(SSCOD1)
     A            GDESC     R
     A                                      REFFLD(SSDESM)
     A            DUEDT8    R               COLHDG('Next Due Date')
     A                                      REFFLD(SSDAT8)
     A            PRINCP    R               COLHDG('Principal')
     A                                      REFFLD(SSAMT4)
     A            INTR      R               COLHDG('Interest')
     A                                      REFFLD(SSAMT4)
     A            BALOUT    R               COLHDG('Running Balance')
     A                                      REFFLD(SSAMT4)
     A            NDAYS     R               COLHDG('AGGREGATE DAYS')
     A                                      REFFLD(SSCOU3)
     A            YAGBAL    R               COLHDG('AGGREGATE BALANCE')
     A                                      REFFLD(SSAMT5)
     A            SUMTYP    R               COLHDG('SUMMARY TYPE')
     A                                      REFFLD(SSCOD1)
     A            WTEXT     R
     A                                      REFFLD(SSCOD7)
     A            WGTEP     R
     A                                      REFFLD(SSCOD8)
     A            WUNSBO    R               COLHDG('Tot Unsecured' 'Borrower')
     A                                      REFFLD(SSAMT4)
     A            WSECBO    R               COLHDG('Tot Secured' 'Borrower')
     A                                      REFFLD(SSAMT4)
     A            TBORRW    R               COLHDG('Tot Borrower')
     A                                      REFFLD(SSAMT4)
     A            WUNSOS    R               COLHDG('Tot Unsecurd' 'O/S Bal')
     A                                      REFFLD(SSAMT4)
     A            WSECOS    R               COLHDG('Tot Secured' 'O/S Bal')
     A                                      REFFLD(SSAMT4)
     A            TBOROS    R               COLHDG('Tot Borrower' 'O/S Bal')
     A                                      REFFLD(SSAMT4)
     A* LN3730
     A            HASLOC    R               COLHDG('Has Line of Credit')
     A                                      REFFLD(SSCOD1)
     A* LN3917
     A            LLAMTH    R               COLHDG('Acceptance' 'Month')
     A                                      REFFLD(SSCOU3)
     A            LLBR      R               COLHDG('Branch')
     A                                      REFFLD(SSBRAN)
     A            LLDLNO    R               COLHDG('Dealer' 'No')
     A                                      REFFLD(SSCOU3)
     A            LLRATE    R               COLHDG('Rate')
     A                                      REFFLD(SSPERD)
     A            LLCNT     R               COLHDG('Counts')
     A                                      REFFLD(SSCOU5)
     A            LLTCHG    R               COLHDG('Other' 'Charges')
     A                                      REFFLD(SSAMT4)
     A            LLRBAT    R               COLHDG('Rebates')
     A                                      REFFLD(SSAMT4)
     A            LLDAR     R               COLHDG('Dealer' 'DAR')
     A                                      REFFLD(SSAMT4)
     A            LLPMAR    R               COLHDG('Gross' 'Profit Margin')
     A                                      REFFLD(SSAMT4)
     A* LN3919
     A            CADACC    R
     A                                      REFFLD(SSACCN)
     A            CADCID    R
     A                                      REFFLD(SSDCID)
     A* LN3934
     A            GOODSF    R               COLHDG('Type V/E')
     A                                      REFFLD(SSCOD1)
     A            LNTYPE    R               COLHDG('Tran H/L')
     A                                      REFFLD(SSCOD1)
     A*************************************************************************
     A* LN9100
     A*************************************************************************
M004 A            L9CRID    R               COLHDG('Record Identifier')
M004 A                                      REFFLD(SSCOD1)
OS06 A            L9BKN     R               COLHDG('Bank Number')
OS06 A                                      REFFLD(SSBANK)
OS06 A            L9BRN     R               COLHDG('Branch Number')
OS06 A                                      REFFLD(SSBRAN)
     A            L9RATN    R               COLHDG('Rate' 'Number')
     A*M004                                 REFFLD(SSCOU3)
M004 A                                      REFFLD(SSRATE)
     A            L9CURR    R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A            L9RADJ    R               COLHDG('Rate' 'Adjustment')
     A                                      REFFLD(SSPERD)
     A            L9EFD8    R               COLHDG('Effective' 'Date')
     A                                      REFFLD(SSDAT8)
     A            L9DAYN    R               COLHDG('Days' 'Adjusted')
     A                                      REFFLD(SSCOU3)
     A            L9NRAT    R               COLHDG('New' 'Rate')
     A                                      REFFLD(SSPERD)
M004 A            L9WUID    R               COLHDG('User ID')
M004 A                                      REFFLD(SSCODA)
M004 A            L9WWID    R               COLHDG('Workstation ID')
M004 A                                      REFFLD(SSCODA)
M004 A            L9WDT8    R               COLHDG('Last Maint' 'Date')
M004 A                                      REFFLD(SSDAT8)
M004 A            L9WTIM    R               COLHDG('Last Maint' 'Time')
M004 A                                      REFFLD(SSTIM6)
     A*************************************************************************
     A* Accrued interest history file - LNACCH
     A*************************************************************************
     A            LAHACT    R               COLHDG('Account number')
     A                                      REFFLD(SSACCN)
     A            LAHATP    R               COLHDG('Account type')
     A                                      REFFLD(SSACCT)
     A            LAHDT8    R               COLHDG('Change date')
     A                                      REFFLD(SSDAT8)
M036 A            LAHARL    R               COLHDG('New amount release')
M036 A                                      REFFLD(SSAMT4)
     A            LAHACB    R               COLHDG('New accrual balance')
     A                                      REFFLD(SSAMT4)
     A            LAHACR    R               COLHDG('New accrual rate')
     A                                      REFFLD(SSPERD)
SS26 A            LAHPRN    R               COLHDG('New Prime' 'Rate No.')
SS26 A                                      REFFLD(SSRATE)
SS26 A            LAHFLR    R               COLHDG('New Prime' 'Rate Floor')
SS26 A                                      REFFLD(SSPERD)
SS26 A            LAHCEI    R               COLHDG('New Prime' 'Rate Ceiling')
SS26 A                                      REFFLD(SSPERD)
M003 A            LAHVRI    R               COLHDG('New' 'Variance')
M003 A                                      REFFLD(SSPERD)
M003 A            LAHVCD    R               COLHDG('New Variance' 'Code')
M003 A                                      REFFLD(SSCOD1)
R1027A            LAHART    R               COLHDG('Account Rate')
R1027A                                      REFFLD(SSPERD)
R1027A            LAHDRT    R               COLHDG('Default Rate')
R1027A                                      REFFLD(SSPERD)
SS26 A            LAHACF    R               COLHDG('New Fixed' 'Interest Rate')
SS26 A                                      REFFLD(SSPERD)
SS26 A            LAHACM    R               COLHDG('New Moratorium' 'Interest' -
SS26 A                                      'Rate')
SS26 A                                      REFFLD(SSPERD)
SS26 A            LAHMXF    R               COLHDG('New Max' 'Fixed Interest' -
SS26 A                                      'Amt')
SS26 A                                      REFFLD(SSAMT4)
SS26 A            LAHMXM    R               COLHDG('New Max' 'Moratorium ' -
SS26 A                                      'Interest Amt')
SS26 A                                      REFFLD(SSAMT4)
H001 A            LAHACY    R               COLHDG('New accrual' 'year base')
H001 A                                      REFFLD(SSCOU1)
OS02 A            LAHACI    R               COLHDG('New accrual' 'inclusive')
OS02 A                                      REFFLD(SSCOD1)
     A            LAHCFB    R               COLHDG('New C/F acc bal')
     A                                      REFFLD(SSAMT4)
R1016A            LAHCFL    R               COLHDG('New C/F limit')
R1016A                                      REFFLD(SSAMT4)
     A            LAHCFR    R               COLHDG('New C/F acc rate')
     A                                      REFFLD(SSPERD)
M001 A            LAHCEB    R               COLHDG('NEW C/F' 'EXCESS ACC BAL')
M001 A                                      REFFLD(SSAMT4)
M001 A            LAHCER    R               COLHDG('NEW C/F' 'EXCESS ACC RATE')
M001 A                                      REFFLD(SSPERD)
H001 A            LAHCFY    R               COLHDG('New C/F acc' 'year base')
H001 A                                      REFFLD(SSCOU1)
OS02 A            LAHCFI    R               COLHDG('New C/F acc' 'inclusive')
OS02 A                                      REFFLD(SSCOD1)
     A            LAHLCB    R               COLHDG('New L/C acc bal')
     A                                      REFFLD(SSAMT4)
M003 A            LAHLIN    R               COLHDG('New L/C acc bal' ' - Int')
M003 A                                      REFFLD(SSAMT4)
M003 A            LAHLLC    R               COLHDG('New L/C acc bal' ' - LC')
M003 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M003 A            LAHLCF    R               COLHDG('New L/C acc bal' ' - CF')
M003 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M003 A            LAHLMC    R               COLHDG('New L/C acc bal' ' - MC')
M003 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M033 A            LAHLOC    R               COLHDG('New L/C acc bal' ' - OC')
M033 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LAHLCR    R               COLHDG('New L/C acc rate')
     A                                      REFFLD(SSPERD)
M003 A            LAHLCM    R               COLHDG('New L/C' 'Margin')
M003 A                                      REFFLD(SSPERD)
H001 A            LAHLCY    R               COLHDG('New L/C acc' 'year base')
H001 A                                      REFFLD(SSCOU1)
OS02 A            LAHLCI    R               COLHDG('New L/C acc' 'inclusive')
OS02 A                                      REFFLD(SSCOD1)
M003 A            LAILCB    R               COLHDG('New L/C acc bal' 'Interest')
M003 A                                      REFFLD(SSAMT4)
M003 A            LAILCR    R               COLHDG('New L/C acc rate' 'Int')
M003 A                                      REFFLD(SSPERD)
M003 A            LAILCM    R               COLHDG('New L/C' 'Margin Int')
M003 A                                      REFFLD(SSPERD)
     A            LAHDLB    R               COLHDG('New Dealer acc bal')
     A                                      REFFLD(SSAMT4)
     A            LAHDLR    R               COLHDG('New Dealer acc rate')
     A                                      REFFLD(SSPERD)
M001 A            LAHDLY    R               COLHDG('New Dealer acc' 'year base')
M001 A                                      REFFLD(SSCOU1)
     A*************************************************************************
V001 A*   LNRATP  -   RATE APPLIES           unique key
     A*************************************************************************
V001 A            RTACCT        19  0       COLHDG('Account' 'Number')
V001 A            RTATYP         1          COLHDG('Account' 'Type')
V001 A            RTFRTN         3  0       COLHDG('Rate #' 'Fixed')
V001 A            RTFVRI        11  9       COLHDG('Rate Variance' 'Fixed')
V001 A            RTFVRC         1          COLHDG('Rate' 'Var Code' 'Fixed')
V001 A            RTFIXR        11  9       COLHDG('Fixed' 'Rate')
V001 A            RTBRTN         3  0       COLHDG('Rate #' 'Board')
V001 A            RTBVRI        11  9       COLHDG('Rate Variance' 'Board')
V001 A            RTBVRC         1          COLHDG('Rate' 'Var Code' 'Board')
     A*************************************************************************
     A* LOAN TIER FILE - LNTIER
     A*************************************************************************
M001 A            LTARID    R               COLHDG('Record Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            LTACNO    R               COLHDG('Account' 'number')
     A                                      REFFLD(SSACCN)
     A            LTATYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LTSEQ     R               COLHDG('Sequence' 'number')
     A                                      REFFLD(SSCOU9)
     A            LTSEQP    R               COLHDG('Posting' 'Sequence')
     A                                      REFFLD(SSCOU9)
SS31 A            LTTITY    R               COLHDG('Tier type')
SS31 A                                      REFFLD(SSCODA)
     A            LTFDRT    R               COLHDG('Tied to' 'FD Rate')
     A                                      REFFLD(SSCOD1)
     A* S = Savings
     A* T = Time deposit
     A* B = Both savings and time deposit
     A*' '= Not tied to deposit
     A            LTTLMT    R               COLHDG('Tier limit')
     A                                      REFFLD(SSAMT4)
SS31 A            LTALMT    R               COLHDG('Authorised Limit')
SS31 A                                      REFFLD(SSAMT4)
     A            LTUTAM    R               COLHDG('Utilized Amount')
     A                                      REFFLD(SSAMT4)
     A            LTRATE    R               COLHDG('Rate')
     A                                      REFFLD(SSPERD)
     A            LTRTN     R               COLHDG('Rate' 'number')
     A                                      REFFLD(SSRATE)
     A            LTPVAR    R               COLHDG('Rate' 'variance')
     A                                      REFFLD(SSPERD)
     A            LTPVR1    R               COLHDG('Variance' 'code')
     A                                      REFFLD(SSCOD1)
     A            LTFLOR    R               COLHDG('Rate' 'floor')
     A                                      REFFLD(SSPERD)
     A            LTCEIL    R               COLHDG('Rate' 'ceiling')
     A                                      REFFLD(SSPERD)
     A            LTRDT8    R               COLHDG('Rate review' 'date')
     A                                      REFFLD(SSDAT8)
     A            LTTERM    R               COLHDG('Rate review' 'term')
H001 A                                      REFFLD(SSTERM)
     A*H001                                 REFFLD(SSRATE)
     A            LTTRCD    R               COLHDG('Rate review' 'term code')
     A                                      REFFLD(SSCOD1)
V001 A            LTRDAY    R               COLHDG('Rate review' 'day')
V001 A                                      REFFLD(SSCOU2)
SS31 A            LTAUTR    R               COLHDG('Auto Rate' 'Review fr FD')
SS31 A                                      REFFLD(SSCOD4)
SS31 A            LTURTN    R               COLHDG('Comm Fee Rate no')
SS31 A                                      REFFLD(SSRATE)
SS31 A            LTCOMR    R               COLHDG('Comm Fee Rate')
SS31 A                                      REFFLD(SSPERD)
SS31 A            LTULTP    R               COLHDG('Comm Fee Accr Type')
SS31 A                                      REFFLD(SSCOD1)
     A            LTSTR8    R               COLHDG('Start' 'date')
     A                                      REFFLD(SSDAT8)
     A            LTEXP8    R               COLHDG('Expiration' 'date')
     A                                      REFFLD(SSDAT8)
     A*M001       LTDLM6    R               COLHDG('Date last' 'maintenance')
     A*M001                                 REFFLD(SSDAT8)
     A*M001       LTDLM7    R               COLHDG('Date last' 'maintenance')
     A*M001                                 REFFLD(SSDAT7)
A022 A*M001       LTRTYP    R               COLHDG('Rate' 'Type')
A022 A*M001                                 REFFLD(SSCOD3)
M001 A*M037       LTRTTP    R               COLHDG('Rate' 'Type')
M001 A*M037                                 REFFLD(SSCOD3)
M037 A            LTRTTP    R               COLHDG('Interest Rate Type')
M037 A                                      REFFLD(SSCODA)
SS26 A            LTCLID    R               COLHDG('Collateral ID')
SS26 A                                      REFFLD(SSDCID)
R1037A            LTFCID    R               COLHDG('Facility ID')
R1037A                                      REFFLD(SSACCN)
R1054A            LTCRPD    R               COLHDG('Cross Product' 'Flag')
R1054A                                      REFFLD(SSCOD1)
R1054A            LTCRSQ    R               COLHDG('Cross Product' 'Sequence')
R1054A                                      REFFLD(SSCOU9)
R1054A            LTCRNO    R               COLHDG('Cross Prod' 'No of Times' -
R1054A                                      'Update')
R1054A                                      REFFLD(SSCOU3)
     A*************************************************************************
     A* LOAN TIER HISTORY FILE - LNTIRH
     A*************************************************************************
     A            LTHACT    R               COLHDG('Account number')
     A                                      REFFLD(SSACCN)
     A            LTHTYP    R               COLHDG('Account Type')
     A                                      REFFLD(SSACCT)
     A            LTHD8     R               COLHDG('Date changed')
     A                                      REFFLD(SSDAT8)
     A            LTHBL     R               COLHDG('New tier limit')
     A                                      REFFLD(SSAMT4)
     A*R1027      LTHRT     R               COLHDG('New tier rate')
R1027A            LTHRT     R               COLHDG('New actual tier rate')
     A                                      REFFLD(SSPERD)
R1027A            LTHTRT    R               COLHDG('Normal tier rate')
R1027A                                      REFFLD(SSPERD)
R1027A            LTHDRT    R               COLHDG('Default rate')
R1027A                                      REFFLD(SSPERD)
     A*************************************************************************
     A* LOAN ROLLOVER FILE - LNROLL
     A*************************************************************************
M001 A            LOARID    R               COLHDG('Record' 'Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            LOACNO    R               COLHDG('Account number')
     A                                      REFFLD(SSACCN)
     A            LOATYP    R               COLHDG('Account Type')
     A                                      REFFLD(SSACCT)
     A            LOEFD8    R               COLHDG('Effective' 'Date')
     A                                      REFFLD(SSDAT8)
H001 A            LOBTO8    R               COLHDG('Backdated' 'To')
H001 A                                      REFFLD(SSDAT8)
     A            LOEXP8    R               COLHDG('Expiration' 'Date')
     A                                      REFFLD(SSDAT8)
M042 A            LOMETD    R               COLHDG('Rollover' 'Balance')
     A                                      REFFLD(SSCOD1)
     A            LOTERM    R               COLHDG('Rollover' 'Term')
     A                                      REFFLD(SSTERM)
     A            LOTRCD    R               COLHDG('Rollover' 'Term Code')
     A                                      REFFLD(SSCOD1)
     A            LOAMT     R               COLHDG('Fixed Prin' 'To Rollover')
     A                                      REFFLD(SSAMT4)
M001 A            LOAMTI    R               COLHDG('Fixed Int' 'To Rollover')
M001 A                                      REFFLD(SSAMT4)
     A            LORATE    R               COLHDG('Rollover' 'Rate')
     A                                      REFFLD(SSPERD)
     A            LORTN     R               COLHDG('Rollover' 'Rate No.')
     A                                      REFFLD(SSRATE)
     A            LOPVAR    R               COLHDG('Rate' 'Variance')
     A                                      REFFLD(SSPERD)
     A            LOPVRC    R               COLHDG('Rate' 'Variance Code')
     A                                      REFFLD(SSCOD1)
     A            LOFLOR    R               COLHDG('Rate' 'Floor')
     A                                      REFFLD(SSPERD)
     A            LOCEIL    R               COLHDG('Rate' 'Ceiling')
     A                                      REFFLD(SSPERD)
M001 A            LOVFLR    R               COLHDG('Rate Var.' 'Floor')
M001 A                                      REFFLD(SSPERD)
M001 A            LOVCEL    R               COLHDG('Rate Var.' 'Ceiling')
M001 A                                      REFFLD(SSPERD)
     A            LORDT8    R               COLHDG('Rate' 'Review Date')
     A                                      REFFLD(SSDAT8)
     A            LORVDY    R               COLHDG('Rate' 'Review Day')
     A                                      REFFLD(SSDAT2)
     A            LORTRM    R               COLHDG('Rate' 'Review Term')
     A                                      REFFLD(SSTERM)
     A            LORTRC    R               COLHDG('Rate' 'Review Term Code')
     A                                      REFFLD(SSCOD1)
V001 A            LODLRT    R               COLHDG('Dealer' 'Rate')
V001 A                                      REFFLD(SSPERD)
M001 A            LORRD8    R               COLHDG('Rate User Manual' 'Review +
M001 A                                      Date 6')
M001 A                                      REFFLD(SSDAT8)
M001 A            LORRTM    R               COLHDG('Rate User Manual' 'Review +
M001 A                                      Term')
M001 A                                      REFFLD(SSCOU4)
M001 A            LORRCD    R               COLHDG('Rate User Manual' 'Review +
M001 A                                      Term Code')
M001 A                                      REFFLD(SSCOD1)
M001 A            LORRDY    R               COLHDG('Rate User Manual' 'Review +
M001 A                                      Day')
M001 A                                      REFFLD(SSDAT2)
M021 A            LODRLM    R               COLHDG('Drawing Limit')
M021 A                                      REFFLD(SSAMT4)
M021 A            LOSSEL    R               COLHDG('Selling Price')
M021 A                                      REFFLD(SSAMT4)
H001 A            LOBENO    R               COLHDG('BE No.')
H001 A*R1002                                REFFLD(SSCODF)
R1002A                                      REFFLD(SSGLNO)
OS03 A            LOFCDE    R               COLHDG('Rollover' 'Fee Code')
OS03 A                                      REFFLD(SSCOD2)
OS03 A            LOLRD8    R               COLHDG('Last Rollover Date')
OS03 A                                      REFFLD(SSDAT8)
OS03 A            LOLRAM    R               COLHDG('Last Rollover Amount')
OS03 A                                      REFFLD(SSAMT4)
     A            LODLM8    R               COLHDG('Maintenance' 'Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
     A** INVOICE/CHEQUE/PROMISSORY NOTE MASTER FILE (LNPICF)
     A*************************************************************************
     A*R1012      LIPICN    R               COLHDG('Invoice/Cheque/PN' 'Number')
     A*R1012                                REFFLD(SSDESS)
     A*R1012      LISPIC    R               COLHDG('Suporting PN' '/cheques')
     A*R1012                                REFFLD(SSDESS)
SS30 A*R1012      LIOPIC    R               COLHDG('Original' 'Inv/Cheque/PN')
SS30 A*R1012                                REFFLD(SSDESS)
     A*R1012      LISTS     R               COLHDG('Status')
     A*R1012                                REFFLD(SSACCS)
     A*R1012      LIPICT    R               COLHDG('Type of' 'Exchange')
     A*R1012                                REFFLD(SSCOD1)
     A* I=INVOICE
     A* C=CHEQUES
     A* P=P/N
     A*R1012      LITYPN    R               COLHDG('Type of' 'P/N')
     A*R1012                                REFFLD(SSCOD1)
     A* A=AVALED
     A* F=Fix P/N
     A* C=Call P/N
     A*R1012      LIDTNO    R               COLHDG('Document' 'Number')
     A*R1012                                REFFLD(SSDESS)
     A*R1012      LIDENO    R               COLHDG('Debtor' 'Number')
H001 A***                                   REFFLD(SSCOU7)
H001 A*R1012                                REFFLD(SSCOUB)
     A*R1012      LIACCT    R               COLHDG('Account' 'Number')
     A*R1012                                REFFLD(SSACCN)
     A*R1012      LIATYP    R               COLHDG('Account' 'Type')
     A*R1012                                REFFLD(SSACCT)
     A*R1012      LIACCR    R               COLHDG('Replacement A/C' 'Number')
     A*R1012                                REFFLD(SSACCN)
     A*R1012      LIACTR    R               COLHDG('Replacement A/C' 'Type')
     A*R1012                                REFFLD(SSACCT)
     A*R1012      LICURR    R               COLHDG('Currency')
     A*R1012                                REFFLD(SSCURC)
     A*R1012      LIFXRT    R               COLHDG('Exchange' 'Rate')
     A*R1012                                REFFLD(SSAMTQ)
     A*R1012      LIISS8    R               COLHDG('Issue' 'Date')
     A*R1012                                REFFLD(SSDAT8)
     A*R1012      LIEXP8    R               COLHDG('Expiry' 'Date')
     A*R1012                                REFFLD(SSDAT8)
     A*R1012      LIIVC8    R               COLHDG('Invoice' 'Collection Date')
     A*R1012                                REFFLD(SSDAT8)
     A*R1012      LITDT8    R               COLHDG('Target' 'Date')
     A*R1012                                REFFLD(SSDAT8)
     A*R1012      LICAT8    R               COLHDG('Cheque' 'Acceptance Date')
     A*R1012                                REFFLD(SSDAT8)
     A*R1012      LIAMT     R               COLHDG('Amount')
     A*R1012                                REFFLD(SSAMT4)
     A*R1012      LIREVA    R               COLHDG('Reserve' 'Amount')
     A*R1012                                REFFLD(SSAMT4)
     A*R1012      LIMGNA    R               COLHDG('Margin' 'Amount')
     A*R1012                                REFFLD(SSAMT4)
     A*R1012      LINETP    R               COLHDG('Net' 'Proceed')
     A*R1012                                REFFLD(SSAMT4)
     A*R1012      LITENR    R               COLHDG('Invoice' 'Tenor')
     A*R1012                                REFFLD(SSCOU3)
     A*R1012      LITRCD    R               COLHDG('Invoice Term' 'Code')
     A*R1012                                REFFLD(SSCOD1)
     A*R1012      LISCHN    R               COLHDG('Schedule' 'Number')
     A*R1012                                REFFLD(SSCOUB)
     A*R1012      LIROUT    R               COLHDG('Routing' 'Number')
     A*R1012                                REFFLD(SSCOU9)
     A*R1012      LILOCT    R               COLHDG('Collection' 'item code')
     A*R1012                                REFFLD(SSCOD2)
     A*R1012      LIPYER    R               COLHDG('Payer' 'Name')
     A*R1012                                REFFLD(SSDESM)
     A*R1012      LIPAYN    R               COLHDG('Payer' 'Account No')
     A*R1012                                REFFLD(SSACCN)
     A*R1012      LIISBY    R               COLHDG('Issued' 'By')
     A*R1012                                REFFLD(SSDESM)
     A*R1012      LIEDOR    R               COLHDG('Endorsers')
     A*R1012                                REFFLD(SSDESM)
     A*R1012      LIIRAT    R               COLHDG('Interest' 'Rate')
     A*R1012                                REFFLD(SSPERD)
     A*R1012      LIDRNM    R               COLHDG('Drawer' 'Name')
     A*R1012                                REFFLD(SSDESM)
     A*R1012      LIFTYP    R               COLHDG('Bill Category')
     A*R1012                                REFFLD(SSCOD3)
     A*R1012      LIBPRT    R               COLHDG('Print Bill Flag')
     A*R1012                                REFFLD(SSCOD1)
     A*R1012      LIBMOV    R               COLHDG('Bill Movement' 'Status')
     A*R1012                                REFFLD(SSCOD1)
     A*'R'=Return to bank
SS26 A*R1012      LICRTY    R               COLHDG('Certificate Type')
SS26 A*R1012                                REFFLD(SSCOD1)
SS26 A*R1012      LITRDN    R               COLHDG('Trade Number')
SS26 A*R1012                                REFFLD(SSCOU9)
SS26 A*R1012      LISEL8    R               COLHDG('Selling Date')
SS26 A*R1012                                REFFLD(SSDAT8)
SS26 A*R1012      LISRAT    R               COLHDG('Interest Selling' 'Rate')
SS26 A*R1012                                REFFLD(SSPERD)
SS26 A*R1012      LIERAT    R               COLHDG('Effective Interest' -
SS26 A*R1012                                'Selling Rate')
SS26 A*R1012                                REFFLD(SSPERD)
SS26 A*R1012      LISCIF    R               COLHDG('Buyer CIF No.')
SS26 A*R1012                                REFFLD(SSCIFN)
SS26 A*R1012      LISTYP    R               COLHDG('Selling Type' 'without' -
SS26 A*R1012                                'without')
SS26 A*R1012                                REFFLD(SSCOD1)
SS26 A*R1012      LISTRM    R               COLHDG('Sold Term')
SS26 A*R1012                                REFFLD(SSCOU3)
SS26 A*R1012      LISTMC    R               COLHDG('Sold Term code')
SS26 A*R1012                                REFFLD(SSCOD1)
SS26 A*R1012      LISAMT    R               COLHDG('Price of Selling')
SS26 A*R1012                                REFFLD(SSAMT4)
SS26 A*R1012      LISBKD    R               COLHDG('Bank Discount' 'Sold' -
SS26 A*R1012                                'Portion')
SS26 A*R1012                                REFFLD(SSAMT4)
SS26 A*R1012      LISPRF    R               COLHDG('Profit/Loss')
SS26 A*R1012                                REFFLD(SSAMT4)
SS26 A*R1012      LISWHC    R               COLHDG('Buyer Witholding' 'Code')
SS26 A*R1012                                REFFLD(SSCOD1)
SS26 A*R1012      LISWHA    R               COLHDG('Buyer Witholding' 'Amt')
SS26 A*R1012                                REFFLD(SSAMT4)
SS26 A*R1012      LISBKN    R               COLHDG('Bank')
SS26 A*R1012                                REFFLD(SSBANK)
SS26 A*R1012      LISBRN    R               COLHDG('Branch')
SS26 A*R1012                                REFFLD(SSBRAN)
SS26 A*R1012      LISOFF    R               COLHDG('Officer Code')
SS26 A*R1012                                REFFLD(SSOFFC)
SS26 A*R1012      LICOST    R               COLHDG('Cost Center Code')
SS26 A*R1012                                REFFLD(SSCOST)
SS26 A*R1012      LIPRDC    R               COLHDG('Business' 'Unit/Product' -
SS26 A*R1012                                'Code')
SS26 A*R1012                                REFFLD(SSPROC)
SS26 A*R1012      LIAVCF    R               COLHDG('AVAL CIF No.')
SS26 A*R1012                                REFFLD(SSCIFN)
R1012A*************************************************************************
     A** BILL OF EXCHANGE/CHEQUE/PROMISSORY NOTE MASTER FILE (LNPICF)
R1012A*************************************************************************
R1012A            LIPICN    R               COLHDG('BE' '/Cheque/PN' 'Number')
     A                                      REFFLD(SSDESS)
     A* B=Bill Of Exchange
     A* C=CHEQUES
     A* P=P/N
     A            LIAMT     R               COLHDG('BE' '/Cheque/PN' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LITYPN    R               COLHDG('Type of' 'P/N')
     A                                      REFFLD(SSCOD1)
     A* F=With Maturity
     A* C=Without Maturity
     A            LIISBY    R               COLHDG('Issued' 'By')
     A                                      REFFLD(SSCODA)
     A            LIAVBY    R               COLHDG('AVAL' 'By')
     A                                      REFFLD(SSCODA)
     A            LIACBY    R               COLHDG('Acceptance' 'By')
     A                                      REFFLD(SSCODA)
     A            LIISS8    R               COLHDG('Issue' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LIIVC8    R               COLHDG('Value' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LIEXP8    R               COLHDG('BE/PN/Cheque Due' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LIACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LIATYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LIROUT    R               COLHDG('Routing' 'Number')
     A                                      REFFLD(SSCOU9)
R1044A            LIBATN    R               COLHDG('Batch Number')
R1044A                                      REFFLD(SSCODA)
R1045A            LIPAYN    R               COLHDG('Payer' 'Account No')
R1045A                                      REFFLD(SSACCN)
     A            LIBPRT    R               COLHDG('Print PN Flag')
     A                                      REFFLD(SSCOD1)
R1002A            LIRDRW    R               COLHDG('Rediscount' +
R1002A                                      ' with Recourse')
R1002A                                      REFFLD(SSCOD1)
R1052A            LILCOC    R               COLHDG('L/C or O/C')
R1052A                                      REFFLD(SSCOD1)
     A            LISBKN    R               COLHDG('Cheque Bank')
     A                                      REFFLD(SSBANK)
     A            LISBRN    R               COLHDG('Cheque Branch')
     A                                      REFFLD(SSBRAN)
K0002A            LIBRGN    R               COLHDG('Registration' '/Plate No.')
K0002A                                      REFFLD(SSDES2)
K0002A*K0023      LICOLO    R               COLHDG('Color')
K0002A*K0023                                REFFLD(SSCOD2)
K0023A            LICLCD    R               COLHDG('Color')
K0023A                                      REFFLD(SSCOD3)
K0002A            LICDRB    R               COLHDG('Code Red Book')
K0002A                                      REFFLD(SSCODA)
K0002A*K0004      LIDCHN    R               COLHDG('Chassis number')
K0004A            LIDCHN    R               COLHDG('Chassis number' +
K0004A                                      '/Reference.No')
K0002A                                      REFFLD(SSDESM)
K0020A            LICCOC    R               COLHDG('Country Code')
K0020A                                      REFFLD(SSCOD3)
K0002A            LIVPRV    R               COLHDG('Province')
K0002A                                      REFFLD(SSCOD3)
K0002A            LIMAKE    R               COLHDG('Make of Goods')
K0002A                                      REFFLD(SSCOD5)
K0002A*K0023      LIMODN    R               COLHDG('Model Number')
K0002A*K0023                                REFFLD(SSCOD5)
K0023A            LIMODG    R               COLHDG('Model Number')
K0023A                                      REFFLD(SSCODF)
K0002A            LIRTYP    R               COLHDG('Record Type')
K0002A                                      REFFLD(SSCOD2)
K0002A*K0008      LIVSTS    R               COLHDG('Vehical Status')
K0002A*K0008                                REFFLD(SSCOD3)
K0008A            LIVSTS    R               COLHDG('Vehical Status')
K0008A                                      REFFLD(SSCOU5)
K0011A            LICDNA    R               COLHDG('Card Holder Name')
K0011A                                      REFFLD(SSNAML)
K0003A*K0004      LNCDTP    R               COLHDG('CARD TYPE')
K0004A            LICDTP    R               COLHDG('Card Type')
K0003A                                      REFFLD(SSACCT)
K0003A*K0004      LNCDST    R               COLHDG('CARD STATUS')
K0004A            LICDST    R               COLHDG('Card Status')
K0003A                                      REFFLD(SSACCT)
K0003A*K0004      LNCDSD    R               COLHDG('Card Status Date')
K0004A            LICDSD    R               COLHDG('Card Status Date')
K0003A                                      REFFLD(SSDAT8)
K0004A*K0009      LICSTA    R               COLHDG('Vehicle Status Code')
K0004A*K0009                                REFFLD(SSCOD3)
K0009A            LICSTA    R               COLHDG('Vehicle Status Code')
K0009A                                      REFFLD(SSCOU5)
K0004A            LITERM    R               COLHDG('Rollover Term')
K0004A                                      REFFLD(SSTERM)
K0004A            LITRCD    R               COLHDG('Rollover Term Code')
K0004A                                      REFFLD(SSCOD1)
K0005A            LIBUYI    R               COLHDG('Type of Purchase')
K0005A                                      REFFLD(SSDESP)
K0005A            LIVHRY    R               COLHDG('R.Y. Category')
K0005A                                      REFFLD(SSCOD3)
K0005A            LIVYRM    R               COLHDG('Year of Manufacuring')
K0005A                                      REFFLD(SSCOD4)
K0005A            LIVHCC    R               COLHDG('Engine CC')
K0005A                                      REFFLD(SSCOU4)
K0005A            LIVHGR    R               COLHDG('Auto / Manual')
K0005A                                      REFFLD(SSCOD1)
K0005A            LIVHSR    R               COLHDG('MKT HP Score')
K0005A                                      REFFLD(SSCOU2)
K0005A            LIVBIN    R               COLHDG('Purchase Price')
K0005A                                      REFFLD(SSTU17)
K0005A            LIVHSL    R               COLHDG('Forced Sales Value')
K0005A                                      REFFLD(SSTU17)
K0005A            LIVPRB    R               COLHDG('Red Book Price')
K0005A                                      REFFLD(SSTU17)
K0009A*K0019      LICLOS    R               COLHDG('Vehicle Lost')
K0019A            LICLOS    R               COLHDG('Car Status')
K0009A                                      REFFLD(SSCOD1)
K0020A*K0023      LIVTYP    R               COLHDG('Series of Goods')
K0020A*K0023                                REFFLD(SSCOD5)
K0023A            LISMOG    R               COLHDG('Sub Model')
K0023A                                      REFFLD(SSCOD8)
K0023A*K0026      LIVRM1    R               COLHDG('Remark for Sub Model')
K0026A            LIVRM1    R               COLHDG('Remark for Sub Model' -
K0026A                                      '/ Embossed Name')
K0023A                                      REFFLD(SSTEXT)
K0023A            LIVRM2    R               COLHDG('Remark for Color')
K0023A                                      REFFLD(SSDESS)
     A*************************************************************************
H001 A** HIBAH/CASH REWARD REFUND MASTER FILE (LNIPTW)
     A*************************************************************************
H001 A*
H001 A            LIWACN    R               COLHDG('Account' 'Number')
H001 A                                      REFFLD(SSACCN)
H001 A            LIWATP    R               COLHDG('Account' 'Type')
H001 A                                      REFFLD(SSACCT)
H001 A            LICFRQ    R               COLHDG('Payment' 'Frequency-Cust')
H001 A                                      REFFLD(SSCOU3)
H001 A            LICFRC    R               COLHDG('Payment' 'Freq Code-Cust')
H001 A                                      REFFLD(SSCOD1)
H001 A            LIIFRQ    R               COLHDG('Payment' 'Frequency-Inst')
H001 A                                      REFFLD(SSCOU3)
H001 A            LIIFRC    R               COLHDG('Payment' 'Freq Code-Inst')
H001 A                                      REFFLD(SSCOD1)
H001 A            LICDAY    R               COLHDG('Payment' 'Day of Mo-Cust')
H001 A                                      REFFLD(SSCOU2)
H001 A            LIIDAY    R               COLHDG('Payment' 'Day of Mo-Inst')
H001 A                                      REFFLD(SSCOU2)
H001 A***IN USED  LICRAT    R               COLHDG('Rate' 'Applied-Cust')
H001 A            LICRTE    R               COLHDG('Rate' 'Applied-Cust')
H001 A                                      REFFLD(SSPERD)
H001 A***IN USED  LIIRAT    R               COLHDG('Rate' 'Applied-Inst')
H001 A            LIIRTE    R               COLHDG('Rate' 'Applied-Inst')
H001 A                                      REFFLD(SSPERD)
H001 A****IN USED LICURR    R               COLHDG('Current' 'Amount')
H001 A            LICAMT    R               COLHDG('Current' 'Amount')
H001 A                                      REFFLD(SSAMT4)
H001 A            LIDROP    R               COLHDG('Drop' 'Amount')
H001 A                                      REFFLD(SSAMT4)
H001 A            LIALTD    R               COLHDG('Cumulated' 'Amount')
H001 A                                      REFFLD(SSAMT4)
H001 A            LIPMTC    R               COLHDG('Payment' 'Code')
H001 A                                      REFFLD(SSCOU1)
H001 A            LITRF8    R               COLHDG('Transfer' 'Date')
H001 A                                      REFFLD(SSDAT8)
H001 A            LICACN    R               COLHDG('Transfer' 'Account-Cust')
H001 A                                      REFFLD(SSACCN)
H001 A            LICATP    R               COLHDG('Transfer' 'Account Type')
H001 A                                      REFFLD(SSCOD1)
H001 A            LIIACN    R               COLHDG('Transfer' 'Account-Inst')
H001 A                                      REFFLD(SSACCN)
H001 A            LIIATP    R               COLHDG('Transfer' 'Account Type')
H001 A                                      REFFLD(SSCOD1)
H001 A            LIMTHC    R               COLHDG('Monthly' 'Incentive-Cust')
H001 A                                      REFFLD(SSAMT4)
H001 A            LITOTC    R               COLHDG('Total' 'Incentive-Cust')
H001 A                                      REFFLD(SSAMT4)
H001 A            LIMTHI    R               COLHDG('Monthly' 'Incentive-Inst')
H001 A                                      REFFLD(SSAMT4)
H001 A            LITOTI    R               COLHDG('Total' 'Incentive-Inst')
H001 A                                      REFFLD(SSAMT4)
SS36 A            LIINAM    R               COLHDG('Incentive' 'Fixed Amt')
SS36 A                                      REFFLD(SSAMT4)
SS36 A            LIINTY    R               COLHDG('Incentive' 'Method')
SS36 A                                      REFFLD(SSCOU1)
SS36 A            LINGDY    R               COLHDG('Grace Days')
SS36 A                                      REFFLD(SSCOU3)
SS36 A            LINWCD    R               COLHDG('Grace based' 'on Working' -
SS36 A                                      'day or Calculation')
SS36 A                                      REFFLD(SSCOD1)
     A*************************************************************************
H001 A* LOANS REFUND FOR PROMPT PAYMENT HISTORY FILE
     A*************************************************************************
H001 A* LNIPTH
H001 A            LIHACN    R               COLHDG('Account' 'Number')
H001 A                                      REFFLD(SSACCN)
H001 A            LIHATP    R               COLHDG('Account' 'Type')
H001 A                                      REFFLD(SSACCT)
H001 A            LIHDT8    R               COLHDG('Transaction' 'Date')
H001 A                                      REFFLD(SSDAT8)
H001 A            LIHAMT    R               COLHDG('Transaction' 'Amt')
H001 A                                      REFFLD(SSAMT4)
H001 A            LIHAFT    R               COLHDG('Affects')
H001 A                                      REFFLD(SSCOD1)
H001 A            LIHDOC    R               COLHDG('Debit/Credit')
H001 A                                      REFFLD(SSCOD1)
     A*************************************************************************
H001 A* LNIPTT - INTEREST REFUND FOR HIBAH/CASH REWARD SCHEME
     A*************************************************************************
H001 A            LITPGM    R               COLHDG('Program name')
H011 A                                      REFFLD(SSCODA)
H001 A            LITDAC    R               COLHDG('Debit Account')
H001 A                                      REFFLD(SSACCN)
H001 A            LITDAT    R               COLHDG('Debit Account' 'Type')
H001 A                                      REFFLD(SSACCT)
H001 A            LITCAC    R               COLHDG('Credit Account')
H001 A                                      REFFLD(SSACCN)
H001 A            LITCAT    R               COLHDG('Credit Account' 'Type')
H001 A                                      REFFLD(SSACCT)
H001 A            LITTRN    R               COLHDG('Transaction Code')
H001 A                                      REFFLD(SSTRAN)
H001 A            LITAMT    R               COLHDG('Transaction Amount')
H001 A                                      REFFLD(SSAMT4)
H001 A***IN USED  LITDT6    R               COLHDG('Transaction Date6')
H001 A            LITRN8    R               COLHDG('Transaction Date')
H001 A                                      REFFLD(SSDAT8)
H001 A            LITTIM    R               COLHDG('Transaction Time')
H001 A                                      REFFLD(SSTIM6)
H001 A            LITSEQ    R               COLHDG('Sequence' 'Number')
H001 A                                      REFFLD(SSCOU9)
H001 A            LITSRC    R               COLHDG('Input' 'Source')
H001 A                                      REFFLD(SSCOD1)
H001 A            LITPSC    R               COLHDG('Post/Unposted' 'Code')
H001 A                                      REFFLD(SSCOU1)
     A*************************************************************************
H001 A* LOANS REPOSSESSION FILE (LNREPO)
     A*************************************************************************
H001 A            LRACNO    R               COLHDG('Account' 'Number')
H001 A                                      REFFLD(SSACCN)
H001 A            LRACTP    R               COLHDG('Account' 'Type')
H001 A                                      REFFLD(SSACCT)
H001 A            LRCCID    R               COLHDG('Collateral ID')
H001 A                                      REFFLD(SSDCID)
H001 A            LRRST8    R               COLHDG('Repo Status Date')
H001 A                                      REFFLD(SSDAT8)
H001 A            LRRPD8    R               COLHDG('Date of Repossession')
H001 A                                      REFFLD(SSDAT8)
H001 A            LRSCD8    R               COLHDG('Date of 5th Schedule')
H001 A                                      REFFLD(SSDAT8)
H012 A            LRREX8    R               COLHDG('Date of R.O. Expiry')
H012 A                                      REFFLD(SSDAT8)
H012 A            LRLEGC    R               COLHDG('Legal Fees')
H012 A                                      REFFLD(SSAMT4)
H001 A            LRSRMC    R               COLHDG('Cost of Storage, R&M')
H001 A                                      REFFLD(SSAMT4)
H001 A            LRREPC    R               COLHDG('Cost of Repo')
H001 A                                      REFFLD(SSAMT4)
H001 A            LRRDM8    R               COLHDG('Date of Redeemed')
H001 A                                      REFFLD(SSDAT8)
H001 A            LRRID8    R               COLHDG('Last Date To' -
H001 A                                      'Reinstate')
H001 A                                      REFFLD(SSDAT8)
H001 A            LRDLYC    R               COLHDG('Cost of Re-delivery')
H001 A                                      REFFLD(SSAMT4)
H001 A            LRESVC    R               COLHDG('Estimate Sales Value')
H001 A                                      REFFLD(SSAMT4)
H001 A            LROTHG    R               COLHDG('Other Charges')
H001 A                                      REFFLD(SSAMT4)
H001 A            LRRDMP    R               COLHDG('Redemption Amount')
H001 A                                      REFFLD(SSAMT4)
H001 A            LRGWVR    R               COLHDG('Guarantor Waiver' -
H001 A                                      'Rights (Y/N)')
H001 A                                      REFFLD(SSYON)
H001 A            LRRMK1    R               COLHDG('Remark 1')
H001 A                                      REFFLD(SSDESC)
H001 A            LRRMK2    R               COLHDG('Remark 2')
H001 A                                      REFFLD(SSDESC)
H012 A            LRRMK3    R               COLHDG('Remark 3')
H012 A                                      REFFLD(SSDESC)
H012 A            LRCOND    R               COLHDG('Conditions of Goods')
H012 A                                      REFFLD(SSDESC)
H012 A            LRLOCT    R               COLHDG('Location of Repo'  +
                                            'Goods')
H012 A                                      REFFLD(SSDESC)
H012 A            LRVAMT    R               COLHDG('Valuation Amount')
H012 A                                      REFFLD(SSAMT4)
H012 A            LRVLBY    R               COLHDG('Valuation By')
H012 A                                      REFFLD(SSDESS)
H012 A            LRREPN    R               COLHDG('No. of R.O. Issued')
H012 A                                      REFFLD(SSCOU3)
H012 A            LRACDF    R               COLHDG('Accident Car (Y/N)')
H012 A                                      REFFLD(SSYON)
H012 A            LRAUTF    R               COLHDG('Automatic Car (Y/N)')
H012 A                                      REFFLD(SSYON)
H012 A            LRKEYA    R               COLHDG('Key Available (Y/N)')
H012 A                                      REFFLD(SSYON)
A011 A            LR5SRB    R               COLHDG('5th Schd Rebate')
A011 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A***  Fees post file - LNPOSM
     A*************************************************************************
     A*** VALUES - N = Normal loan
     A***          P = Participation
     A***          C = Partial charge off
     A***          8 = Full charge off
     A            LMCTYP    R               COLHDG('Misc or' 'Other charges')
     A                                      REFFLD(SSCOD1)
     A            LMCCOD    R               COLHDG('charge' 'type code')
     A                                      REFFLD(SSCOD2)
     A            LM001     R               COLHDG('Beginning' 'Charges')
     A                                      REFFLD(SSAMT5)
     A            LM002     R               COLHDG('Charges' 'Debit')
     A                                      REFFLD(SSAMT5)
     A            LM003     R               COLHDG('Charges' 'Reversals')
     A                                      REFFLD(SSAMT5)
     A            LM004     R               COLHDG('Charges' 'Payments')
     A                                      REFFLD(SSAMT5)
     A            LM005     R               COLHDG('Charges' 'Credit')
     A                                      REFFLD(SSAMT5)
     A            LM006     R               COLHDG('Ending' 'Charges')
     A                                      REFFLD(SSAMT5)
M001 A            LM007     R               COLHDG('Charges' 'Unposted Debit')
M001 A                                      REFFLD(SSAMT5)
M001 A            LM008     R               COLHDG('Charges' 'Unposted Credit')
M001 A                                      REFFLD(SSAMT5)
AM03 A            LM009     R               COLHDG('Charges' 'Suspense Debit')
AM03 A                                      REFFLD(SSAMT5)
AM03 A            LM010     R               COLHDG('Charges' 'Suspense Credit')
AM03 A                                      REFFLD(SSAMT5)
AM03 A            LM011     R               COLHDG('Charges' 'Suspense Opening')
AM03 A                                      REFFLD(SSAMT5)
AM03 A            LM012     R               COLHDG('Charges' 'Earned Today')
AM03 A                                      REFFLD(SSAMT5)
AM03 A            LM013     R               COLHDG('Charges' 'Suspense Closing')
AM03 A                                      REFFLD(SSAMT5)
AM31 A            LM014     R               COLHDG('Chg Susp' 'Trf DR New GL')
AM31 A                                      REFFLD(SSAMT5)
AM31 A            LM015     R               COLHDG('Chg Susp' 'Trf CR Old GL')
AM31 A                                      REFFLD(SSAMT5)
AM31 A            LM016     R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSAMT5)
AM31 A            LM017     R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSAMT5)
AM31 A            LM018     R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSAMT5)
AM31 A            LM019     R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSAMT5)
AM31 A            LM020     R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSAMT5)
     A            LM001N    R               COLHDG('Beginning' 'Charges')
     A                                      REFFLD(SSCOU5)
     A            LM002N    R               COLHDG('Charges' 'Debit')
     A                                      REFFLD(SSCOU5)
     A            LM003N    R               COLHDG('Charges' 'Reversals')
     A                                      REFFLD(SSCOU5)
     A            LM004N    R               COLHDG('Charges' 'Payments')
     A                                      REFFLD(SSCOU5)
     A            LM005N    R               COLHDG('Charges' 'Credit')
     A                                      REFFLD(SSCOU5)
     A            LM006N    R               COLHDG('Ending' 'Charges')
     A                                      REFFLD(SSCOU5)
M001 A            LM007N    R               COLHDG('Charges' 'Unposted Debit')
M001 A                                      REFFLD(SSCOU5)
M001 A            LM008N    R               COLHDG('Charges' 'Unposted Credit')
M001 A                                      REFFLD(SSCOU5)
AM03 A            LM009N    R               COLHDG('Charges' 'Suspense Debit')
AM03 A                                      REFFLD(SSCOU5)
AM03 A            LM010N    R               COLHDG('Charges' 'Suspense Credit')
AM03 A                                      REFFLD(SSCOU5)
AM03 A            LM011N    R               COLHDG('Charges' 'Suspense Opening')
AM03 A                                      REFFLD(SSCOU5)
AM03 A            LM012N    R               COLHDG('Charges' 'Earned Today')
AM03 A                                      REFFLD(SSCOU5)
AM03 A            LM013N    R               COLHDG('Charges' 'Suspense Closing')
AM03 A                                      REFFLD(SSCOU5)
AM31 A            LM014N    R               COLHDG('Chg Susp' 'Trf DR New GL')
AM31 A                                      REFFLD(SSCOU5)
AM31 A            LM015N    R               COLHDG('Chg Susp' 'Trf CR Old GL')
AM31 A                                      REFFLD(SSCOU5)
AM31 A            LM016N    R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSCOU5)
AM31 A            LM017N    R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSCOU5)
AM31 A            LM018N    R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSCOU5)
AM31 A            LM019N    R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSCOU5)
AM31 A            LM020N    R               COLHDG('Not Used')
AM31 A                                      REFFLD(SSCOU5)
     A*************************************************************************
     A** BILL OF EXCHANGE PRINTING FILE (LNPBIL) (LNBPRT)
     A*************************************************************************
     A            LPACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LPACTY    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LPSEQ     R               COLHDG('Sequence')
     A                                      REFFLD(SSCOU3)
     A            LPBRN     R               COLHDG('Branch' 'Number')
     A                                      REFFLD(SSBRAN)
     A            LPRBRN    R               COLHDG('Reporting' 'Branch')
     A                                      REFFLD(SSBRAN)
     A            LPBSRN    R               COLHDG('Bill Cert.' 'Serial No.')
     A                                      REFFLD(SSCOUB)
     A            LPPICT    R               COLHDG('Type of' 'Exchange')
     A                                      REFFLD(SSCOD1)
     A* P=P/N
     A* B=B/E
     A            LPISS8    R               COLHDG('Issue' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LPPRTC    R               COLHDG('Printing' 'Status')
     A                                      REFFLD(SSCOD1)
     A*' '=Pending for print
     A*  C=Cancelled
     A*  Y=Printed
     A*  R=Reprint
     A            LPPAMT    R               COLHDG('Amount')
     A                                      REFFLD(SSAMT4)
     A            LPAYN1       100          COLHDG('Payer Name 1')
     A            LPAYN2       100          COLHDG('Payer Name 2')
     A            LPMAT8    R               COLHDG('Maturity' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LPLGID    R               COLHDG('Language' 'identifier')
     A                                      REFFLD(SSCOD3)
     A            LPMUID    R               COLHDG('User ID')
     A                                      REFFLD(SSCODA)
     A            LPMWID    R               COLHDG('Workstation ID')
     A                                      REFFLD(SSCODA)
     A            LPMTIM    R               COLHDG('Time' 'change' 'made')
     A                                      REFFLD(SSTIME)
     A*************************************************************************
V001 A* SUBJECTIVE ANALYSIS FILE - LNSUBC
     A*************************************************************************
M001 A            LSCRID    R               COLHDG('Record Identifier')
M001 A                                      REFFLD(SSCOD1)
V001 A            LSCACN    R               COLHDG('Account' 'number')
V001 A                                      REFFLD(SSACCN)
V001 A            LSCATY    R               COLHDG('Account' 'Type')
V001 A                                      REFFLD(SSACCT)
V001 A            LSCMSQ    R               COLHDG('Msg Seq' 'Number')
V001 A                                      REFFLD(SSCOU3)
V001 A            LSCSSQ    R               COLHDG('Sorting' 'Seq No')
V001 A                                      REFFLD(SSCOU4)
V001 A            LSCANL    R               COLHDG('Analysis')
V001 A                                      REFFLD(SSMSGC)
     A*************************************************************************
     A* SOURCE OF FUND FILE - LNEXSF
     A*************************************************************************
     A            LEACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LEATYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LESRCF    R               COLHDG('Source' 'of' 'Fund')
     A                                      REFFLD(SSCOD5)
SS09 A            LESFSQ    R               COLHDG('Fund Sequence')
SS09 A                                      REFFLD(SSCOU3)
     A            LETYPF    R               COLHDG('Detail Type' 'of' 'Fund')
     A                                      REFFLD(SSCOD3)
     A            LECACC    R               COLHDG('Collection' 'Acct' 'Number')
     A                                      REFFLD(SSACCN)
     A            LECATP    R               COLHDG('Collection' 'Acct' 'Type')
     A                                      REFFLD(SSACCT)
     A            LERATE    R               COLHDG('Interest' 'Rate')
     A                                      REFFLD(SSPERD)
     A            LEREFN    R               COLHDG('Reference' 'Number')
     A                                      REFFLD(SSDESS)
     A            LEFPOR    R               COLHDG('External' 'Fund' 'Portion')
     A                                      REFFLD(SSPERD)
R1015A            LEEFD8    R               COLHDG('Effective Date')
R1015A                                      REFFLD(SSDAT8)
M016 A            LEEXD8    R               COLHDG('Expiry Date')
M016 A                                      REFFLD(SSDAT8)
SS09 A            LEFPCT    R               COLHDG('Fund Percentage')
SS09 A                                      REFFLD(SSPERD)
SS09 A            LEFPID    R               COLHDG('Pool Id')
SS09 A                                      REFFLD(SSCOD3)
R1002A            LEGLAC    R               COLHDG('GL Group' 'Code')
R1002A                                      REFFLD(SSGRUP)
     A*************************************************************************
     A* LNEXSH - Ext. Source of Fund Payment Received History
     A*************************************************************************
     A            LEHACC    R               COLHDG('Financing' 'Acct' 'Number')
     A                                      REFFLD(SSACCN)
     A            LEHATP    R               COLHDG('Financing' 'Acct' 'Type')
     A                                      REFFLD(SSACCT)
     A            LEHPFT    R               COLHDG('Profit')
     A                                      REFFLD(SSAMT4)
     A            LEHPRN    R               COLHDG('Principal')
     A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A* CAGAMAS Initial selection file (LNCAGI)
     A* CAGAMAS Confirmation file (LNCAGA)
     A*************************************************************************
     A            LCBRN     R               COLHDG('Branch' 'Number')
     A                                      REFFLD(SSBRAN)
     A            LCACCN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LCSNME    R               COLHDG('Short' 'Name')
     A                                      REFFLD(SSNAMS)
     A            LCCIFN    R               COLHDG('CIF' 'Number')
     A                                      REFFLD(SSCIFN)
     A            LCPTYP    R               COLHDG('Loan' 'Type')
     A                                      REFFLD(SSPROD)
     A            LCCUR     R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A            LCORG     R               COLHDG('Original' 'Balance')
     A                                      REFFLD(SSAMT4)
     A            LCCBAL    R               COLHDG('Current' 'Balance')
     A                                      REFFLD(SSAMT4)
     A            LCCOST    R               COLHDG('Cost' 'Outstanding')
     A                                      REFFLD(SSAMT4)
     A            LCSTS     R               COLHDG('Status')
     A                                      REFFLD(SSACCS)
     A            LCPURN    R               COLHDG('Purchase' 'Contract No.')
     A                                      REFFLD(SSBACC)
     A            LCPURV    R               COLHDG('Purchase Value')
     A                                      REFFLD(SSAMT4)
     A            LCPURR    R               COLHDG('Purchase' 'CONTRACT RATE')
     A                                      REFFLD(SSPERD)
     A            LC1RD8    R               COLHDG('1st Release' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LCFLD8    R               COLHDG('Full Rel.' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LCMDT8    R               COLHDG('Maturity' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LCNPD8    R               COLHDG('Next Pymt' 'Due Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
SS06 A* COLLECTIONS MASTER FILE - LNXMST
     A*************************************************************************
SS06 A* COLLECTIONS LETTER FILE - LNXLET
SS06 A*   MIRROR OF LNXMST AFTER LNPUE UPDATE-LETTERS DUE TO BE PRINTED
SS06 A* COLLECTIONS WORKED FILE - LNXWKD
SS06 A*   INCLUDES FIELDS OF LNXMST BEFORE LNPUE UPDATE
SS06 A*    PLUS - FOR REPORTING
     A*****************************************************************
SS06 A* COLLECTIONS MANUAL ADDITION FILE - LNXMAN
     A*****************************************************************
SS06 A* COLLECTIONS MESSAGE FILE - LNXMSG
     A*****************************************************************
SS06 A* PURGED COLLECTIONS MESSAGE FILE - LNXMSP
SS06 A*  IDENTICAL TO LNXMSG
     A*****************************************************************
SS06 A* COLLECTION STSTUS FILE (LNXSTS)
     A*****************************************************************
SS06 A* LOAN COLLECTION OFFICER DATA - LNXOFF
     A*************************************************************************
     A* LOAN SERVICING
     A*************************************************************************
     A            POOL      R               COLHDG('Pool' 'Number')
     A                                      REFFLD(SSCODF)
     A            INVACT    R               COLHDG('Investor' 'Loan Number')
     A                                      REFFLD(SSACCN)
     A            RATSLD    R               COLHDG('Rate' 'Sold at')
     A                                      REFFLD(SSPERD)
     A            PCTSLD    R               COLHDG('Percent' 'Sold')
     A                                      REFFLD(SSPERD)
     A            SERFEE    R               COLHDG('Service' 'Fee')
     A                                      REFFLD(SSAMT1)
     A            RATDIF    R               COLHDG('Int Rate' 'Differential')
     A                                      REFFLD(SSPERD)
     A*************************************************************************
     A** LOAN SERVICING MASTER - LNSERV
     A*************************************************************************
     A            LSBRN     R               COLHDG('Branch' 'Number')
     A                                      REFFLD(SSBRAN)
     A            LSRBRN    R               COLHDG('Reporting' 'Branch')
     A                                      REFFLD(SSBRAN)
     A            LSLMD8    R               COLHDG('Last Maint' 'Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
V001 A* RATE BASED ON AVERAGE OF BANKS FILE - LNAVGB
     A*************************************************************************
M004 A            LVGRID    R               COLHDG('Record Identifier')
M004 A                                      REFFLD(SSCOD1)
V001 A            LVGACC    R               COLHDG('Account number')
     A                                      REFFLD(SSACCN)
V001 A            LVGACT    R               COLHDG('Account Type')
     A                                      REFFLD(SSACCT)
V001 A            LVGBNK    R               COLHDG('Bank' 'Number')
     A                                      REFFLD(SSBANK)
AM24 A            LVGBRN    R               COLHDG('Branch' 'Number')
AM24 A                                      REFFLD(SSBRAN)
V001 A            LVGRTN    R               COLHDG('Rate number')
     A                                      REFFLD(SSRATE)
AM24 A            LVGDLR    R               COLHDG('Dealer' 'Rate')
AM24 A                                      REFFLD(SSPERD)
V001 A            LVGCUR    R               COLHDG('Currency')
     A                                      REFFLD(SSCURC)
V002 A*AM24       LVGSEQ    R               COLHDG('Account' 'Currency Seq')
AM24 A            LVGSEQ    R               COLHDG('Sequence No')
     A                                      REFFLD(SSASEQ)
V001 A            LVGRDM    R               COLHDG('Rounding' 'Method')
     A                                      REFFLD(SSCOD1)
AM24 A            LVGRMK    R               COLHDG('Remark')
AM24 A                                      REFFLD(SSDESM)
     A*************************************************************************
V001 A* CPF MASTER FILE - LNCPFM
     A*************************************************************************
V001 A            CPACCT    R               COLHDG('LN  Account number')
     A                                      REFFLD(SSACCN)
V001 A            CPATYP    R               COLHDG('CPF account type')
     A                                      REFFLD(SSACCT)
V001 A            CPFNO     R               COLHDG('CPF number')
     A                                      REFFLD(SSACGC)
V001 A            CPARPS    R               COLHDG('CPF ARPS number')
     A                                      REFFLD(SSACGC)
V001 A            CPFREQ    R               COLHDG('CPF payment' 'frequency')
     A                                      REFFLD(SSCOU3)
V001 A            CPFRCD    R               COLHDG('CPF payment' 'freq code')
     A                                      REFFLD(SSCOD1)
V001 A            CPPAMT    R               COLHDG('CPF payment amount')
     A                                      REFFLD(SSAMT4)
V001 A            CPLIMT    R               COLHDG('CPF Limit')
     A                                      REFFLD(SSAMT4)
V001 A            CPLEGF    R               COLHDG('CPF Legal' 'Fee')
     A                                      REFFLD(SSAMT4)
V001 A            CPCASH    R               COLHDG('CPF Paid By Cash')
     A                                      REFFLD(SSAMT4)
V001 A            CPOBAL    R               COLHDG('CPF O/S Balance')
     A                                      REFFLD(SSAMT4)
V001 A            CPARLD    R               COLHDG('CPF Arrears LTD')
     A                                      REFFLD(SSAMT4)
V001 A            CPTOPA    R               COLHDG('CPF Top up Amt')
     A                                      REFFLD(SSAMT4)
V001 A            CPYTDA    R               COLHDG('CPF YTD Payment')
     A                                      REFFLD(SSAMT4)
V001 A            CPLTDA    R               COLHDG('CPF LTD Payment')
     A                                      REFFLD(SSAMT4)
V001 A            CPYTDC    R               COLHDG('CPF YTD' 'cash payment')
     A                                      REFFLD(SSAMT4)
V001 A            CPLTDC    R               COLHDG('CPF LTD' 'cash payment')
     A                                      REFFLD(SSAMT4)
V001 A            CPLUMP    R               COLHDG('CPF Lump Sum payment')
     A                                      REFFLD(SSAMT4)
V001 A            CPFPD8    R               COLHDG('CPF 1st Pymt' 'Due Date')
     A                                      REFFLD(SSDAT8)
V001 A            CPNPD8    R               COLHDG('CPF Next Pymt' 'Due Date')
     A                                      REFFLD(SSDAT8)
V001 A            CPNPDY    R               COLHDG('CPF Next Pymt' 'Due days')
     A                                      REFFLD(SSDAT2)
V001 A            CPNSD8    R               COLHDG('CPF Next Sch.' 'Due Date')
     A                                      REFFLD(SSDAT8)
V001 A            CPLPD8    R               COLHDG('CPF Last Payment' 'Date')
     A                                      REFFLD(SSDAT8)
V001 A            CPEXP8    R               COLHDG('CPF Expiry date')
     A                                      REFFLD(SSDAT8)
V001 A            CPLMD8    R               COLHDG('CPF Last Maint.' 'Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
V001 A* CPF BILL FILE - LNCPFB
     A*************************************************************************
V001 A            CBACCT    R               COLHDG('CPF Account number')
V001 A                                      REFFLD(SSACCN)
V001 A            CBATYP    R               COLHDG('CPF account type')
V001 A                                      REFFLD(SSACCT)
V001 A            CBDUD8    R               COLHDG('CPF Pymt' 'Due Date')
V001 A                                      REFFLD(SSDAT8)
V001 A            CBPAMT    R               COLHDG('CPF payment amount')
V001 A                                      REFFLD(SSAMT4)
V001 A            CBCPFP    R               COLHDG('CPF pymt made' 'by CPF')
V001 A                                      REFFLD(SSAMT4)
V001 A            CBCSHP    R               COLHDG('CPF pymt made' 'by cash')
V001 A                                      REFFLD(SSAMT4)
V001 A            CBAMTO    R               COLHDG('CPF bill' 'outstanding amt')
V001 A                                      REFFLD(SSAMT4)
V001 A            CBCPFO    R               COLHDG('CPF pymt' 'outstanding amt')
V001 A                                      REFFLD(SSAMT4)
V001 A            CBLMD8    R               COLHDG('CPF Last Maint.' 'Date')
V001 A                                      REFFLD(SSDAT8)
     A*************************************************************************
V001 A* TIERED PREPAYMENT FEE - LNPFEE
     A*************************************************************************
M044 A            LPFRID    R               COLHDG('Record' 'Identifier')
M044 A                                      REFFLD(SSCOD1)
V001 A            LPFACC    R               COLHDG('Acct No.')
V001 A                                      REFFLD(SSACCN)
V001 A            LPFACT    R               COLHDG('Acct type')
V001 A                                      REFFLD(SSACCT)
V001 A            LPFSEQ    R               COLHDG('Seq No.')
V001 A                                      REFFLD(SSCOU3)
M001 A            LPFAMT    R               COLHDG('Amount')
M001 A                                      REFFLD(SSAMT4)
V001 A            LPFROM    R               COLHDG('Term(Fr)')
V001 A                                      REFFLD(SSCOU3)
V001 A            LPFTO     R               COLHDG('Term(To)')
V001 A                                      REFFLD(SSCOU3)
V001 A            LPFTMC    R               COLHDG('Term' 'Code')
V001 A                                      REFFLD(SSCOD1)
V001 A            LPFRAT    R               COLHDG('Rate')
V001 A                                      REFFLD(SSPERD)
V001 A            LPFEX8    R               COLHDG('Expiry' 'Date')
V001 A                                      REFFLD(SSDAT8)
     A*************************************************************************
V001 A* GIRO MASTER FILE  - LNGIRO
     A*************************************************************************
V001 A            LGACCT    R               COLHDG('Account number')
V001 A                                      REFFLD(SSACCN)
V001 A            LGATYP    R               COLHDG('Account type')
V001 A                                      REFFLD(SSACCT)
V001 A            LGGACN    R               COLHDG('GIRO' 'Account number')
V001 A                                      REFFLD(SSACCN)
V001 A            LGTYPE    R               COLHDG('GIRO account type')
V001 A                                      REFFLD(SSACCT)
V001 A            LGFAMT    R               COLHDG('GIRO' 'Fixed Amount')
V001 A                                      REFFLD(SSAMT4)
V001 A            LGEPD8    R               COLHDG('GIRO' 'Expiry Date')
V001 A                                      REFFLD(SSDAT8)
     A*************************************************************************
HLB  A** Dealer limit by loan type - LNDLTY
     A*************************************************************************
H001 A            LPDLNO    R               COLHDG('Dealer' 'Number')
H001 A****                                  REFFLD(SSCOU7)
H001 A*R1002                                REFFLD(SSCODA)
R1002A                                      REFFLD(SSCODA)
H001 A            LPTYPE    R               COLHDG('Loan' 'Type')
H001 A                                      REFFLD(SSPROD)
H001 A            LPCURR    R               COLHDG('Currency' 'Type')
H001 A                                      REFFLD(SSCURC)
H001 A            LPLIMT    R               COLHDG('Dealer limit')
H001 A                                      REFFLD(SSAMT4)
H001 A            LPUAMT    R               COLHDG('Dealer' 'Amount' 'Utilised')
H001 A                                      REFFLD(SSAMT4)
H001 A*** APF - to denote as Approved Pending Funding/Disbursement loan
H001 A            LPAAMT    R               COLHDG('Dealer Limit APF')
H001 A                                      REFFLD(SSAMT4)
H001 A            LPUFBR    R               COLHDG('Undertaking' 'limit (FBR)')
H001 A                                      REFFLD(SSAMT4)
H001 A            LPFBR     R               COLHDG('Utilised Amount' ' - FBR')
H001 A                                      REFFLD(SSAMT4)
H001 A            LPAFBR    R               COLHDG('Approved Not Funded' '-FBR')
H001 A                                      REFFLD(SSAMT4)
H001 A            LPUFBT    R               COLHDG('Undertaking' 'limit (FBT)')
H001 A                                      REFFLD(SSAMT4)
H001 A            LPFBT     R               COLHDG('Utilised Amount' ' - FBT')
H001 A                                      REFFLD(SSAMT4)
H001 A            LPAFBT    R               COLHDG('Approved Not Funded' '-FBT')
H001 A                                      REFFLD(SSAMT4)
     A*************************************************************************
HLB  A* Leasing loan processing information - LNLEAS
     A*************************************************************************
     A            LLEANO    R               COLHDG('Application No.')
     A                                      REFFLD(SSACCN)
     A*SS99       LLEFCD    R               COLHDG('Facility' 'Code')
SS01 A*SS99                                 REFFLD(SSCODA)
     A*SS99       LLESEQ    R               COLHDG('Facility' 'Seq.')
SS01 A*SS99                                 REFFLD(SSASEQ)
     A            LLEACN    R               COLHDG('Acct No.')
     A                                      REFFLD(SSACCN)
     A            LLEACT    R               COLHDG('Acct type')
     A                                      REFFLD(SSACCT)
     A            LLENPR    R               COLHDG('Prepaid' 'Rental #')
     A                                      REFFLD(SSCOU3)
     A            LLEPR     R               COLHDG('Prepaid Rental')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LLENAR    R               COLHDG('Advance' 'Rental #')
     A                                      REFFLD(SSCOU3)
     A            LLEAR     R               COLHDG('Advance Rental')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LLESED    R               COLHDG('Security Deposit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LLESDR    R               COLHDG('Security' 'Deposit Rate')
     A                                      REFFLD(SSPERD)
     A            LLEDBR    R               COLHDG('Disbursement' 'Rate')
     A                                      REFFLD(SSPERD)
     A            LLESLP    R               COLHDG('Secondary' 'Lease Period')
     A                                      REFFLD(SSCOU3)
     A            LLESLC    R               COLHDG('Secondary' 'Lease Code')
     A                                      REFFLD(SSCOD1)
     A            LLESLR    R               COLHDG('Secondary' 'Lease Rate')
     A                                      REFFLD(SSPERD)
     A            LLESFQ    R               COLHDG('Sec Lease' 'Paym Freq')
     A                                      REFFLD(SSTERM)
     A            LLESFC    R               COLHDG('Sec Lease' 'Paym Freq Code')
     A                                      REFFLD(SSCOD1)
     A            LLESL8    R               COLHDG('Sec Lease' 'Maturity Date')
     A                                      REFFLD(SSDAT8)
     A            LLEBBV    R               COLHDG('Buy Back Value')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LLEGRV    R               COLHDG('Residual Value')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LLERB     R               COLHDG('Rental Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LLECLC    R               COLHDG('Collateral Cost')
     A                                      REFFLD(SSAMT4)
     A            LLELQD    R               COLHDG('Liquidated' 'Damages')
     A                                      REFFLD(SSCOD1)
     A            LLELGI    R               COLHDG('LPI on GRV')
     A                                      REFFLD(SSCOD1)
     A            LLETXI    R               COLHDG('Tax' 'Indemity')
     A                                      REFFLD(SSCOD1)
     A            LLETXA    R               COLHDG('Tax Add-on Value')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LLEBLC    R               COLHDG('Balancing Charge')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LLELD     R               COLHDG('Liquidated' 'Damages')
     A                                      REFFLD(SSAMTG)
     A            LLELGV    R               COLHDG('Late Charge' 'on GRV')
     A                                      REFFLD(SSAMTG)
     A            LLECL     R               COLHDG('Credit Line' 'Indicator')
     A                                      REFFLD(SSCOD1)
     A            LLERPS    R               COLHDG('Pymt Advice or Ratif' 'Indi-
     A                                      cator')
     A                                      REFFLD(SSCOD1)
     A            LLEPCD    R               COLHDG('Package' 'Code')
     A                                      REFFLD(SSCOU3)
     A            LLEMAP    R               COLHDG('Merged' 'Appl No,')
     A                                      REFFLD(SSACCN)
     A            LLEMFC    R               COLHDG('Merged' 'Fac Code')
     A                                      REFFLD(SSCOD3)
     A            LLEMFS    R               COLHDG('Merged' 'Fac Seq.')
     A                                      REFFLD(SSACCN)
     A            LLEMAG    R               COLHDG('Master Agreement' 'Indicato-
     A                                      r')
     A                                      REFFLD(SSCOD1)
     A            LLEMD8    R               COLHDG('Maintenance Date')
     A                                      REFFLD(SSDAT8)
     A            LLEPRF    R               COLHDG('Profit')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            LLEDWP    R               COLHDG('Down Payment')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A*************************************************************************
HLB  A* Principal repayment schedule - LNPRSC
     A*************************************************************************
M001 A            LPRRID    R               COLHDG('Record Identifier')
M001 A                                      REFFLD(SSCOD1)
     A            LPRACN    R               COLHDG('Acct No.')
     A                                      REFFLD(SSACCN)
     A            LPRACT    R               COLHDG('Acct type')
     A                                      REFFLD(SSACCT)
HLB  A*           LPRSEQ    R               COLHDG('Sequence Number')
HLB  A*                                     REFFLD(SSCOU9)
     A            LPRAMT    R               COLHDG('Principal Amount')
     A                                      REFFLD(SSAMT4)
     A            LPRPD     R               COLHDG('Principal paid')
     A                                      REFFLD(SSAMT4)
     A*           LPDFRM    R               COLHDG('Due from' '1st Rel/Ful rel')
     A*                                     REFFLD(SSCOD1)
     A*           LPPDTM    R               COLHDG('Prin due' 'term')
     A*                                     REFFLD(SSTERM)
     A*           LPPDTC    R               COLHDG('Prin due' 'term code')
     A*                                     REFFLD(SSCOD1)
     A            LPREF8    R               COLHDG('Effective Date')
     A                                      REFFLD(SSDAT8)
     A            LPRROL    R               COLHDG('Rollover ?')
     A                                      REFFLD(SSCOD1)
     A            LPRRTM    R               COLHDG('Rollover' 'term')
     A                                      REFFLD(SSTERM)
     A            LPRRCD    R               COLHDG('Rollover' 'term code')
     A                                      REFFLD(SSCOD1)
     A            LPRDAY    R               COLHDG('Rollover' 'Day')
     A                                      REFFLD(SSDAT2)
     A*************************************************************************
HLB  A* Fees waived to be charged is early settle - LNWFEE
     A*************************************************************************
     A            LWFACN    R               COLHDG('Acct No.')
     A                                      REFFLD(SSACCN)
     A            LWFACT    R               COLHDG('Acct type')
     A                                      REFFLD(SSACCT)
     A            LWFAMT    R               COLHDG('Fee amount')
     A                                      REFFLD(SSAMT4)
     A            LWFMO     R               COLHDG('Misc Or Othchg')
     A                                      REFFLD(SSCOD1)
     A            LWFTYP    R               COLHDG('Charge type')
     A                                      REFFLD(SSCOD2)
     A            LWFESP    R               COLHDG('Chrg back' 'period')
     A                                      REFFLD(SSCOU3)
     A            LWFESC    R               COLHDG('Chrg back' 'period code')
     A                                      REFFLD(SSCOD1)
H001 A*           LWFREP    R               COLHDG('Free' 'period')
H001 A*                                     REFFLD(SSCOU3)
     A            LWFEX8    R               COLHDG('Expiry Date')
     A                                      REFFLD(SSDAT8)
     A            LWFDT8    R               COLHDG('Last' 'Maint Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
HLB  A* Type of insurance parameter file - LNPINS
     A*************************************************************************
     A            LPICOD    R               COLHDG('Type of Ins' 'Code')
     A                                      REFFLD(SSCOU3)
     A            LPIDES    R               COLHDG('Description')
     A                                      REFFLD(SSNAML)
     A            LPIINS    R               COLHDG('Rebate by Ins')
     A                                      REFFLD(SSPERD)
     A            LPIBOR    R               COLHDG('Rebate to Borrower')
     A                                      REFFLD(SSPERD)
     **
     A*************************************************************************
HLB  A* S & P Schd - LNHSPS
     A*************************************************************************
     A            LNHACN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LNHATY    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LNHSNN    R               COLHDG('Sequence' 'No.')
     A                                      REFFLD(SSCOU2)
     A            LNHDDE    R               COLHDG('Disbursement' 'Desc')
     A*H001EY                               REFFLD(SSDESS)
H001 A                                      REFFLD(SSDESA)
     A            LNHPDI    R               COLHDG('% of Disbursement')
     A                                      REFFLD(SSPERD)
     A            LNHSDA    R               COLHDG('Schd Disb' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LNHADA    R               COLHDG('Actual Disb' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LNHCDA    R               COLHDG('Current Disb' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LNHDD8    R               COLHDG('Draw Down' 'Date')
     A                                      REFFLD(SSDAT8)
A001 A            LNHAVA    R               COLHDG('Remaining Disb Amt')
A001 A                                      REFFLD(SSAMT4)
     A*************************************************************************
HLB  A* HDA Parameter - LNHHDA
     A*************************************************************************
     A            LNHSNO    R               COLHDG('Sequence' 'No.')
     A                                      REFFLD(SSCOU2)
     A            LNHDD     R               COLHDG('Disbursement' 'Desc')
     A                                      REFFLD(SSDESA)
     A            LNHPD     R               COLHDG('% of Disbursement')
     A                                      REFFLD(SSPERD)
     A*************************************************************************
HLB  A* Loan Limit Schedule - LNLMSC
     A*************************************************************************
     A            LLSACN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LLSACT    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LLSLMT    R               COLHDG('Loan' 'Limit')
     A                                      REFFLD(SSAMT4)
     A*           LLSTRM    R               COLHDG('Limit Due' 'Term')
     A*                                     REFFLD(SSCOU3)
     A*           LLSTCD    R               COLHDG('Limit Due' 'Term Code')
     A*                                     REFFLD(SSCOD1)
     A            LLSEF8    R               COLHDG('Effective' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LLSMN8    R               COLHDG('Last' 'Maint Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
HLB  A* Floor Stock BE No. File - LNFSBE
     A*************************************************************************
     A            LNFACN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LNFSEQ    R               COLHDG('Sequence' 'Number')
     A                                      REFFLD(SSCOU3)
     A            LNFBEN    R               COLHDG('BE' 'Number')
     A                                      REFFLD(SSCODF)
     A            LNFSTS    R               COLHDG('Status')
     A                                      REFFLD(SSACCS)
     A            LNFBD8    R               COLHDG('BE Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
HLB  A** LOAN SUPPLIER MASTER FILE - LNSUPM
     A*************************************************************************
     A*SS32       LNSPID    R               COLHDG('Supplier' 'id')
     A*SS32                                 REFFLD(SSCODA)
     A*SS32       LNSNAM    R               COLHDG('Supplier' 'Name')
     A*SS32                                 REFFLD(SSNAML)
     A*SS32       LNSAD1    R               COLHDG('Supplier' 'Address Line 1')
     A*SS32                                 REFFLD(SSNAML)
     A*SS32       LNSAD2    R               COLHDG('Supplier' 'Address Line 2')
     A*SS32                                 REFFLD(SSNAML)
     A*SS32       LNSAD3    R               COLHDG('Supplier' 'Address Line 3')
     A*SS32                                 REFFLD(SSNAML)
     A*SS32       LNSAD4    R               COLHDG('Supplier' 'Address Line 1')
     A*SS32                                 REFFLD(SSNAML)
     A*SS32       LNSAD5    R               COLHDG('Supplier' 'Address Line 2')
     A*SS32                                 REFFLD(SSNAML)
     A*SS32       LNSAD6    R               COLHDG('Supplier' 'City State Zip')
     A*SS32                                 REFFLD(SSNAML)
     A*SS32       LNSCIT    R               COLHDG('Supplier' 'City')
     A*SS32                                 REFFLD(SSNAMS)
     A*SS32       LNSSTA    R               COLHDG('Supplier' 'State')
     A*SS32                                 REFFLD(SSSTA3)
     A*SS32       LNSZIP    R               COLHDG('Supplier' 'Postal code')
     A*SS32                                 REFFLD(SSPOS9)
     A*SS32       LNSCOU    R               COLHDG('Supplier' 'Country')
     A*SS32                                 REFFLD(SSSTA3)
     A*SS32       LNSFON    R               COLHDG('Supplier' 'Phone')
     A*SS32                                 REFFLD(SSTELE)
     A*SS32       LNSFO2    R               COLHDG('Supplier' 'Phone 2')
     A*SS32                                 REFFLD(SSTELE)
     A*SS32       LNSSTS    R               COLHDG('Status code')
     A*SS32                                 REFFLD(SSCODA)
     A*SS32       LNSEN8    R               COLHDG('Date Entered')
     A*SS32                                 REFFLD(SSDAT8)
     A*************************************************************************
     A* AUTO CALCULATE TABLE ENTRIES (LNRATE, LNPRSC, LNLMSC) FILE - LNATAB
     A*************************************************************************
     A            LTBACN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LTBACT    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LTBFID    R               COLHDG('Table' 'File ID')
     A                                      REFFLD(SSCODA)
     A            LTBFMC    R               COLHDG('Due from' '1st Rel/Ful rel')
     A                                      REFFLD(SSCOD1)
     A            LTBETM    R               COLHDG('Effective' 'term')
     A                                      REFFLD(SSTERM)
     A            LTBETC    R               COLHDG('Effective' 'term code')
     A                                      REFFLD(SSCOD1)
     A            LTBRAT    R               COLHDG('Loan' 'interest rate')
     A                                      REFFLD(SSPERD)
     A            LTBRTN    R               COLHDG('Prime Rate' 'Number')
     A                                      REFFLD(SSRATE)
     A            LTBVRI    R               COLHDG('Prime' 'Variance')
     A                                      REFFLD(SSPERD)
     A            LTBVRC    R               COLHDG('Prime Variance' 'Code')
     A                                      REFFLD(SSCOD1)
     A            LTBAMT    R               COLHDG('Amount')
     A                                      REFFLD(SSAMT4)
     A            LTBSTS    R               COLHDG('Update' 'Status')
     A                                      REFFLD(SSCOD1)
     A*************************************************************************
H001 A* TRANCHE WORKING LIMIT SCHEDULE - LNTWSC
     A*************************************************************************
     A            LTCACN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LTCACT    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LTCSQN    R               COLHDG('Tranche' 'Seq.')
     A                                      REFFLD(SSCOU3)
     A            LTCLMT    R               COLHDG('Tranche' 'Limit')
     A                                      REFFLD(SSAMT4)
     A            LTCUAM    R               COLHDG('Utilized Amount')
     A                                      REFFLD(SSAMT4)
     A            LTCDRW    R               COLHDG('Drawing Limit')
     A                                      REFFLD(SSAMT4)
     A            LTCCRT    R               COLHDG('Commitment' 'Rate')
     A                                      REFFLD(SSPERD)
     A            LTCRMK    R               COLHDG('Description')
     A                                      REFFLD(SSMSG0)
     A            LTCDT8    R               COLHDG('Maintenance date')
     A                                      REFFLD(SSDAT8)
A043 A            LTCRM2    R               COLHDG('Description 2')
A043 A                                      REFFLD(SSMSG0)
A043 A            LTCRM3    R               COLHDG('Description 3')
A043 A                                      REFFLD(SSMSG0)
     A*************************************************************************
H001 A* BNM/CGC PARAMETER
     A*************************************************************************
A035 A            CFACCD    R               COLHDG('Fac' 'Code')
A035 A                                      REFFLD(SSCLAS)
     A            CTYPE     R               COLHDG('Loan' 'Type')
     A                                      REFFLD(SSPROD)
     A            CCURTY    R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A            CATYPE    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            CBNIND    R               COLHDG('BNM/CGC' 'Indicator')
     A                                      REFFLD(SSACCT)
     A            CLMAMT    R               COLHDG('Limit' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            CRATE     R               COLHDG('Loan' 'interest rate')
     A                                      REFFLD(SSPERD)
     A            CVARI     R               COLHDG('Variance')
     A                                      REFFLD(SSPERD)
     A            CVCODE    R               COLHDG('Variance' 'Code')
     A                                      REFFLD(SSCOD1)
     A            CPSRT     R               REFFLD(SSCOD2)
     A                                      COLHDG('Prescribed Rate')
     A*************************************************************************
H001 A* NO. OF MIA TO INITIALISE SECURITY VALUE
     A*************************************************************************
     A            MTYPE     R               COLHDG('Loan' 'Type')
     A                                      REFFLD(SSPROD)
     A            MCURTY    R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A            MMIA      R               COLHDG('No. of months' 'in arrears')
     A                                      REFFLD(SSCOU3)
     A*************************************************************************
 |   A* LNALTRL1 - ALT RATE BY RELEASE PERIOD
     A*************************************************************************
 |   A            LAACNO    R               COLHDG('Account Number')
 |   A                                      REFFLD(SSACCN)
 |   A            LAACTY    R               COLHDG('Account Type')
 |   A                                      REFFLD(SSACCT)
     A*************************************************************************
A001 A* LNHFND - Account Funding History
     A*************************************************************************
 |   A            LFACNO    R               COLHDG('Account Number')
 |   A                                      REFFLD(SSACCN)
 |   A            LFACTY    R               COLHDG('Account Type')
 |   A                                      REFFLD(SSACCT)
 |   A            LFCCID    R               COLHDG('Colalteral ID')
 |   A                                      REFFLD(SSDCID)
 |   A            LFCASE    R               COLHDG('Case Funded')
 |   A                                      REFFLD(SSCODA)
 |   A            LFUSRN    R               COLHDG('User Name')
 |   A                                      REFFLD(SSCODA)
 |   A            LFWID     R               COLHDG('Workstation ID')
 |   A                                      REFFLD(SSCODA)
 |   A            LFNBD8    R               COLHDG('Creation Date')
 |   A                                      REFFLD(SSDAT8)
     A*************************************************************************
JEN  A**Month end PFEARN/PFLC - LNMEPF
     A*************************************************************************
JEN  A            LMACCT    R               COLHDG('Account' 'Number')
JEN  A                                      REFFLD(SSACCN)
JEN  A            LMACTP    R               COLHDG('Account' 'Type')
JEN  A                                      REFFLD(SSCOD1)
AM23 A            LMAMNO    R               COLHDG('Main Account' 'Number')
SS13 A                                      REFFLD(SSTMNO)
  |  A            LMALLL    R               COLHDG('Lender In' 'Syndication Ln')
SS23 A                                      REFFLD(SSTLLL)
  |  A            LMADDD    R               COLHDG('Drawdown' 'Sequence Number')
SS23 A                                      REFFLD(SSTDDD)
JEN  A            LMMCHG    R               COLHDG('Date Change')
JEN  A*R1007                                REFFLD(SSCOU6)
R1007A                                      REFFLD(SSDAT8)
SS17 A            LMPCD8    R               COLHDG('Creation' 'Date')
SS17 A                                      REFFLD(SSDAT8)
R1002A            LMSTSC    R               COLHDG('Status Code')
R1002A                                      REFFLD(SSCOD2)
JEN  A            LMEARN    R               COLHDG('Profit Period' 'Interest -
     A                                      Earn')
JEN  A                                      REFFLD(SSAMTG)
JEN  A            LMLC      R               COLHDG('Profit Period' 'L/C Earn')
OS01 A                                      REFFLD(SSAMTG)
M022 A            LMECF     R               COLHDG('Profit Period' 'Comm. Fees')
OS01 A                                      REFFLD(SSAMTG)
A012 A            LMOSB     R               COLHDG('Outstanding Balance')
A012 A                                      REFFLD(SSAMT4)
M022 A            LMECBL    R               COLHDG('Current Balance')
M022 A                                      REFFLD(SSAMT4)
R1020A            LMBKSC    R               COLHDG('Bank Discount')
R1020A                                      REFFLD(SSAMT4)
A034 A            LMINTR    R               COLHDG('Interest Rebate')
OS01 A                                      REFFLD(SSAMT4)
A037 A            LMACCI    R               COLHDG('Accrue Interest')
A037 A                                      REFFLD(SSAMTG)
M022 A            LMEPEN    R               COLHDG('Accured Penalty' 'Interest')
M022 A                                      REFFLD(SSAMTG)
M022 A            LMECOM    R               COLHDG('Commit. Fee' 'Accrue Int')
OS01 A                                      REFFLD(SSAMTG)
M022 A            LMEOTH    R               COLHDG('Other Charges')
OS01 A                                      REFFLD(SSAMT4)
M022 A            LMEMIS    R               COLHDG('Miscellaneous Cost')
OS01 A                                      REFFLD(SSAMT4)
M040 A            LMRINT    R               COLHDG('Restructured' 'Interest')
M040 A                                      REFFLD(SSAMT4)
K0001A            LMMMOR    R               COLHDG('Moratorium' 'Interest')
K0001A                                      REFFLD(SSAMT4)
M040 A            LMRLC     R               COLHDG('Restructured' 'L/C')
OS01 A                                      REFFLD(SSAMT4)
M040 A            LMBINT    R               COLHDG('Interest Due')
OS01 A                                      REFFLD(SSAMT4)
M040 A            LMBLC     R               COLHDG('L/C Due')
OS01 A                                      REFFLD(SSAMT4)
AM01 A            LMPFBL    R               COLHDG('Profit Period' 'Agg Bal')
     A                                      REFFLD(SSAMT4)
AM01 A            LMPFBR    R               COLHDG('Profit Period' 'Remainder')
     A                                      REFFLD(SSCOU5)
AM01 A            LMPFDY    R               COLHDG('Profit Period' 'Agg Days')
SS14 A                                      REFFLD(SSAMT4)
SS26 A            LMMIAC    R               COLHDG('Month in Arrears')
SS26 A*R1035                                REFFLD(SSCOU3)
R1035A                                      REFFLD(SSCOU5)
SS26 A            LMDIAC    R               COLHDG('Days in Arrears')
SS26 A*R1035                                REFFLD(SSCOU3)
R1035A                                      REFFLD(SSCOU5)
R1002A            LMIISU    R               COLHDG('Interest In Suspend')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMISUX    R               COLHDG('Int. In.' 'Suspend -
R1002A                                      Taxable')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMISUN    R               COLHDG('Int. In.' 'Suspend -
R1002A                                      Non-taxable')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMRISP    R               COLHDG('Restructured' 'IIS')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMRISX    R               COLHDG('Restructured' 'IIS -
R1002A                                      Taxable')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMRISN    R               COLHDG('Restructured' 'IIS -
R1002A                                      Non-Taxable')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMMINT    R               COLHDG('Moratorium Interest')
R1002A                                      REFFLD(SSAMTH)
R1020A            LMLCSP    R               COLHDG('LC-In-Susp')
R1020A                                      REFFLD(SSAMT4)
R1002A            LMDINT    R               COLHDG('LTD Interst Paid')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMDRIN    R               COLHDG('LTD Restructured' -
R1002A                                      'Int. Paid')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMDMIN    R               COLHDG('LTD Moratorium' 'Int. Paid')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMDRLC    R               COLHDG('LTD Restructured' -
R1002A                                      'L/C. Paid')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMDPRN    R               COLHDG('LTD Principal Paid')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMDLC     R               COLHDG('LTD' 'LC Paid')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMDCF     R               COLHDG('LTD Commitment' 'Fee Paid')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMDMSC    R               COLHDG('LTD Miscellaneous' -
R1002A                                      'Cost Paid')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMDOTH    R               COLHDG('LTD Other' 'Charges Paid')
R1002A                                      REFFLD(SSAMT4)
R1002A            LMDPMR    R               COLHDG('LTD Payment Received')
R1002A                                      REFFLD(SSAMT4)
K0030A            LMDUCR    R               COLHDG('Ingteret UCR')
K0030A*K0031                                REFFLD(SSAMT4)
K0031A                                      REFFLD(SSAMTG)
K0030A            LMDUCT    R               COLHDG('Interest UCR-Taxable')
K0030A                                      REFFLD(SSAMT4)
K0030A            LMDUCN    R               COLHDG('Interest UCR-Nontax')
K0030A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A**Loan Master File - Extension - LNMASR
     A*************************************************************************
     A            REFIN     R               COLHDG('Refinance (Y/N)')
     A                                      REFFLD(SSCOD1)
     A            MERGEP    R               COLHDG('Prev. Merger' 'Partner')
     A                                      REFFLD(SSCOD3)
     A            FTPFLG    R               COLHDG('FTP Flag(Y/N)')
     A                                      REFFLD(SSCOD1)
     A            FTPRAT    R               COLHDG('FTP Rate')
     A                                      REFFLD(SSPERD)
A011 A            PRORGA    R               COLHDG('Previous Loan Amount')
 |   A                                      REFFLD(SSAMT4)
 |   A            PRBKDI    R               COLHDG('Previous Term' 'Charges')
 |   A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
 |   A            PRINPD    R               COLHDG('Previous Instalment' 'Paid')
A011 A                                      REFFLD(SSAMT4)
K0007A            LNEXPN    R               COLHDG('Except Past' -
K0007A                                      'Due Penalty')
K0007A                                      REFFLD(SSYON)
K0007A            AVGEXR    R               COLHDG('Average Capital' -
K0007A                                      'Exchange Rate')
K0007A                                      REFFLD(SSPERD)
K0007A            LEGST3    R               COLHDG('LEGAL STATUS')
K0007A                                      REFFLD(SSCOD3)
K0007A            AEXMAT    R               COLHDG('UPDATE MATURITY' -
K0007A                                      'DATE (REDRAW)')
K0007A                                      REFFLD(SSCOD1)
K0007A            LTCIND    R               COLHDG('GROUP LATE' -
K0007A                                      'CHARGE INDICATOR')
K0007A                                      REFFLD(SSCOD1)
K0012A            LNEXSP    R               COLHDG('Except suspense' +
K0012A                                      'interest')
K0012A                                      REFFLD(SSYON)
K0013A            ADDINT    R               COLHDG('Additional Interest' +
K0013A                                      'To FEE When PAY-OFF')
K0013A                                      REFFLD(SSPERD)
K0017A            ACREF1    R               COLHDG('Filler 1')
K0017A                                      REFFLD(SSGLNO)
K0017A            ACREF2    R               COLHDG('Filler 2')
K0017A                                      REFFLD(SSGLNO)
K0018A            ACBLID    R               COLHDG('Filler 3')
K0018A                                      REFFLD(SSCODF)
K0025A            CPPENF    R               COLHDG('Cross Product' 'Penalty')
K0025A                                      REFFLD(SSYON)
K0025A            CPSTPF    R               COLHDG('Cross Product' -
K0025A                                             'Stop Accrue')
K0025A                                      REFFLD(SSYON)
     A*************************************************************************
     A** RATE TYPE PARAMETER
     A*************************************************************************
A015 A            LZCODE    R               COLHDG('RATE' 'TYPE')
A015 A                                      REFFLD(SSCOD3)
A015 A            LZDESC    R               COLHDG('RATE' 'TYPE' 'DESC')
A015 A                                      REFFLD(SSDESC)
     A*************************************************************************
A021 A* ALTERNATE RATE SCHEDULE PACKAGE RESTRUCTURING - LNRASC
     A*************************************************************************
A021 A            RCACCT    R               COLHDG('Account' 'Number')
A021 A                                      REFFLD(SSACCN)
A021 A            RCATYP    R               COLHDG('Account' 'Type')
A021 A                                      REFFLD(SSACCT)
A021 A            RCEFF8    R               COLHDG('Effective Date 6')
A021 A                                      REFFLD(SSDAT8)
A021 A            RCREF8    R               COLHDG('Rate' 'Effective Date 6')
A021 A                                      REFFLD(SSDAT8)
A021 A            RCIRTE    R               COLHDG('Interest' 'Rate')
A021 A                                      REFFLD(SSPERD)
A021 A            RCMRNO    R               COLHDG('Master Rate No.')
A021 A                                      REFFLD(SSTERM)
A021 A            RCVAR     R               COLHDG('Variance')
A021 A                                      REFFLD(SSPERD)
A021 A            RCVARC    R               COLHDG('Variance Code')
A021 A                                      REFFLD(SSCOD1)
A021 A            RCPFLR    R               COLHDG('Rate Floor')
A021 A                                      REFFLD(SSPERD)
A021 A            RCPCEL    R               COLHDG('Rate Ceiling')
A021 A                                      REFFLD(SSPERD)
A021 A            RCIRTY    R               COLHDG('Interest Rate Type.')
A021 A                                      REFFLD(SSSTA3)
     A*************************************************************************
A025  ** Loan Reschedule for HP/IHP LNRSHP
     A*************************************************************************
A025 A            LRNLAM    R               COLHDG('New Loan Amount')
A025 A                                      REFFLD(SSAMT4)
A025 A            LRNLTM    R               COLHDG('New Loan Term')
A025 A                                      REFFLD(SSTU05)
A025 A            LRNLTC    R               COLHDG('New Loan Term Code')
A025 A                                      REFFLD(SSCOD1)
A025 A            LRNINRT   R               COLHDG('New Int Rate Type')
A025 A                                      REFFLD(SSCOD3)
A025 A            LRNINRA   R               COLHDG('New Int Rate')
A025 A                                      REFFLD(SSPERD)
A025 A            LRNFPD8   R               COLHDG('New 1st Pmt Date')
A025 A                                      REFFLD(SSDAT8)
A025 A            LRNNPD8   R               COLHDG('New Nxt Pmt Date')
A025 A                                      REFFLD(SSDAT8)
A025 A            LRNNSPD8  R               COLHDG('New Nxt Sch PDte')
A025 A                                      REFFLD(SSDAT8)
A025 A            LRNMTD8   R               COLHDG('New Maturity Date')
A025 A                                      REFFLD(SSDAT8)
A025 A            LRNPCD    R               COLHDG('New Payment Code')
A025 A                                      REFFLD(SSCOU1)
A025 A            LRNPAM    R               COLHDG('New Payment Amount')
A025 A                                      REFFLD(SSAMT4)
A025 A            LRNFPAM   R               COLHDG('New Final' 'Payment Amount')
A025 A                                      REFFLD(SSAMT4)
A025 A            LRMIDB    R               COLHDG('Mth in Default' 'Before')
A025 A                                      REFFLD(SSCOU3)
A025 A            LRAIDB    R               COLHDG('Amt in Default' 'Before')
A025 A                                      REFFLD(SSAMT4)
A025 A            LRNPLB    R               COLHDG('NPL Before' 'Variation')
A025 A                                      REFFLD(SSCOD1)
A025 A            LRNPLA    R               COLHDG('NPL After' 'Variation')
A025 A                                      REFFLD(SSCOD1)
A025 A            LRNTMC    R               COLHDG('New Term Charge')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A025 A            LRNINR    R               COLHDG('New Int Rebate')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A025 A            LRNPRP    R               COLHDG('New Amt Partially' 'Paid')
A025 A                                      REFFLD(SSAMT4)
A025 A            LRNEIR    R               COLHDG('New EIR')
A025 A                                      REFFLD(SSPERD)
A025 A            LRNAPR    R               COLHDG('New APR')
A025 A                                      REFFLD(SSPERD)
A025 A            LROLAM    R               COLHDG('Old Loan Amount')
A025 A                                      REFFLD(SSAMT4)
A025 A            LROPEN    R               COLHDG('Old PENINT')
A025 A                                      REFFLD(SSAMTG)
A025 A            LROASS    R               COLHDG('Old ASSLC')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A025 A            LROPLC    R               COLHDG('Old PAIDLC')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A025 A            LROMIS    R               COLHDG('Old MISCD')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A025 A            LROOTH    R               COLHDG('Old OTHCHG')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A025 A            LROPRR    R               COLHDG('Old PrePaid' 'Rental')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A025 A            LROTMC    R               COLHDG('Old Term Charge')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A025 A            LROINR    R               COLHDG('Old Interest Rebate')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
A025 A            LROTIP    R               COLHDG('Old Total Instl' 'Paid')
A025 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A*************************************************************************
A045  ** Work file for AFT to cater for AFT with Adv Pmt (LNAWRK)
     A*************************************************************************
A045 A            LAWACN    R               COLHDG('Account No')
A045 A                                      REFFLD(SSACCN)
A041 A            LAWATY    R               COLHDG('Account' 'Type')
A045 A                                      REFFLD(SSACCT)
A045 A            LAWMAD    R               COLHDG('Memo Advance' 'Payment Amt')
A045 A                                      REFFLD(SSAMT4)
A045 A            LAWAAD    R               COLHDG('Actual Adv.' 'Payment Amt')
A045 A                                      REFFLD(SSAMT4)
     A*************************************************************************
A047 A** CURRENT/SAVING ACCOUNT BALANCE HISTORY FILE (LNSBAL)
     A*************************************************************************
     A            LCSLNA    R               COLHDG('Loan Account No.')
     A                                      REFFLD(SSACCN)
     A            LCSLAT    R               COLHDG('Loan Account Type')
     A                                      REFFLD(SSACCT)
     A            LCSCSA    R               COLHDG('CA/SA Account')
     A                                      REFFLD(SSACCN)
     A            LCSCST    R               COLHDG('CA/SA Account Type')
     A                                      REFFLD(SSACCT)
     A            LCSDT8    R               REFFLD(SSDAT8)
     A                                      COLHDG('Upd CA/SA Bal Date')
     A            LCSBAL    R               COLHDG('CA/SA Account Bal')
     A                                      REFFLD(SSAMT4)
     A            LCSLBL    R               COLHDG('CA/SA Ledger Bal')
     A                                      REFFLD(SSAMT4)
     A*************************************************************************
A047 A** LOAN TO CURRENT/SAVING RELATIONSHIP FILE (LNCSRL)
     A*************************************************************************
     A            LCRLNA    R               COLHDG('Loan Account No.')
     A                                      REFFLD(SSACCN)
     A            LCRLAT    R               COLHDG('Loan Account Type')
     A                                      REFFLD(SSACCT)
     A            LCRBAL    R               COLHDG('Total bal for CA/SA')
     A                                      REFFLD(SSAMT4)
     A            LCRRF8    R               COLHDG('Effective Date')
     A                                      REFFLD(SSDAT8)
     A            LCRRST    R               REFFLD(SSCOD1)
     A                                      COLHDG('Loan AC Restructure')
     A            LCRNTY    R               COLHDG('Rest. New Type')
     A                                      REFFLD(SSOFFC)
SS11 A            LCRAAE    R               COLHDG('Actual Amount Excess')
SS11 A                                      REFFLD(SSAMT4)
SS11 A            LCRERC    R               COLHDG('Excess After' 'Return Cheq')
SS11 A                                      REFFLD(SSAMT4)
     A*************************************************************************
A047 A** LOAN TO CURRENT/SAVING ACCOUNT LINKAGE FILE (LNCASV)
     A*************************************************************************
     A            LCVLNA    R               COLHDG('Loan Account No.')
     A                                      REFFLD(SSACCN)
     A            LCVLAT    R               COLHDG('Loan Account Type')
     A                                      REFFLD(SSACCT)
     A            LCVCSA    R               COLHDG('CA/SA Account No.')
     A                                      REFFLD(SSACCN)
     A            LCVCST    R               COLHDG('CA/SA Account Type')
     A                                      REFFLD(SSACCT)
     A            LCVYTB    R               COLHDG('CA/SA Yesterday CBAL')
     A                                      REFFLD(SSAMT4)
     A            LCVYTL    R               COLHDG('CA/SA YTD Ledger Bal')
     A                                      REFFLD(SSAMT4)
     A            LCVDT8    R               COLHDG('Upd LCVYTB Date')
     A                                      REFFLD(SSDAT8)
     A            LCVTM6    R               COLHDG('Upd LCVYTB Time')
     A                                      REFFLD(SSTIM6)
     A            LCVRST    R               COLHDG('CA/SA Restructure')
     A                                      REFFLD(SSCOD1)
     A            LCVRF8    R               COLHDG('Rest.Effective Date')
     A                                      REFFLD(SSDAT8)
     A            LCVNTY    R               COLHDG('Rest. New Type')
     A                                      REFFLD(SSOFFC)
     A*************************************************************************
M002 ** LOAN ACCOUNT EARMARK FILE - LNEMRK
     A*************************************************************************
     A            LMERID    R               COLHDG('RECORD IDENTIFIER')
     A                                      REFFLD(SSCOD1)
     A            LMATYP    R               COLHDG('ACCOUNT TYPE')
     A                                      REFFLD(SSACCT)
     A            LMESEQ    R               COLHDG('SEQUENCE NO.')
     A                                      REFFLD(SSCOU3)
     A            LMHOLD    R               COLHDG('EARMARK AMOUNT')
     A                                      REFFLD(SSAMT4)
     A            LMREMK    R               COLHDG('STOP/HOLD' 'REMARKS')
     A                                      REFFLD(SSDESC)
     A            LMEXD8    R               COLHDG('EXPIRATION DATE')
     A                                      REFFLD(SSDAT8)
     A            LMSTS     R               COLHDG('EARMARK STATUS')
     A                                      REFFLD(SSCOD1)
     A*************************************************************************
M002 A* LNPOFF - DETAILS OF LN PAYOFF CALCULATIONS
     A*************************************************************************
     A            LWP1N8    R               COLHDG('Date of Inquiry')
     A                                      REFFLD(SSDAT8)
     A            LWIND     R               COLHDG('Charge Type')
     A                                      REFFLD(SSCOD3)
     A            LWFLT     R               COLHDG('Flat amount')
     A                                      REFFLD(SSAMT4)
     A            LWBAL     R               COLHDG('Balance')
     A                                      REFFLD(SSAMT4)
AM01 A            LWBAL2    R               COLHDG('Amount')
AM01 A                                      REFFLD(SSAMTG)
     A            LWRAT     R               COLHDG('Rate')
     A                                      REFFLD(SSPERD)
     A            LWSDT8    R               COLHDG('Starting date')
     A                                      REFFLD(SSDAT8)
     A            LWEDT8    R               COLHDG('Ending date')
     A                                      REFFLD(SSDAT8)
AM27 A            LWDES1    R               COLHDG('Charge Description')
AM27 A                                      REFFLD(SSDES1)
AM27 A            LWDES2    R               COLHDG('Charge Details')
AM27 A                                      REFFLD(SSDES1)
AM27 A            LWCURR    R               COLHDG('Currency' 'Type')
AM27 A                                      REFFLD(SSCURC)
     A*************************************************************************
M002 A* Accrued interest detail calculation file - LNACCD - LNACCD
     A*************************************************************************
     A            LADSD8    R               COLHDG('Start date')
     A                                      REFFLD(SSDAT8)
     A            LADED8    R               COLHDG('End date')
     A                                      REFFLD(SSDAT8)
     A            LADIND    R               COLHDG('Accrual Indicator')
     A                                      REFFLD(SSCOD2)
     A            LADAMT    R               COLHDG('Accrual balance')
     A                                      REFFLD(SSAMT4)
     A            LADRAT    R               COLHDG('Accrual rate')
     A                                      REFFLD(SSPERD)
     A            LADACR    R               COLHDG('Period accrued')
     A                                      REFFLD(SSAMTG)
     A            LADDYS    R               COLHDG('Number of days')
     A                                      REFFLD(SSCOU3)
     A*************************************************************************
M002 ** CURRENCY ALLOWED FILE BY A/A LEVEL - LNCURA
     A*************************************************************************
     A            LACRID    R               COLHDG('Record Identifier')
     A                                      REFFLD(SSCOD1)
     A            LAACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LATYPE    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LACURR    R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A*************************************************************************
M002 ** Syndication Reporting Master - LNSYNM
     A*************************************************************************
M038 A            LNSYRD    R               COLHDG('Record' 'Identifier')
M038 A                                      REFFLD(SSACCN)
M002 A            LNSYAC    R               COLHDG('Account' 'Number')
M002 A                                      REFFLD(SSACCN)
M002 A            LNSYTP    R               COLHDG('Account' 'Type')
M002 A                                      REFFLD(SSACCT)
M038 A            LNSLDR    R               COLHDG('Lender Code')
M038 A*R1010                                REFFLD(SSCOU3)
R1010A                                      REFFLD(SSTLLL)
M038 A            LNSROL    R               COLHDG('Syndication Role')
M038 A                                      REFFLD(SSCOD2)
M002 A            LNSCUR    R               COLHDG('Syndicated' 'Currency')
M002 A                                      REFFLD(SSCURC)
M002 A            LNSAMT    R               COLHDG('Total Syndicated' 'Amount')
M002 A                                      REFFLD(SSAMT4)
M038 A            LNSPTA    R               COLHDG('Participation' 'Amount')
M038 A                                      REFFLD(SSAMT4)
AM01 A            LNSRMK    R               COLHDG('Remark')
     A                                      REFFLD(SSDESL)
M002 A*M038       LSDLNO    R               COLHDG('Dealer' 'Number')
M002 A*M038                                 REFFLD(SSCOUB)
M002 A*M038       LNPCOD    R               COLHDG('Participation' 'Code')
M002 A*M038                                 REFFLD(SSCOD1)
M002 A*M038       LNPPCT    R               COLHDG('Participation %')
M002 A*M038                                 REFFLD(SSPERD)
M002 A*M038       LNARLM    R               COLHDG('Arrangement Lead' 'Manager')
M002 A*M038                                 REFFLD(SSCOD1)
M002 A*M038       LNMGLM    R               COLHDG('Management Lead' 'Manager')
M002 A*M038                                 REFFLD(SSCOD1)
M002 A*M038       LNPYLM    R               COLHDG('Payment Lead' 'Manager')
M002 A*M038                                 REFFLD(SSCOD1)
M002 A*M038       LNDIRD    R               COLHDG('Direct' 'Disbursement(Y/N)')
M002 A*M038                                 REFFLD(SSCOD1)
     A*************************************************************************
M002 A** LNRRAT - Restructuring Alt Rate File
     A*************************************************************************
M002 A            RRTRID    R               COLHDG('Record Identifier')
M002 A                                      REFFLD(SSCOD1)
M002 A            RACCT     R               COLHDG('Account' 'Number')
M002 A                                      REFFLD(SSACCN)
M002 A            RACTYP    R               COLHDG('Account' 'Type')
M002 A                                      REFFLD(SSACCT)
M002 A            RRATE     R               COLHDG('Loan' 'interest rate')
M002 A                                      REFFLD(SSPERD)
M002 A            RDLRRT    R               COLHDG('Dealer' 'Rate')
M002 A                                      REFFLD(SSPERD)
M002 A            RPRTN     R               COLHDG('Rate' 'Number')
M002 A                                      REFFLD(SSRATE)
M002 A            RPVARI    R               COLHDG('Rate' 'Variance')
M002 A                                      REFFLD(SSPERD)
M002 A            RPVCD     R               COLHDG('Rate Variance' 'Code')
M002 A                                      REFFLD(SSCOD1)
M002 A            RPFLOR    R               COLHDG('Rate' 'Floor')
M002 A                                      REFFLD(SSPERD)
M002 A            RPCEIL    R               COLHDG('Rate' 'Ceiling')
M002 A                                      REFFLD(SSPERD)
M002 A            RPRTRM    R               COLHDG('Rate' 'Review Term')
M002 A                                      REFFLD(SSTERM)
M002 A            RPRCD     R               COLHDG('Rate Review' 'Term Code')
M002 A                                      REFFLD(SSCOD1)
M002 A            RPRVD8    R               COLHDG('Rate' 'Review Date')
M002 A                                      REFFLD(SSDAT8)
M002 A            RPRDAY    R               COLHDG('Rate' 'Review Day')
M002 A                                      REFFLD(SSDAT2)
M002 A            REFFD8    R               COLHDG('Rate eff date')
M002 A                                      REFFLD(SSDAT8)
M002 A            RYBFLG    R               COLHDG('Auto Update' 'Year Base')
M002 A                                      REFFLD(SSCOD1)
M002 A            RDYBSE    R               COLHDG('Interest Year' 'Base')
M002 A                                      REFFLD(SSCOD1)
M002 A            RLYBSE    R               COLHDG('Late Charge' 'Year Base')
M002 A                                      REFFLD(SSCOD1)
M002 A            RCYBSE    R               COLHDG('Commitment Fee' 'Year Base')
M002 A                                      REFFLD(SSCOD1)
M002 A            RRESTM    R               COLHDG('Rest' 'Method')
M002 A                                      REFFLD(SSCOD1)
M002 A            RPMTCD    R               COLHDG('Upd when' 'pmtcod auto chg')
M002 A                                      REFFLD(SSCOD1)
M002 A            RDLM8     R               COLHDG('Date last' 'maint date')
M002 A                                      REFFLD(SSDAT8)
M002 A            RRRVD8    R               COLHDG('Rate Usr Manual' 'Rvw Dt')
M002 A                                      REFFLD(SSDAT8)
M002 A            RRRTRM    R               COLHDG('Rate Usr Manual' 'Rvw Term')
M002 A                                      REFFLD(SSTERM)
M002 A            RRRCOD    R               COLHDG('Rate User Manual' 'Review T+
M002 A                                      erm Code')
M002 A                                      REFFLD(SSCOD1)
M002 A            RRRDAY    R               COLHDG('Rate User Manual' 'Review D+
M002 A                                      ay')
M002 A                                      REFFLD(SSDAT2)
M002 A            RVFLOR    R               COLHDG('Rate Var.' 'Floor')
M002 A                                      REFFLD(SSPERD)
M002 A            RVCEIL    R               COLHDG('Rate Var.' 'Ceiling')
M002 A                                      REFFLD(SSPERD)
M002 A            RREFD8    R               COLHDG('Restructuring' 'Eff Date')
M002 A                                      REFFLD(SSDAT8)
     A*************************************************************************
M002 A** LNRTIR - Restructuring Tier Rate File
     A*************************************************************************
M002 A            LRRRID    R               COLHDG('Record' 'ID')
M002 A                                      REFFLD(SSCOD1)
M002 A            LRRATP    R               COLHDG('Account' 'Type')
M002 A                                      REFFLD(SSACCT)
M002 A            LRRSEQ    R               COLHDG('Sequence' 'number')
M002 A                                      REFFLD(SSCOU3)
M002 A            LRSEQP    R               COLHDG('Posting' 'Sequence')
M002 A                                      REFFLD(SSCOU3)
M002 A            LRTLMT    R               COLHDG('Tier' 'limit')
M002 A                                      REFFLD(SSAMT4)
M002 A            LRRRTE    R               COLHDG('Rate')
M002 A                                      REFFLD(SSPERD)
M002 A            LRRTN     R               COLHDG('Rate' 'number')
M002 A                                      REFFLD(SSRATE)
M002 A            LRPVAR    R               COLHDG('Rate' 'variance')
M002 A                                      REFFLD(SSPERD)
M002 A            LRPVR1    R               COLHDG('Variance' 'code')
M002 A                                      REFFLD(SSCOD1)
M002 A            LRFLOR    R               COLHDG('Rate' 'floor')
M002 A                                      REFFLD(SSPERD)
M002 A            LRCEIL    R               COLHDG('Rate' 'ceiling')
M002 A                                      REFFLD(SSPERD)
M002 A            LRRDT8    R               COLHDG('Rate' 'review date')
M002 A                                      REFFLD(SSDAT8)
M002 A            LRVTRM    R               COLHDG('Rate' 'review term')
M002 A                                      REFFLD(SSTERM)
M002 A            LRTRCD    R               COLHDG('Rate review' 'term code')
M002 A                                      REFFLD(SSCOD1)
M002 A            LRRDAY    R               COLHDG('Rate' 'review day')
M002 A                                      REFFLD(SSDAT2)
M002 A            LRSTR8    R               COLHDG('Start' 'date')
M002 A                                      REFFLD(SSDAT8)
M002 A            LREXP8    R               COLHDG('Expiration' 'date')
M002 A                                      REFFLD(SSDAT8)
M002 A            LRDLM8    R               COLHDG('Date last' 'Maintenance dat+
M002 A                                      e')
M002 A                                      REFFLD(SSDAT8)
M002 A            LRREF8    R               COLHDG('Restructuring' 'Eff Date')
M002 A                                      REFFLD(SSDAT8)
     A*************************************************************************
S100 A* LNNOTP - NUMBER TYPE FILE
     A*************************************************************************
S100 A            NUMTYP    R               COLHDG('Number Type')
S100 A                                      REFFLD(SSCODA SILVERLAKE)
S100 A            BATNUM    R               COLHDG('Batch No')
S100 A                                      REFFLD(SSCOU5 SILVERLAKE)
     A*************************************************************************
M002 A* SPLIT/MERGE FILE - LNSPLT
     A*************************************************************************
M002 A            LSARID    R               COLHDG('Record Identifier')
M002 A                                      REFFLD(SSCOD1)
M002 A            LSACT     R               COLHDG('Account' 'Number')
M002 A                                      REFFLD(SSACCN)
M002 A            LSNACT    R               COLHDG('New Acct' 'Number')
M002 A                                      REFFLD(SSACCN)
CI04 A            LSAMNO    R               COLHDG('Main Account' 'Number')
  |  A*SS13                                 REFFLD(SSCOUB)
SS13 A                                      REFFLD(SSTMNO)
  |  A            LSALLL    R               COLHDG('Lender In' 'Syndication Ln')
SS23 A                                      REFFLD(SSTLLL)
  |  A            LSADDD    R               COLHDG('Drawdown' 'Sequence Number')
SS23 A                                      REFFLD(SSTDDD)
M002 A            LSCODE    R               COLHDG('Split/Merge')
M002 A                                      REFFLD(SSCOD1)
M002 A            LSAMT     R               COLHDG('Split Amt')
M002 A                                      REFFLD(SSAMT4)
M002 A            LSPRN     R               COLHDG('Affect prin')
M002 A                                      REFFLD(SSCOD1)
M002 A            LSINT     R               COLHDG('Affect int')
M002 A                                      REFFLD(SSCOD1)
M002 A            LSLC      R               COLHDG('Affect L/C')
M002 A                                      REFFLD(SSCOD1)
M002 A            LSOC      R               COLHDG('Affect O/C')
M002 A                                      REFFLD(SSCOD1)
M002 A            LSMC      R               COLHDG('Affect M/C')
M002 A                                      REFFLD(SSCOD1)
M002 A            LSOC2     R               COLHDG('Define O/C' 'chg types')
M002 A                                      REFFLD(SSCOD1)
M002 A            LSMC2     R               COLHDG('Define M/C' 'chg types')
M002 A                                      REFFLD(SSCOD1)
M002 A            LSPRNA    R               COLHDG('Transfer' 'Prin amount')
M002 A                                      REFFLD(SSAMT4)
M002 A            LSINTA    R               COLHDG('Transfer' 'Int amount')
M002 A                                      REFFLD(SSAMT4)
M002 A            LSLCA     R               COLHDG('Transfer' 'L/C amount')
M002 A                                      REFFLD(SSAMT4)
M002 A            LSOCA     R               COLHDG('Transfer' 'O/C amount')
M002 A                                      REFFLD(SSAMT4)
M002 A            LSMCA     R               COLHDG('Transfer' 'M/C amount')
M002 A                                      REFFLD(SSAMT4)
CI08 A            LSBATN    R               COLHDG('Batch' 'Number')
CI08 A                                      REFFLD(SSCOU5)
M002 A            LSXRT     R               COLHDG('Exchange rate')
M002 A                                      REFFLD(SSAMTQ)
M002 A            LSFXDL    R               COLHDG('FX deal number')
M002 A                                      REFFLD(SSCODA)
M002 A            LSNEWA    R               COLHDG('Split new' 'amount')
M002 A                                      REFFLD(SSAMT4)
M002 A            LSCONV    R               COLHDG('Converted' 'Amount')
M002 A                                      REFFLD(SSAMT4)
M002 A            LSDT8     R               COLHDG('Transfer date')
M002 A                                      REFFLD(SSDAT8)
M002 A            LSASTS    R               COLHDG('Approval status')
M002 A                                      REFFLD(SSCOD1)
CI04 A            LSPSTS    R               COLHDG('Processing' 'Status')
CI04 A                                      REFFLD(SSCOD1)
     A*************************************************************************
     ** M003
     ** LOAN LATE CHARGE TIERED ACCRUAL HISTORY FILE - LNTLCH
     A*************************************************************************
     A            LCHACT    R               COLHDG('Account number')
     A                                      REFFLD(SSACCN)
     A            LCHTYP    R               COLHDG('Account Type')
     A                                      REFFLD(SSACCT)
     A            LCHD8     R               COLHDG('Date changed')
     A                                      REFFLD(SSDAT8)
     A            LCHCLC    R               COLHDG('Tier Rate' 'Type')
     A                                      REFFLD(SSCOD1)
     A            LCHSQ     R               COLHDG('Tier Rate' 'Seq Number')
     A                                      REFFLD(SSCOU3)
     A            LCHBL     R               COLHDG('New L/C tier amount')
     A                                      REFFLD(SSAMT4)
     A            LCHRT     R               COLHDG('New L/C Tier rate')
     A                                      REFFLD(SSPERD)
     A*************************************************************************
     ** M001
     ** LNPPRT - PREPAYMENT FEES FOR PAYOFF
     A*************************************************************************
     A            LRTRID    R               COLHDG('Record Identifier')
     A                                      REFFLD(SSCOD1)
     A            LRTACT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LRTTYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LRSEQN    R               COLHDG('Sequence' 'Number')
     A                                      REFFLD(SSCOU9)
     A            LRTMM     R               COLHDG('Payoff B4' 'Months')
     A                                      REFFLD(SSDAT2)
     A            LRTDD     R               COLHDG('Payoff B4' 'Days')
     A                                      REFFLD(SSDAT2)
     A            LRTEX8    R               COLHDG('Expiry' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LRTRAT    R               COLHDG('Loan' 'interest rate')
     A                                      REFFLD(SSPERD)
     A            LRTRTN    R               COLHDG('Prime Rate' 'Number')
     A                                      REFFLD(SSRATE)
     A            LRTVAR    R               COLHDG('Prime' 'Variance')
     A                                      REFFLD(SSPERD)
     A            LRTVRC    R               COLHDG('Prime Variance' 'Code')
     A                                      REFFLD(SSCOD1)
     A            LRTFLR    R               COLHDG('Prime Rate' 'Floor')
     A                                      REFFLD(SSPERD)
     A            LRTCEL    R               COLHDG('Prime Rate' 'Ceiling')
     A                                      REFFLD(SSPERD)
     A            LRTUID    R               COLHDG('User ID')
     A                                      REFFLD(SSCODA)
     A            LRTWID    R               COLHDG('Workstation ID')
     A                                      REFFLD(SSCODA)
     A            LRTDT8    R               COLHDG('Last Maint' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LRTTIM    R               COLHDG('Last Maint' 'Time')
     A                                      REFFLD(SSTIM6)
     A*************************************************************************
     ** M001
     ** LNSAPP - A/C LEVEL - SYNDICATED LENDER PARTICIPATING BANK FILE
     A*************************************************************************
     A            ASACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            ASTYPE    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            ASLNDR    R               COLHDG('Lender' 'Code')
     A*R1010                                REFFLD(SSCOU3)
R1010A                                      REFFLD(SSTLLL)
     A            ASORGC    R               COLHDG('Lender' 'Original -
     A                                      Commitment')
     A                                      REFFLD(SSAMT4)
     A            ASORG     R               COLHDG('Lender' 'Commitment')
     A                                      REFFLD(SSAMT4)
     A            ASRTYP    R               COLHDG('Lender' 'Interest Type')
     A*R1049                                REFFLD(SSCOD5)
R1049A                                      REFFLD(SSCODA)
     A            ASRATE    R               COLHDG('Lender Interest' 'Rate')
     A                                      REFFLD(SSPERD)
     A            ASDLRT    R               COLHDG('Lender Dealer' 'Rate')
     A                                      REFFLD(SSPERD)
     A            ASRATN    R               COLHDG('Lender Prime' 'RateN')
     A                                      REFFLD(SSRATE)
     A            ASVAR     R               COLHDG('Lender Prime' 'Variance')
     A                                      REFFLD(SSPERD)
     A            ASVARC    R               COLHDG('Lender Prime' 'Var. Code')
     A                                      REFFLD(SSCOD1)
     A            ASROLE    R               COLHDG('Lender Type/' 'Role')
     A                                      REFFLD(SSCOD2)
     A            ASLCTP    R               COLHDG('Lender Late Charge' 'Type')
     A                                      REFFLD(SSCOU3)
     A            ASLCRT    R               COLHDG('Lender Late Charge' 'Rate')
     A                                      REFFLD(SSPERD)
     A*************************************************************************
     **M003
     A*  LNFRFN - MBASE ONLINE REFERENCE FILE   *
     A*************************************************************************
     A            RFNUSR    R               COLHDG('USER ID')
     A                                      REFFLD(SSCODA)
     A            RFNDT8    R               COLHDG('DATE')
     A                                      REFFLD(SSCOU8)
     A            RFNNUM    R               COLHDG('SEQUENCE NUMBER')
     A                                      REFFLD(SSCOU7)
     A*************************************************************************
M007 A** CGC, CAGAMAS AND DANAH HARTA - LNSCGC
     A*************************************************************************
     A** CAGAMAS
     A            PURCNO    R               COLHDG('Purchase' 'Contract No.')
     A                                      REFFLD(SSBACC)
     A            PURVAL    R               COLHDG('Purchase Value')
     A                                      REFFLD(SSAMT4)
     A            PURRAT    R               COLHDG('Purchase' 'CONTRACT RATE')
     A                                      REFFLD(SSPERD)
     A            CGDEM8    R               COLHDG('Date redeem' '- CAGAMAS')
     A                                      REFFLD(SSDAT8)
H001 A            CGPUR8    R               COLHDG('Date of' 'Purchase')
H001 A                                      REFFLD(SSDAT8)
H001 A            MTNITL    R               COLHDG('Mthly Instl' 'Cagamas')
H001 A                                      REFFLD(SSAMT4)
H001 A            CGQUAL    R               COLHDG('Cagamas' 'Qualify')
H001 A                                      REFFLD(SSCOD1)
     A****CGC
     A            GUARNO    R               COLHDG('Guarantee' 'No.')
H001 A*M041                                 REFFLD(SSAMTB)
M041 A                                      REFFLD(SSDESS)
     A            GUARCV    R               COLHDG('Guarantee' 'Cover')
     A                                      REFFLD(SSAMT4)
     A            PGSED8    R               COLHDG('PGS' 'Effective Date')
     A                                      REFFLD(SSDAT8)
SS26 A            CGCCLM    R               COLHDG('CGC guarantee claim')
SS26 A                                      REFFLD(SSCOD1)
H001 A            CGCSD8    R               COLHDG('Date claim' 'sub. to CGC')
H001 A                                      REFFLD(SSDAT8)
A029 A            CGCDD8    R               COLHDG('CGC Claim sub.' 'due date')
A029 A                                      REFFLD(SSDAT8)
A029 A            CGCAMT    R               COLHDG('Claim Amt.' 'recv. fr. CGC')
A029 A                                      REFFLD(SSAMT4)
A029 A            CGCRD8    R               COLHDG('Date claim' 'amt recv' +
A029 A                                      'fr CGC')
A029 A                                      REFFLD(SSDAT8)
A029 A            CGNDD8    R               COLHDG('CGC NPL' 'notification' +
A029 A                                      'due date')
A029 A                                      REFFLD(SSDAT8)
H001 A            CGNPD8    R               COLHDG('Date CGC' 'notified of NPL')
H001 A                                      REFFLD(SSDAT8)
A001 A            CAGMT8    R               COLHDG('Cagamas' 'Maturity Date')
A001 A                                      REFFLD(SSDAT8)
H001 A            CGFED8    R               COLHDG('Date fee' 'paid to CGC')
H001 A                                      REFFLD(SSDAT8)
H001 A            CGEXD8    R               COLHDG('CGC' 'Expiry Date')
H001 A                                      REFFLD(SSDAT8)
     A**DANAH HARTA
A029 A            SDANAH    R               COLHDG('Sold to' 'Danaharta' +
A029 A                                      '/Bonds(Y/N)')
A029 A                                      REFFLD(SSCOD1)
A029 A            SDAND8    R               COLHDG('Date sold' 'to Danaharta')
A029 A                                      REFFLD(SSDAT8)
A029 A            RAACD8    R               COLHDG('RAAC Expiry' 'date')
A029 A                                      REFFLD(SSDAT8)
     A*************************************************************************
M008 A* MONTHLY PAST DUE FILE - LNMDUE
     A*************************************************************************
     A            MPD1D8    R               COLHDG('1st PD' 'Notice Date')
     A                                      REFFLD(SSDAT8)
     A            MPD2D8    R               COLHDG('2nd PD' 'Notice Date')
     A                                      REFFLD(SSDAT8)
     A            MPD3D8    R               COLHDG('3rd PD' 'Notice Date')
     A                                      REFFLD(SSDAT8)
     A            MPD4D8    R               COLHDG('4th PD' 'Notice Date')
     A                                      REFFLD(SSDAT8)
     A            MPD5D8    R               COLHDG('5th PD' 'Notice Date')
     A                                      REFFLD(SSDAT8)
     A            MPD6D8    R               COLHDG('6th PD' 'Notice Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
     ** M011
     ** LNRDCT - AUTO REDUCTION SCHEDULE FILE (A/C LEVEL)
     A*************************************************************************
     A            RDARID    R               COLHDG('Record Identifier')
     A                                      REFFLD(SSCOD1)
     A            RDACCT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            RDATYP    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            RDSEQ     R               COLHDG('Sequence')
     A                                      REFFLD(SSCOU3)
     A            RDNO      R               COLHDG('No. Of' 'Reduction')
     A                                      REFFLD(SSCOU3)
     A            RDNOMD    R               COLHDG('No. Of' 'Reduction Made')
     A                                      REFFLD(SSCOU3)
     A            RDAMT     R               COLHDG('Reduction' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            RDFRQ     R               COLHDG('Reduction' 'Freq')
     A                                      REFFLD(SSCOU3)
     A            RDFRQC    R               COLHDG('Reduction' 'Freq Code')
     A                                      REFFLD(SSCOD1)
     A            RDSRT8    R               COLHDG('Start Date')
     A                                      REFFLD(SSDAT8)
     A*************************************************************************
     A** JUDGMENTS SUM FILE - LNJDSM
     A*************************************************************************
M023 A            JDARID    R               COLHDG('Record Identifier')
M023 A                                      REFFLD(SSCOD1)
  |  A            JDACNO    R               COLHDG('Account' 'Number')
  |  A                                      REFFLD(SSACCN)
  |  A            JDACTY    R               COLHDG('Account' 'Type')
  |  A                                      REFFLD(SSACCT)
  |  A            JDDT8     R               COLHDG('Judgment' 'Date')
  |  A                                      REFFLD(SSDAT8)
  |  A            JDEFD8    R               COLHDG('Judgment' 'Effective Date')
  |  A                                      REFFLD(SSDAT8)
  |  A            JDRATE    R               COLHDG('Judgment Rate')
  |  A                                      REFFLD(SSPERD)
  |  A            JDPRTN    R               COLHDG('Judgment Prime' 'Rate Nbr')
  |  A                                      REFFLD(SSRATE)
  |  A            JDPVAR    R               COLHDG('Judgment Prime' 'Variance')
  |  A                                      REFFLD(SSPERD)
  |  A            JDPVCD    R               COLHDG('Judgment Prime' 'Var Code')
  |  A                                      REFFLD(SSCOD1)
  |  A            JDPFLR    R               COLHDG('Judgment Prime' 'Rate Flr')
  |  A                                      REFFLD(SSPERD)
  |  A            JDPCEI    R               COLHDG('Judgment Prime' 'Rate Ceil')
  |  A                                      REFFLD(SSPERD)
  |  A            JDPRTM    R               COLHDG('Judgment Prime' 'Rate Term')
  |  A                                      REFFLD(SSTERM)
  |  A            JDPRTC    R               COLHDG('Judgment Prime' 'Term Code')
  |  A                                      REFFLD(SSCOD1)
  |  A            JDPRD8    R               COLHDG('Judgment Prime' 'Review Dt')
  |  A                                      REFFLD(SSDAT8)
  |  A            JDPRDY    R               COLHDG('Judgment Prm' 'Review Day')
  |  A                                      REFFLD(SSCOU2)
  |  A            JDPRN     R               COLHDG('Judgment' 'Principal')
  |  A                                      REFFLD(SSAMT4)
  |  A            JDINT     R               COLHDG('Judgment' 'Interest')
  |  A                                      REFFLD(SSAMT4)
  |  A            JDLC      R               COLHDG('Judgment' 'Late Charge')
  |  A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
  |  A            JDCF      R               COLHDG('Judgment' 'Comm Fee')
  |  A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
  |  A            JDMC      R               COLHDG('Judgment' 'Misc Costs')
  |  A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
  |  A            JDOC      R               COLHDG('Judgment' 'Other Charges')
  |  A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
  |  A            JDSUM     R               COLHDG('Judgment' 'Sum')
  |  A                                      REFFLD(SSAMT4)
  |  A            JDOSUM    R               COLHDG('Original Judgment' 'Sum')
  |  A                                      REFFLD(SSAMT4)
  |  A            JDCAWD    R               COLHDG('Judgment' 'Cost Awarded')
  |  A                                      REFFLD(SSAMT4)
     **AM01
     A            JDPRNP    R               COLHDG('Principal Pmt' 'After -
     A                                      Judgment')
     A                                      REFFLD(SSAMT4)
     A            JDINTP    R               COLHDG('Interest Pmt' 'After -
     A                                      Judgment')
     A                                      REFFLD(SSAMT4)
     A            JDLCP     R               COLHDG('Late Charge Pmt' 'After -
     A                                      Judgment')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            JDCFP     R               COLHDG('Comm Fee' 'After -
     A                                      Judgment')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            JDMCP     R               COLHDG('Misc Costs' 'After -
     A                                      Judgment')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            JDOCP     R               COLHDG('Other Charges' 'After -
     A                                      Judgment')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            JDOS      R               COLHDG('O/S Judgment Sum')
     A                                      REFFLD(SSAMT4)
     **
     A            JDPBIN    R               COLHDG('Compd. Int. -' -
     A                                      'Inc. Billed Int/Pft' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
     A            JDPBLC    R               COLHDG('Compd. Int. -' -
     A                                      'Inc. Billed LC' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
     A            JDPBCF    R               COLHDG('Compd. Int. -' -
     A                                      'Inc. Billed CF' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
     A            JDPBMC    R               COLHDG('Compd. Int. -' -
     A                                      'Inc. Billed MC' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
     A            JDPBOC    R               COLHDG('Compd. Int. -' -
     A                                      'Inc. Billed OC' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
     **=============
     A            JDLBIN    R               COLHDG('Compd. LC -' -
     A                                      'Inc. Billed Int/Pft' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
     A            JDLBLC    R               COLHDG('Compd. LC -' -
     A                                      'Inc. Billed LC' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
     A            JDLBCF    R               COLHDG('Compd. LC -' -
     A                                      'Inc. Billed CF' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
     A            JDLBMC    R               COLHDG('Compd. LC -' -
     A                                      'Inc. Billed MC' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
     A            JDLBOC    R               COLHDG('Compd. LC -' -
     A                                      'Inc. Billed OC' -
     A                                      'After Judgment')
     A                                      REFFLD(SSCOD1)
AM29 A            JDUJRL    R               COLHDG('Use Judgement' 'Rate for' -
AM29 A                                      'LC Calculation')
AM29 A                                      REFFLD(SSCOD1)
K0003A            JDCCOM    R               COLHDG('Compromise Agreement')
K0003A                                      REFFLD(SSDESS)
K0003A            JDCCOD    R               COLHDG('Compromise Agreement' +
K0003A                                      'Date')
K0003A                                      REFFLD(SSDAT8)
K0003A*K0006      JDCLGC    R               COLHDG('Undecided Case' +
K0003A*K0006                                '/Decided Case')
K0006A            JDCLGC    R               COLHDG('Undecided Case')
K0003A                                      REFFLD(SSDESS)
K0006A            JDCLDC    R               COLHDG('Decided Case')
K0006A                                      REFFLD(SSDESS)
K0003A*K0006      JDCLGD    R               COLHDG('Undecided Case Date' +
K0003A*K0006                                '/Decided Case Date')
K0006A            JDCLGD    R               COLHDG('Undecided Case Date')
K0003A                                      REFFLD(SSDAT8)
K0006A            JDCDCD    R               COLHDG('Decided Case Date')
K0006A                                      REFFLD(SSDAT8)
K0003A            JDCINC    R               COLHDG('Installment' +
K0003A                                      'Agreement')
K0003A                                      REFFLD(SSDESS)
K0003A            JDCIND    R               COLHDG('Installment' +
K0003A                                      'Agreement Date')
K0003A                                      REFFLD(SSDAT8)
K0003A*K0006      JDCLGS    R               COLHDG('Collection/Legal' +
K0003A*K0006                                'Status')
K0006A            JDCLGS    R               COLHDG('Collection Status')
K0006A                                      REFFLD(SSCOD3)
K0006A            JDLGGS    R               COLHDG('Legal Status')
K0003A                                      REFFLD(SSCOD3)
K0015A            JDGAUD    R               COLHDG('Auction Date')
K0015A                                      REFFLD(SSDAT8)
     A*************************************************************************
     A** WRITTEN OFF FILE - LNWOFF
     A*************************************************************************
M023 A            WOARID    R               COLHDG('Record Identifier')
M023 A                                      REFFLD(SSCOD1)
  |  A            WOACNO    R               COLHDG('Account' 'Number')
  |  A                                      REFFLD(SSACCN)
  |  A            WOACTY    R               COLHDG('Account' 'Type')
  |  A                                      REFFLD(SSACCT)
  |  A            WODT8     R               COLHDG('Write Off' 'Date')
  |  A                                      REFFLD(SSDAT8)
  |  A            WOAPBY    R               COLHDG('Write Off' 'Approved By')
  |  A                                      REFFLD(SSCODA)
  |  A            WOAPD8    R               COLHDG('Write Off' 'Approved Date')
  |  A                                      REFFLD(SSDAT8)
  |  A            WOPRN     R               COLHDG('Write Off' 'Principal')
  |  A                                      REFFLD(SSAMT4)
  |  A            WOIRB     R               COLHDG('Write Off' 'Int Rebate')
  |  A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
  |  A            WOINT     R               COLHDG('Write Off' 'Interest')
  |  A                                      REFFLD(SSAMT4)
  |  A            WOLC      R               COLHDG('Write Off' 'Late Charge')
  |  A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
  |  A            WOCF      R               COLHDG('Write Off' 'Comm Fee')
  |  A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
  |  A            WOMC      R               COLHDG('Write Off' 'Misc Costs')
  |  A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
  |  A            WOOC      R               COLHDG('Write Off' 'Other Charges')
  |  A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
  |  A            WOAMT     R               COLHDG('Total Write Off' 'Amount')
  |  A                                      REFFLD(SSAMT4)
R1001A            WOREAS    R               COLHDG('Write-Off' 'Reason')
R100cA                                      REFFLD(SSCOD4)
     A*************************************************************************
M034 A* Interset repayment schedule - LNIRSC
     A*************************************************************************
M034 A            LIRRID    R               COLHDG('Record Identifier')
M034 A                                      REFFLD(SSCOD1)
M034 A            LIRACN    R               COLHDG('Account No.')
M034 A                                      REFFLD(SSACCN)
M034 A            LIRACT    R               COLHDG('Account type')
M034 A                                      REFFLD(SSACCT)
M034 A            LIRBIL    R               COLHDG('Billed')
M034 A                                      REFFLD(SSCOD1)
M034 A            LIRAMT    R               COLHDG('Interest Amount')
M034 A                                      REFFLD(SSAMT4)
M034 A            LIREF8    R               COLHDG('Effective Date')
M034 A                                      REFFLD(SSDAT8)
     A*
     A*************************************************************************
M038 ** LNPPPA - A/C Syn Priciple/Interest Period File
     A*************************************************************************
M038 **
M038 A            LPARID    R               COLHDG('Record Identifier')
M038 A                                      REFFLD(SSCOD1)
M038 A*defined    LPACCT    R               COLHDG('Account' 'Number')
M038 A*                                     REFFLD(SSACCN)
M038 A*           LPACTY    R               COLHDG('Account' 'Type')
M038 A*                                     REFFLD(SSACCT)
M038 A            LPTERM    R               COLHDG('Interest' 'Period')
M038 A                                      REFFLD(SSTU05)
M038 A            LPTCOD    R               COLHDG('Interest' 'Period Code')
M038 A                                      REFFLD(SSCOD1)
M038 *
     A*************************************************************************
M038 A* INCOME DISTRIBUTION FILE - LNINCD
     A*************************************************************************
M038 A*
M038 A            IDRDID    R               COLHDG('Record Identifier')
M038 A                                      REFFLD(SSCOD1)
M038 A            IDACCT    R               COLHDG('Account' 'Number')
M038 A                                      REFFLD(SSACCN)
M038 A            IDATYP    R               COLHDG('Account' 'Type')
M038 A                                      REFFLD(SSACCT)
M038 A            IDMSOC    R               COLHDG('Misc/Oth Chg' 'Code')
M038 A                                      REFFLD(SSCOD1)
M038 A            IDCTYP    R               COLHDG('Charge' 'Type')
M038 A                                      REFFLD(SSCOD2)
M038 A            IDSEQN    R               COLHDG('Sequence' 'Number')
M038 A                                      REFFLD(SSCOU3)
M038 A            IDDISC    R               COLHDG('Total' 'Charges Debit')
M038 A                                      REFFLD(SSAMT4)
M038 A            IDDSCC    R               COLHDG('Current' 'Charges Debit')
M038 A                                      REFFLD(SSAMT4)
M038 A            IDREBT    R               COLHDG('Unearned' 'Charges')
M038 A                                      REFFLD(SSAMT4)
M038 A            IDYSRB    R               COLHDG('Yesterday' 'Unearned Chg')
M038 A                                      REFFLD(SSAMT4)
M038 A            IDMTDE    R               COLHDG('Month Todate' 'Earned')
M038 A                                      REFFLD(SSAMT4)
M038 A            IDYTDE    R               COLHDG('Year Todate' 'Earned')
M038 A                                      REFFLD(SSAMT4)
M038 A            IDLTDE    R               COLHDG('Life Todate' 'Earned')
M038 A                                      REFFLD(SSAMT4)
M038 A            IDSTR8    R               COLHDG('Distribution' 'Start Date')
M038 A                                      REFFLD(SSDAT8)
M038 A            IDEND8    R               COLHDG('Distribution' 'End Date')
M038 A                                      REFFLD(SSDAT8)
K0003A            IDSEND    R               COLHDG('Send Code')
K0003A                                      REFFLD(SSYON)
K0010A            IDDRMK    R               COLHDG('Delete' 'Reason')
K0010A                                      REFFLD(SSDESS)
K0010A            IDDDTE    R               COLHDG('Delete' 'Date')
K0010A                                      REFFLD(SSDAT8)
K0010A            IDPRIN    R               COLHDG('Principal Base' +
K0010A                                      'For Calculate Fee')
K0010A                                      REFFLD(SSAMT4)
K0014A            IDDRAT    R               COLHDG('Fee Rate%')
K0014A                                      REFFLD(SSPERD)
K0014A            IDDPRN    R               COLHDG('Principle Coverage')
K0014A                                      REFFLD(SSAMT4)
K0014A            IDDPOC    R               COLHDG('Policy Number')
K0014A                                      REFFLD(SSDESS)
     A*************************************************************************
M038 A* INCOME DISTRIBUTION BY MANAGER FILE - LNINCM
     A*************************************************************************
M038 A*
M038 A            IMRDID    R               COLHDG('Record Identifier')
M038 A                                      REFFLD(SSCOD1)
M038 A            IMACCT    R               COLHDG('Account' 'Number')
M038 A                                      REFFLD(SSACCN)
M038 A            IMATYP    R               COLHDG('Account' 'Type')
M038 A                                      REFFLD(SSACCT)
M038 A            IMMSOC    R               COLHDG('Misc/Oth Chg' 'Code')
M038 A                                      REFFLD(SSCOD1)
M038 A            IMCTYP    R               COLHDG('Charge' 'Type')
M038 A                                      REFFLD(SSCOD2)
M038 A            IMMICD    R               COLHDG('MIC Code')
M038 A                                      REFFLD(SSCOD5)
M038 A            IMMFEP    R               COLHDG('MIC Fee %')
M038 A                                      REFFLD(SSPERD)
M038 A*
     A*************************************************************************
M038 A* BANK GUARANTEE FILE - LNBGBA
     A*************************************************************************
M038 A            BGRDID    R               COLHDG('Record Identifier')
M038 A                                      REFFLD(SSCOD1)
M038 A            BGACCT    R               COLHDG('Account' 'Number')
M038 A                                      REFFLD(SSACCN)
M038 A            BGATYP    R               COLHDG('Account' 'Type')
M038 A                                      REFFLD(SSACCT)
M038 A            BGBANO    R               COLHDG('Bank Guarantee' 'No.')
M038 A                                      REFFLD(SSBACC)
M038 A            BGTYPE    R               COLHDG('Bank Guarantee Type')
M038 A                                      REFFLD(SSCOD2)
M038 A            BGBENF    R               COLHDG('Beneficially' 'CIF No')
M038 A                                      REFFLD(SSCIFN)
M038 A            BGONBO    R               COLHDG('On Behalf Of' 'CIF No')
M038 A                                      REFFLD(SSCIFN)
M038 A            BGISST    R               COLHDG('BG issuance status')
M038 A                                      REFFLD(SSCOD1)
AM25 A            BGISD8    R               COLHDG('Issuance Date')
AM25 A                                      REFFLD(SSDAT8)
M038 A            BGCLST    R               COLHDG('BG cancellation' 'Status')
M038 A                                      REFFLD(SSCOD1)
M038 A            BGCLD8    R               COLHDG('Cancelation''Date')
M038 A                                      REFFLD(SSDAT8)
M038 A            BGLSD8    R               COLHDG('Last claim date')
M038 A                                      REFFLD(SSDAT8)
M038 A**          BGCVFC    R               COLHDG('Conversion factor')
M038 A**                                    REFFLD(SSPERP)
AM03 A            BGCAAM    R               COLHDG('Called Amount')
AM03 A                                      REFFLD(SSAMT4)
AM03 A            BGCAD8    R               COLHDG('Called date')
AM03 A                                      REFFLD(SSDAT8)
AM10 A            BGLTD8    R               COLHDG('Called Letter date')
AM10 A                                      REFFLD(SSDAT8)
AM10 A            BGLRD8    R               COLHDG('Called Letter' 'Recv Date')
AM10 A                                      REFFLD(SSDAT8)
AM26 A            BGORT8    R               COLHDG('Original Return Date')
AM26 A                                      REFFLD(SSDAT8)
     A*************************************************************************
AM01 ** Loan Purpose Codec parameter           - LNPURC
     A*************************************************************************
     A            LPCACC    R               COLHDG('Account Number')
     A                                      REFFLD(SSACCN)
     A            LPCATP    R               COLHDG('Account Type')
     A                                      REFFLD(SSACCT)
     A            LPCCOD    R               COLHDG('Purpose Code')
     A                                      REFFLD(SSCOD2)
     A            LPCPCT    R               COLHDG('Purpose Percentage')
     A                                      REFFLD(SSPERD)
     A*************************************************************************
AM01 ** Bulk Partial Write-off File            - LNBWOF
     A*************************************************************************
     A            BWARID    R               COLHDG('Record Identifier')
     A                                      REFFLD(SSCOD1)
     A            BWACNO    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            BWACTY    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     **
     A            BWOFID    R               COLHDG('Part/Write off' 'Indicator')
     A                                      REFFLD(SSCOD1)
     A            BWOFAC    R               COLHDG('Part/Write off' 'A/C')
     A                                      REFFLD(SSACCN)
     **
     A            BWODT8    R               COLHDG('Write Off' 'Date')
     A                                      REFFLD(SSDAT8)
     A            BWAPBY    R               COLHDG('Write Off' 'Approved By')
     A                                      REFFLD(SSCODA)
     A            BWAPD8    R               COLHDG('Write Off' 'Approved Date')
     A                                      REFFLD(SSDAT8)
     A            BWPRN     R               COLHDG('Write Off' 'Principal')
     A                                      REFFLD(SSAMT4)
     A            BWIRB     R               COLHDG('Write Off' 'Int Rebate')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BWINT     R               COLHDG('Write Off' 'Interest')
     A                                      REFFLD(SSAMT4)
     A            BWLC      R               COLHDG('Write Off' 'Late Charge')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BWCF      R               COLHDG('Write Off' 'Comm Fee')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BWMC      R               COLHDG('Write Off' 'Misc Costs')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BWOC      R               COLHDG('Write Off' 'Other Charges')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            BWAMT     R               COLHDG('Total Write Off' 'Amount')
     A                                      REFFLD(SSAMT4)
R1003A            BWRCOD    R               COLHDG('Write Off' 'Reason Code')
R1003A                                      REFFLD(SSCOD4)
     A*************************************************************************
AM01 ** Bulk Partial Write-off File            - LNBEXP
     A*************************************************************************
     A            BWEDES    R               COLHDG('Error' 'Description')
     A                                      REFFLD(SSDESC)
     A*************************************************************************
     A** INTEREST PAYMENT FUTURE FILE / SCHEDULE FIXED INTEREST PAYMENT
AM01 A** - LNPMTI
     A*************************************************************************
     A            LIFRID    R               COLHDG('Record Identifier')
     A                                      REFFLD(SSCOD1)
     A            LIFACT    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LIFATY    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            LIFED8    R               COLHDG('Pmt effective' 'Date 6')
     A                                      REFFLD(SSDAT8)
     A            LIFNAM    R               COLHDG('New Int Pmt' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LIFNPC    R               COLHDG('New Int Pmt' '%')
     A                                      REFFLD(SSPERD)
     A*************************************************************************
AM03 A** LNDBNH - LOAN DEBIT NOTE HEADER
     A*************************************************************************
     **
     A            DNHNRD    R               COLHDG('Record Identifier')
     A                                      REFFLD(SSCOD1)
     A            DNHACN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            DNHACT    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            DNHMNO    R               COLHDG('Main Account' 'Number')
SS13 A                                      REFFLD(SSTMNO)
     A            DNHLLL    R               COLHDG('Lender In' 'Syndication Ln')
SS23 A                                      REFFLD(SSTLLL)
     A            DNHDDD    R               COLHDG('Drawdown' 'Sequence Number')
SS23 A                                      REFFLD(SSTDDD)
     A            DNHDNO    R               COLHDG('Debit Note No')
     A                                      REFFLD(SSCOU9)
AM14 A            DNHSTS    R               COLHDG('Status')
AM14 A                                      REFFLD(SSCOD1)
     A            DNHDU8    R               COLHDG('Due Date')
     A                                      REFFLD(SSDAT8)
     A            DNHAMT    R               COLHDG('Total' 'Billed amount')
     A                                      REFFLD(SSAMT4)
     A            DNHAMO    R               COLHDG('Total Billed' 'O/S amount')
     A                                      REFFLD(SSAMT4)
     *
     A*************************************************************************
AM03 A** LNDBND - LOAN DEBIT NOTE DETAIL
     A*************************************************************************
     **
     A            DNDNRD    R               COLHDG('Record Identifier')
     A                                      REFFLD(SSCOD1)
     A            DNDACN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            DNDACT    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            DNDMNO    R               COLHDG('Main Account' 'Number')
SS13 A                                      REFFLD(SSTMNO)
     A            DNDLLL    R               COLHDG('Lender In' 'Syndication Ln')
SS23 A                                      REFFLD(SSTLLL)
     A            DNDDDD    R               COLHDG('Drawdown' 'Sequence Number')
SS23 A                                      REFFLD(SSTDDD)
     A            DNDDNO    R               COLHDG('Debit Note No.')
     A                                      REFFLD(SSCOU9)
     A            DNDDU8    R               COLHDG('Due Date')
     A                                      REFFLD(SSDAT8)
     A            DNDSEQ    R               COLHDG('Debit Note Seq')
     A                                      REFFLD(SSCOU5)
     A            DNDSTS    R               COLHDG('Status')
     A                                      REFFLD(SSCOD1)
     A            DNDBTP    R               COLHDG('Billed Type')
     A                                      REFFLD(SSCOD2)
     A            DNDCTP    R               COLHDG('Charge type')
     A                                      REFFLD(SSCOD2)
     A            DNDCCD    R               COLHDG('Charge To' 'Misc/Othchg')
     A                                      REFFLD(SSCOD1)
     A            DNDAMT    R               COLHDG('Billed amount')
     A                                      REFFLD(SSAMT4)
     A            DNDAMO    R               COLHDG('Billed' 'O/S amount')
     A                                      REFFLD(SSAMT4)
     A            DNDBOA    R               COLHDG('Based on Amount')
     A                                      REFFLD(SSAMT4)
     A            DNDFD8    R               COLHDG('From Date')
     A                                      REFFLD(SSDAT8)
     A            DNDTD8    R               COLHDG('To date')
     A                                      REFFLD(SSDAT8)
     A**          DNDDAY    R               COLHDG('No of day')
     A**                                    REFFLD(SSCOU5)
     A            DNDYBS    R               COLHDG('Year Base')
     A                                      REFFLD(SSCOU1)
     A            DNDRTC    R               COLHDG('Rate Charge')
     A                                      REFFLD(SSPERD)
     *
     A*************************************************************************
AM07 A** LNDBND - LOAN DEBIT NOTE DETAIL
     A*************************************************************************
     A            DNNBKN    R               COLHDG('Bank No')
     A                                      REFFLD(SSBANK)
     A            DNNBRN    R               COLHDG('Branch No')
     A                                      REFFLD(SSBRAN)
     A            DNNLNO    R               COLHDG('Last' 'Debit Note No')
     A                                      REFFLD(SSSEQ)
     **
     A*************************************************************************
AM16 A** LNRRST - Restructure/Reschedule Statistic Info File
     A*************************************************************************
     A            RRSACN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            RRSACT    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            RRSMAP    R               COLHDG('Management Approving' -
     A                                      'Authority')
     A                                      REFFLD(SSOFFC)
     A            RRSMD8    R               COLHDG('Management Appr date')
     A                                      REFFLD(SSDAT8)
     A            APRBNM    R               COLHDG('Appr. by' ' BNM, reschd>2' -
     A                                      'in a year')
     A                                      REFFLD(SSCOD1)
     A            APRDT8    R               COLHDG('Apr. by' 'BNM date,' -
     A                                      'reschd>2 yr')
     A                                      REFFLD(SSDAT8)
     A            APAKPK    R               COLHDG('Agensi Kaunseling' -
     A                                      '& Pengurusan Kredit')
     A                                      REFFLD(SSCOD1)
     A*************************************************************************
AM19 A* LNNOTG - General Number Type File
     A*************************************************************************
     A            LGBNKN    R               COLHDG('Bank' 'Number')
     A                                      REFFLD(SSBANK)
     A            LGBRNN    R               COLHDG('Branch' 'Number')
     A                                      REFFLD(SSBRAN)
     A            LGNTYP    R               COLHDG('Number Type')
     A                                      REFFLD(SSCODA SILVERLAKE)
     A            LGBNUM    R               COLHDG('Batch No')
     A                                      REFFLD(SSCOU9)
     A*************************************************************************
SS07 A* LNDLPF - Loan Dealer Performance
     A*************************************************************************
SS07 A            LDMBRN    R               COLHDG('Main Branch')
SS07 A                                      REFFLD(SSBRAN)
SS07 A            LDSBRN    R               COLHDG('Sub Branch')
SS07 A                                      REFFLD(SSBRAN)
SS07 A            LDYEAR    R               COLHDG('Financial Year')
SS07 A                                      REFFLD(SSDAT4)
SS07 A            LDMONT    R               COLHDG('Month')
SS07 A                                      REFFLD(SSDAT2)
SS07 A            LDTAPR    R               COLHDG('Total Approval' 'Amount')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDTREJ    R               COLHDG('Total Rejected' 'Amount')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDTCAN    R               COLHDG('Total Cancelled' 'Amount')
SS07 A                                      REFFLD(SSAMT4)
     A*************************************************************************
     A*
SS12 A* LNDSCP - Dealer/Salesman Commission Payment Master File
     A*************************************************************************
SS12 A            LDCREC    R               COLHDG('Record Identifier')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDCCOT    R               COLHDG('Commission Type')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDCREF    R               COLHDG('Comm Reference' 'Number')
SS12 A*R1011                                REFFLD(SSCODB)
R1011A                                      REFFLD(SSCODA)
SS12 A            LDCPYM    R               COLHDG('Commission Paym' 'Method')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDCPMD    R               COLHDG('Commission Paym Mode')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDCFC8    R               COLHDG('First Commission ' +
SS12 A                                      'Paym Date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDCNC8    R               COLHDG('Next Commission ' +
SS12 A                                      'Paym Date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDCPDY    R               COLHDG('Commission Paym Day')
SS12 A                                      REFFLD(SSCOU2)
SS12 A            LDCPFR    R               COLHDG('Commission Paym Freq')
SS12 A                                      REFFLD(SSCOU3)
SS12 A            LDCPFC    R               COLHDG('Commission Paym ' +
SS12 A                                                'Freq Code')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDCODA    R               COLHDG('Outward DDA A/c' 'Number')
SS12 A                                      REFFLD(SSCOUJ)
SS12 A            LDCODT    R               COLHDG('Outward DDA A/c Type')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDCOGA    R               COLHDG('Outward GIRO A/c' 'Number')
SS12 A                                      REFFLD(SSCODJ)
SS12 A            LDCOGT    R               COLHDG('Outward GIRO A/c' 'Type')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDCABK    R               COLHDG('ACH Bank')
SS12 A                                      REFFLD(SSBANK)
SS12 A            LDCABR    R               COLHDG('ACH Branch')
SS12 A                                      REFFLD(SSBRAN)
SS12 A            LDCLV8    R               COLHDG('Last Value Date')
SS12 A                                      REFFLD(SSDAT8)
     A*************************************************************************
SS12 A* LNDSCM - Dealer/Salesman Commission File by Account
     A*************************************************************************
SS12 A            LACREC    R               COLHDG('Record Identifier')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LACACN    R               COLHDG('Account No (K)')
SS12 A                                      REFFLD(SSACCN)
SS12 A            LACATP    R               COLHDG('Account Type (K)')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LACCMT    R               COLHDG('Comm Type (K)')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LACREF    R               COLHDG('Reference No (K)')
SS12 A*R1011                                REFFLD(SSCODB)
R1011A                                      REFFLD(SSCODA)
SS12 A            LACPYF    R               COLHDG('Comm Payable Flag')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LACCRT    R               COLHDG('Commission Rate')
SS12 A                                      REFFLD(SSPERD)
SS12 A            LACFAM    R               COLHDG('Comm Fixed Amt')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LACCOM    R               COLHDG('Total Comm Amt' +
SS12 A                                                '(exclude GST)')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LACGST    R               COLHDG('GST Comm Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LACCPD    R               COLHDG('Comm Paid (LTD)')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LACLM8    R               COLHDG('Last Maint date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LACSD8    R               COLHDG('Creation Date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LACCD8    R               COLHDG('Created' 'Date')
SS12 A                                      REFFLD(SSDAT8)
     A*************************************************************************
SS12 A
SS17 A* ACCOUNT LEVEL-PRICING PACKAGE FILE - LNACPG
     A*************************************************************************
SS17 A            AASEQ     R               COLHDG('Sequence' 'Number')
SS17 A                                      REFFLD(SSACCN)
R1001A            AASEQP    R               COLHDG('Tier' 'Posting Seq')
R1001A                                      REFFLD(SSCOU3)
R1001A            AATLMT    R               COLHDG('Tier Limit')
R1001A                                      REFFLD(SSAMT4)
SS17 A            AAPCOD    R               COLHDG('Package' 'Code')
SS17 A                                      REFFLD(SSCOD3)
SS17 A            AATERM    R               COLHDG('Package' 'Term')
SS17 A                                      REFFLD(SSTERM)
SS17 A            AATMCD    R               COLHDG('Package' 'term Code')
SS17 A                                      REFFLD(SSCOD1)
R1001A            AAINTT    R               COLHDG('Interest Rate Type')
R1001A                                      REFFLD(SSCODA)
SS17 A            APRATN    R               COLHDG('Rate' 'Number')
SS17 A                                      REFFLD(SSRATE)
SS17 A            APRAVI    R               COLHDG('Rate' 'Variance')
SS17 A                                      REFFLD(SSPERD)
R1001A            AAFDRT    R               COLHDG('Tied to' 'Deposit A/C')
R1001A                                      REFFLD(SSCOD1)
R1001A            AAYBSE    R               COLHDG('Year base')
R1001A                                      REFFLD(SSCOU1)
R1001A            AARSTM    R               COLHDG('Rest Method')
R1001A                                      REFFLD(SSCOD1)
R1001A            AAPMCD    R               COLHDG('Upd When Pmtcod' 'Auto Chg')
R1001A                                      REFFLD(SSCOD1)
     A*************************************************************************
SS06 ** Archive data history - LNARCH
     A*************************************************************************
     A            ARPRST    R               COLHDG('Record' 'status')
     A                                      REFFLD(SSREID)
     A            ARPFIL    R               COLHDG('File' 'name')
     A                                      REFFLD(SSNAME)
     A            ARPKYV    R               COLHDG('Record' 'key')
     A                                      REFFLD(SSRKEY)
     A            ARPDT8    R               COLHDG('Date of' 'maintenance')
     A                                      REFFLD(SSDAT8)
     A            ARPTIM    R               COLHDG('Time' 'change' 'made')
     A                                      REFFLD(SSTIM6)
     A            ARPUID    R               COLHDG('User ID')
     A                                      REFFLD(SSNAME)
     A            ARPWID    R               COLHDG('Workstation ID')
     A                                      REFFLD(SSNAME)
     A            ARSUPV    R               COLHDG('Supervisor ID')
     A                                      REFFLD(SSNAME)
     A            ARPJNO    R               COLHDG('Job number')
     A                                      REFFLD(SSCOD6)
     A            ARPPGM    R               COLHDG('Change' 'program' 'name')
     A                                      REFFLD(SSNAME)
     A            ARPSQN    R               COLHDG('Maintenance' 'sequence')
     A                                      REFFLD(SSCOUB)
     A            ARAPCD    R               COLHDG('App' 'code')
     A                                      REFFLD(SSCOD2)
     A            ARABNK    R               COLHDG('Account' 'Bank')
     A                                      REFFLD(SSBANK)
     A            ARTBNK    R               COLHDG('Maintenance' -
     A                                      'Bank')
     A                                      REFFLD(SSBANK)
     A            ARABRN    R               COLHDG('Account' 'branch')
     A                                      REFFLD(SSBRAN)
     A            ARTBRN    R               COLHDG('Maintenance' -
     A                                      'branch')
     A                                      REFFLD(SSBRAN)
     A            ARRESN    R               COLHDG('Reason' 'code')
     A                                      REFFLD(SSCOD2)
     A            ARREMK    R               COLHDG('Remarks')
     A                                      REFFLD(SSDESC)
     A*************************************************************************
SS06 ** Archive structure - LNARCS
     A            ARFMID    R               COLHDG('Format' 'level' -
     A                                      'identifier')
     A                                      REFFLD(SSCODD)
     A*************************************************************************
SS26 ** Agensi Kaunseling & Pengurusan Kredit - LNAKPK
     A*************************************************************************
     A            AKREID    R               COLHDG('Record Indentifier')
     A                                      REFFLD(SSREID)
     A            AKACCT    R               COLHDG('Account Number')
     A                                      REFFLD(SSACCN)
     A            AKACTY    R               COLHDG('Account Type')
     A                                      REFFLD(SSACCT)
     A            AKSTD8    R               COLHDG('Start Date')
     A                                      REFFLD(SSDAT8)
     A            AKEND8    R               COLHDG('End Date')
     A                                      REFFLD(SSDAT8)
     A            AKREM1    R               COLHDG('Remark 1')
     A                                      REFFLD(SSDESM)
     A            AKREM2    R               COLHDG('Remark 2')
     A                                      REFFLD(SSDESM)
     A*************************************************************************
SS26 ** Banks involved in AKPK - LNAKPD
     A*************************************************************************
     A            AKDRID    R               COLHDG('Record Indentifier')
     A                                      REFFLD(SSREID)
M011 A            CADDID    R               COLHDG('Document' 'ID')
M011 A                                      REFFLD(SSACCN)
     A            AKDACN    R               COLHDG('Account Number')
     A                                      REFFLD(SSACCN)
     A            AKDACT    R               COLHDG('Account Type')
     A                                      REFFLD(SSACCT)
     A            AKDSD8    R               COLHDG('Start Date')
     A                                      REFFLD(SSDAT8)
     A            AKDBNK    R               COLHDG('Involved Bank ID')
     A                                      REFFLD(SSCODC)
     A*************************************************************************
     A* DOCUMENT MASTER - ACCOUNT INDEX - LNDCAI/LNDCCI/LNDCFI/LNDOCM
     A*************************************************************************
     A            LDCRID    R               COLHDG('Record' 'Identifier')
     A                                      REFFLD(SSCOD1)
     A            LDCUID    R               COLHDG('User ID')
     A                                      REFFLD(SSCODA)
     A            LDCWID    R               COLHDG('Workstation ID')
     A                                      REFFLD(SSCODA)
     A            LDCDT8    R               COLHDG('Last Maint' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LDCTIM    R               COLHDG('Last Maint' 'Time')
     A                                      REFFLD(SSTIM6)
     A            LDICID    R               COLHDG('Created' 'User')
     A                                      REFFLD(SSCODA)
     A            LDICD8    R               COLHDG('Created' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LDICTM    R               COLHDG('Created' 'Time')
     A                                      REFFLD(SSTIM6)
     A*************************************************************************
SS26 A* STATISTIC HISTORY - LNHSTS
     A*************************************************************************
     A            LHSACN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            LHSACT    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSCOD1)
     A            LHSPT8    R               COLHDG('Posting' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LHSPOR    R               COLHDG('Posting' 'Order')
     A                                      REFFLD(SSCOU5)
     A            LHSEF8    R               COLHDG('Effective' 'Date')
     A                                      REFFLD(SSDAT8)
     A            LHSTRN    R               COLHDG('Tran' 'Code')
     A                                      REFFLD(SSTRAN)
     A            LHSAFT    R               COLHDG('Affects' 'Code')
     A                                      REFFLD(SSCOD2)
     A            LHSSRC    R               COLHDG('Input' 'Source')
     A                                      REFFLD(SSCOD1)
     A            LHSTRM    R               COLHDG('Statistic Remark')
     A                                      REFFLD(SSDESM)
     A            LHSOVN    R               COLHDG('Old Value' 'Numeric')
     A                                      REFFLD(SSACCN)
     A            LHSNVN    R               COLHDG('New Value' 'Numeric')
     A                                      REFFLD(SSACCN)
     A            LHSOVC    R               COLHDG('Old Value' 'Character')
     A                                      REFFLD(SSCODA)
     A            LHSNVC    R               COLHDG('New Value' 'Character')
     A                                      REFFLD(SSCODA)
     A            LHSCID    R               COLHDG('CREATED' 'USER')
     A                                      REFFLD(SSCODA)
     A            LHSCD8    R               COLHDG('CREATED' 'DATE')
     A                                      REFFLD(SSDAT8)
     A            LHSCTM    R               COLHDG('CREATED' 'TIME')
     A                                      REFFLD(SSTIM6)
     A            LHSCRT    R               COLHDG('CREATED' 'TIME')
     A                                      REFFLD(SSTIM6)
     A            LHSSTM    R               COLHDG('SYSTEM' 'TIME')
     A                                      REFFLD(SSTIM6)
     A*************************************************************************
     A* MESSAGE - LNMESG
     A*************************************************************************
     A            CFMSID    R               COLHDG('Identifier')
     A                                      REFFLD(SSREID)
V001 A*           CFATYP    R
V001 A*           CFACCN    R
     A            CFMSEQ    R               COLHDG('Sequence' 'number')
V001 A                                      REFFLD(SSCOU5)
     A**V002      CFCOLM    R
     A*                                     REFFLD(SSCOD1)
     A*                                     COLHDG('Collateral' 'code')
     A            CFMSG     R               COLHDG('Message')
V501 A***                                   REFFLD(SSMSG1)
V501 A                                      REFFLD(SSDESX)
V501 A                                      VARLEN(50)
M003 A            CFMMSG    R               COLHDG('Message')
M003 A                                      REFFLD(SSDESX)
     A            CFMSG2    R               COLHDG('Message 2')
     A                                      REFFLD(SSMSG1)
     A            CFMSG3    R               COLHDG('Message 3')
     A                                      REFFLD(SSMSG1)
     A            CFMSG4    R               COLHDG('Message 4')
     A                                      REFFLD(SSMSG1)
     A            CFMSG5    R               COLHDG('Message 5')
     A                                      REFFLD(SSMSG1)
     A            CFMUIC    R               COLHDG('Message' 'type code')
     A                                      REFFLD(SSCOD3)
     A            CFMSEV    R               COLHDG('Message' 'severity')
     A                                      REFFLD(SSCOU3)
     A            CFEXP8    R               COLHDG('Expiration' 'Date')
     A                                      REFFLD(SSDAT8)
     A                                      TEXT('Message expiration date')
     A            CFMPD8    R               COLHDG('Placed' 'Date')
     A                                      REFFLD(SSDAT8)
     A                                      TEXT('Message placed date')
V001 A            CFMIND    R               COLHDG('Mesg attd to' 'Indicator')
     A                                      REFFLD(SSYON)
V001 A            CFUSID    R               COLHDG('Mesg attd to' 'by user Id')
     A                                      REFFLD(SSNAME)
     A            CFACCN    R               COLHDG('Account' 'Number')
     A                                      REFFLD(SSACCN)
     A            CFACTY    R               COLHDG('Account' 'type')
     A                                      REFFLD(SSACCT)
     A            CFCIFN    R               COLHDG('Customer' 'number')
     A                                      REFFLD(SSCIFN)
     A*************************************************************************
SS88 A* LOAN TO DEPOSIT TRANSACTION FILE - LNDDTR
     A*************************************************************************
     A            TNACCT    R               COLHDG('ACCOUNT' 'NUMBER')
     A                                      REFFLD(SSACCN)
     A            TNATYP    R               COLHDG('ACCOUNT' 'TYPE')
     A                                      REFFLD(SSCOD1)
     A            TNEFF8    R               COLHDG('EFFECTIVE DATE')
     A                                      REFFLD(SSDAT8)
     A            TNDORC    R               COLHDG('DEBIT/CREDIT' 'CODE')
     A                                      REFFLD(SSCOD1)
     A            TNAFFT    R               COLHDG('AFFECT CODE')
     A                                      REFFLD(SSCOD2)
     A            TNTRAN    R               COLHDG('TRANSACTION' 'CODE')
     A                                      REFFLD(SSTRAN)
     A            TNAMT     R               COLHDG('ACCOUNT' 'AMOUNT')
     A                                      REFFLD(SSAMT4)
     A            TNBKN     R               COLHDG('ACCOUNT' 'BANK')
     A                                      REFFLD(SSBANK)
     A            TNBRN     R               COLHDG('ACCOUNT' 'BRANCH')
     A                                      REFFLD(SSBRAN)
     A            TNDESC    R               COLHDG('DESCRIPTION')
     A                                      REFFLD(SSDESM)
     A*************************************************************************
SS26 A* LNRVRS  - Loan Reversed Transaction History
     A*************************************************************************
     A**          LHACCT    R               COLHDG('Account' 'Number')
     A**                                    REFFLD(SSACCN)
     A**          LHATYP    R               COLHDG('Account' 'Type')
     A**                                    REFFLD(SSCOD1)
     A**          LHPST8    R               COLHDG('Posting' 'Date')
     A**                                    REFFLD(SSDAT8)
     A**          LHSEQN    R               COLHDG('Sequence' 'Number')
     A**                                    REFFLD(SSCOU9)
     A**          LHDORC    R               COLHDG('Dr/Cr' 'Code')
     A**                                    REFFLD(SSCOD1)
     A**          LHAFFT    R               COLHDG('Affects' 'Code')
     A**                                    REFFLD(SSCOD2)
     A**          LHAMT     R               COLHDG('Transaction' 'Amount')
     A**                                    REFFLD(SSAMT4)
     A**          LHCCID    R               COLHDG('CREATED' 'USER')
     A**                                    REFFLD(SSCODA)
     A**          LHCCD8    R               COLHDG('CREATED' 'DATE')
     A**                                    REFFLD(SSDAT8)
     A**          LHCCTM    R               COLHDG('CREATED' 'TIME')
     A**                                    REFFLD(SSTIM6)
     A**          LHSTIM    R               COLHDG('SYSTEM' 'TIME')
     A**                                    REFFLD(SSTIM6)
     A*************************************************************************
SS31 A* LNCYCL - OD STATEMENT AND INTEREST DEBITING CYCLE FILE
     A*************************************************************************
     A            LCYACT    R               REFFLD(SSACCN)
     A                                      COLHDG('Account' 'Number')
     A            LCYTYP    R               REFFLD(SSACCT)
     A                                      COLHDG('Account' 'Type')
R1047A            LCYDT8    R               REFFLD(SSDAT8)
R1047A                                      COLHDG('Cycle Date')
     A            LCYDDA    R               REFFLD(SSACCN)
     A                                      COLHDG('DD Account' 'Number')
     A            LCYDDT    R               REFFLD(SSACCT)
     A                                      COLHDG('DD Account' 'Type')
     A            LCYDDB    R               REFFLD(SSAMT5)
     A                                      COLHDG('DD Balance')
     A*************************************************************************
SS31 A* LNTCFH - TIER COMMITMENT FEE HISTORY FILE
     A*************************************************************************
     A            LTCFAC    R               REFFLD(SSACCN)
     A                                      COLHDG('Account number')
     A            LTCFAT    R               REFFLD(SSACCT)
     A                                      COLHDG('Account Type')
     A            LTCFD8    R               REFFLD(SSDAT8)
     A                                      COLHDG('Date changed')
     A            LTCFBL    R               REFFLD(SSAMT5)
     A                                      COLHDG('Tier CF balance')
     A            LTCFRT    R               REFFLD(SSPERD)
     A                                      COLHDG('Tier CF rate')
     A*************************************************************************
SS31 A* LNCFRT - CIF RATING - SECURITY COVER
     A*************************************************************************
     A            LNACCT    R               REFFLD(SSACCN)
     A                                      COLHDG('Account' 'Number')
     A            LNMONT    R               REFFLD(SSCOU6)
     A                                      COLHDG('Processing Month')
     A            LNOSBL    R               REFFLD(SSAMT4)
     A                                      COLHDG('Outstanding' 'Balance')
     A            LNTNRV    R               REFFLD(SSAMT4)
     A                                      COLHDG('Total Net Realizable'-
     A                                             'Value')
     A            LNNETX    R               REFFLD(SSAMT4)
     A                                      COLHDG('Net Exposure')
     A            LNNRVP    R               REFFLD(SSPERD)
     A                                      COLHDG('Shortfall of NRV %')
     A*************************************************************************
SS31 A* LNLRDC - REDUCTION SCHD FILE
     A*************************************************************************
     A            LRACCN    R               REFFLD(SSACCN)
     A                                      COLHDG('Account Number')
     A            LRATYP    R               REFFLD(SSACCT)
     A                                      COLHDG('Account Type')
     A            LRTSEQ    R               REFFLD(SSSEQ)
     A                                      COLHDG('Sequence' 'Number')
     A            LRTSSQ    R               REFFLD(SSSEQ)
     A                                      COLHDG('Reduction' 'Seq No.')
     A**          LRRDT8    R               REFFLD(SSDAT8)
     A**                                    COLHDG('Reduction Date')
     A            LRSLD8    R               REFFLD(SSDAT8)
     A                                      COLHDG('Last' 'Reduction Date')
     A            LRSND8    R               REFFLD(SSDAT8)
     A                                      COLHDG('Next' 'Reduction Date')
     A            LRAMT     R               REFFLD(SSAMT4)
     A                                      COLHDG('Reduction Amount')
     A            LRLAMT    R               REFFLD(SSAMT4)
     A                                      COLHDG('Last' 'Reduction Amt')
     A            LRTAMT    R               REFFLD(SSAMT4)
     A                                      COLHDG('LTD' 'Reduction Amt')
     A            LRFREQ    R               REFFLD(SSCOU3)
     A                                      COLHDG('Frequency')
     A            LRFRQC    R               REFFLD(SSCOD1)
     A                                      COLHDG('Freq Code')
     A            LRTERM    R               REFFLD(SSCOU5)
     A                                      COLHDG('Reduction' 'Term')
     A**          LREXP8    R               REFFLD(SSDAT8)
     A**                                    COLHDG('Expiry Date')
     A            LRREMK    R               REFFLD(SSDESC)
     A                                      COLHDG('Remarks')
     A*************************************************************************
SS31 A* LNTODC - OD EXCESS BALANCE
     A*************************************************************************
     A**          ACCTNO    R
     A**          ACTYPE    R
     A            EXBAL     R               REFFLD(SSAMT4)
     A                                      COLHDG('OD Excess balance')
     A            SUCESS    R               REFFLD(SSCOD1)
     A                                      COLHDG('Successful process')
     A            CHGAMT    R               REFFLD(SSAMT4)
     A                                      COLHDG('Charges Amount')
SS32 A*************************************************************************
SS32 A* LNCNOT - HIRER PURCHASE CREDIT NOTE FILE FOR VAT
SS32 A*************************************************************************
SS32 A            LCCBRN    R               COLHDG('Branch Number')
SS32 A                                      REFFLD(SSBRAN)
SS32 A            LCCNO     R               COLHDG('Credit Note Number')
SS32 A                                      REFFLD(SSGLNO)
SS32 A            LCCACC    R               COLHDG('Account Number')
SS32 A                                      REFFLD(SSAANO)
SS32 A            LCCATY    R               COLHDG('Account Type')
SS32 A                                      REFFLD(SSACCT)
SS32 A            LCCCIF    R               COLHDG('Customer Number')
SS32 A                                      REFFLD(SSCIFN)
SS32 A            LCCINS    R               COLHDG('Insurance Number')
SS32 A                                      REFFLD(SSCOU3)
SS32 A            LCCCD8    R               COLHDG('Credit Note Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LCCVNO    R               COLHDG('VAT No. Refer From')
SS32 A                                      REFFLD(SSAANO)
SS32 A            LCCND8    R               COLHDG('VAT Date refer from')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LCCNDS    R               COLHDG('Credit Note Desc.')
SS32 A                                      REFFLD(SSDESM)
SS32 A            LCCCNA    R               COLHDG('Credit Note Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCCNAM    R               COLHDG('New Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCCFAM    R               COLHDG('Different Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCCNVM    R               COLHDG('New VAT Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCCTAM    R               COLHDG('Total Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCCREA1   R               COLHDG('Reason for Credit N1')
SS32 A                                      REFFLD(SSDESS)
SS32 A            LCCREA2   R               COLHDG('Reason for Credit N2')
SS32 A                                      REFFLD(SSDESS)
SS32 A            LCCREA3   R               COLHDG('Reason for Credit N3')
SS32 A                                      REFFLD(SSDESS)
SS32 A*************************************************************************
SS32 A* LNDNOT - HIRER PURCHASE DEBIT NOTE FILE FOR VAT
SS32 A*************************************************************************
SS32 A            LCDBRN    R               COLHDG('Branch Number')
SS32 A                                      REFFLD(SSBRAN)
SS32 A            LCDNO     R               COLHDG('Debit Note Number')
SS32 A                                      REFFLD(SSGLNO)
SS32 A            LCDACC    R               COLHDG('Account Number')
SS32 A                                      REFFLD(SSAANO)
SS32 A            LCDATY    R               COLHDG('Account Type')
SS32 A                                      REFFLD(SSACCT)
SS32 A            LCDCIF    R               COLHDG('Customer Number')
SS32 A                                      REFFLD(SSCIFN)
SS32 A            LCDINS    R               COLHDG('Insurance Number')
SS32 A                                      REFFLD(SSCOU3)
SS32 A            LCDCD8    R               COLHDG('Debit Note Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LCDVNO    R               COLHDG('VAT No. Refer From')
SS32 A                                      REFFLD(SSAANO)
SS32 A            LCDND8    R               COLHDG('VAT Date refer from')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LCDNDS    R               COLHDG('Debit Note Desc.')
SS32 A                                      REFFLD(SSDESM)
SS32 A            LCDCNA    R               COLHDG('Debit Note Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCDNAM    R               COLHDG('New Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCDFAM    R               COLHDG('Different Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCDNVM    R               COLHDG('New VAT Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCDTAM    R               COLHDG('Total Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LCDREA1   R               COLHDG('Reason for Debit N1')
SS32 A                                      REFFLD(SSDESS)
SS32 A            LCDREA2   R               COLHDG('Reason for Debit N2')
SS32 A                                      REFFLD(SSDESS)
SS32 A            LCDREA3   R               COLHDG('Reason for Debit N3')
SS32 A                                      REFFLD(SSDESS)
SS32 A*************************************************************************
SS32 A* LNHPMS - HIRE PURCHASE MASTER FILE
SS32 A*************************************************************************
SS32 A            LPIAMT    R               COLHDG('Investment Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LPIVAT    R               COLHDG('VAT Investment Amt')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LPDAMT    R               COLHDG('Down Payment')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LPDWNV    R               COLHDG('VAT Down Payment')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LPTMD8    R               COLHDG('Termination Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LPTMNO    R               COLHDG('Termination No.')
SS32 A                                      REFFLD(SSDESS)
SS32 A            LPTMRS    R               COLHDG('Termination Reason')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            LPCAMT    R               COLHDG('Car Price')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LPCVAT    R               COLHDG('Car VAT')
SS32 A                                      REFFLD(SSAMT4)
SS32 A*************************************************************************
SS32 A* LNVATH - HP Installment VAT History File
SS32 A*************************************************************************
SS32 A            LVHACT    R               COLHDG('Account Number')
SS32 A                                      REFFLD(SSAANO)
SS32 A            LVHTYP    R               COLHDG('Account Type')
SS32 A                                      REFFLD(SSACCT)
SS32 A            LVHVNO    R               COLHDG('VAT Number')
SS32 A                                      REFFLD(SSDESS)
SS32 A            LVHINS    R               COLHDG('Installment No')
SS32 A                                      REFFLD(SSCOU3)
SS32 A            LVHIAM    R               COLHDG('Installment Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVHIVA    R               COLHDG('VAT Installment Amt')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVHPAM    R               COLHDG('Paid Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVHVAM    R               COLHDG('VAT Paid Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVHADA    R               COLHDG('Advance Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVHAVA    R               COLHDG('VAT Advance Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVHSUB    R               COLHDG('Subsidize')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            LVHSAM    R               COLHDG('Subsidize Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVHDU8    R               COLHDG('Due Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LVHID8    R               COLHDG('Cancelation Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LVHTD8    R               COLHDG('VAT Transaction Dt')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LVHCAN    R               COLHDG('Cancelation Flag')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            LVHREV    R               COLHDG('VAT Printing Flag')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            LVHCIF    R               COLHDG('Customer Number')
SS32 A                                      REFFLD(SSCIFN)
SS32 A            LVHREL    R               COLHDG('Relationship')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            LVHAGT    R               COLHDG('Runner Code')
SS32 A                                      REFFLD(SSCODA)
SS32 A            LVHFEE    R               COLHDG('Fee Code')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            LVHMCO    R               COLHDG('Misc/Other Charge')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            LVHCHG    R               COLHDG('Charge Type')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            LVHPD8    R               COLHDG('Posting Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LVHSEQ    R               COLHDG('Sequence Number')
SS32 A                                      REFFLD(SSCOU9)
SS32 A            LVHUSR    R               COLHDG('User ID')
SS32 A                                      REFFLD(SSCODA)
SS32 A            LVHTXC    R               COLHDG('Aux. Tran. Code')
SS32 A                                      REFFLD(SSCODA)
SS32 A            LVHCOD    R               COLHDG('Transaction Code')
SS32 A                                      REFFLD(SSCOU3)
SS32 A            LVHGN8    R               COLHDG('VAT Generation Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A*************************************************************************
SS32 A* LNVATD - HP Installment VAT History File - Detail
SS32 A*************************************************************************
SS32 A            LVDACT    R               COLHDG('Account Number')
SS32 A                                      REFFLD(SSAANO)
SS32 A            LVDTYP    R               COLHDG('Account Type')
SS32 A                                      REFFLD(SSACCT)
SS32 A            LVDVNO    R               COLHDG('VAT Number')
SS32 A                                      REFFLD(SSDESS)
SS32 A            LVDPAM    R               COLHDG('Paid Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVDVAM    R               COLHDG('VAT Paid Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVDADA    R               COLHDG('Advance Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVDAVA    R               COLHDG('VAT Advance Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVDSUB    R               COLHDG('Subsidize')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            LVDSAM    R               COLHDG('Subsidize Amount')
SS32 A                                      REFFLD(SSAMT4)
SS32 A            LVDCAN    R               COLHDG('Cancelation Flag')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            LVDDU8    R               COLHDG('Due Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LVDTD8    R               COLHDG('VAT Trans. Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LVDPD8    R               COLHDG('Posting Date')
SS32 A                                      REFFLD(SSDAT8)
SS32 A            LVDSEQ    R               COLHDG('Sequence Number')
SS32 A                                      REFFLD(SSCOU9)
SS32 A            LVDUSR    R               COLHDG('User ID')
SS32 A                                      REFFLD(SSCODA)
SS32 A*************************************************************************
SS32 A* LNVATX - Hire Purchase Receipt and VAT index File
SS32 A*************************************************************************
SS32 A            LVXACT    R               COLHDG('Account Number')
SS32 A                                      REFFLD(SSAANO)
SS32 A            LVXTYP    R               COLHDG('Account Type')
SS32 A                                      REFFLD(SSACCT)
SS32 A            LVXVTN    R               COLHDG('VAT Number')
SS32 A                                      REFFLD(SSDESS)
SS32 A            LVXRCN    R               COLHDG('Receipt Number')
SS32 A                                      REFFLD(SSDESS)
SS32 A*************************************************************************
SS32 A* LNTX   - Loan Transaction code usage
SS32 A*************************************************************************
SS32 A            TLTXCD    R               COLHDG('Aux. Trans. Code')
SS32 A                                      REFFLD(SSTTCD)
SS32 A            TLTXDS    R               COLHDG('Transaction Desc.')
SS32 A                                      REFFLD(SSDESM)
SS32 A            TLCD1     R               COLHDG('Host Transc. Code')
SS32 A                                      REFFLD(SSCOU3)
SS32 A            TLUSG2    R               COLHDG('Usage 2')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUSG3    R               COLHDG('Usage 3')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUSG4    R               COLHDG('Usage 4')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUSG5    R               COLHDG('Usage 5')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUSG6    R               COLHDG('Usage 6')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUSG7    R               COLHDG('Usage 7')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUSG8    R               COLHDG('Usage 8')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUSG9    R               COLHDG('Usage 9')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUS10    R               COLHDG('Usage 10')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUS11    R               COLHDG('Receipt Printing' 'Relation-
V1001A                                      ship code')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            TLUS12    R               COLHDG('Tax Printing' 'Relationship-
V1001A                                       code')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            TLUS13    R               COLHDG('Usage 13')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            TLUS14    R               COLHDG('Usage 14')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            TLUS15    R               COLHDG('Usage 15')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            TLUS16    R               COLHDG('Usage 16')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            TLUS17    R               COLHDG('Usage 17')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            TLUS18    R               COLHDG('Usage 18')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            TLCHGT    R               COLHDG('Charge Type')
SS32 A                                      REFFLD(SSCOD2)
SS32 A            TLPMTY    R               COLHDG('Payment Type')
SS32 A                                      REFFLD(SSDESS)
SS32 A            TLPMDS    R               COLHDG('Payment Description')
SS32 A                                      REFFLD(SSDESM)
SS32 A            TLVTFL    R               COLHDG('Description')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLUSG1    R               COLHDG('Usage 1')
SS32 A                                      REFFLD(SSCOD1)
SS32 A            TLCNC     R               COLHDG('CASH/NON-CASH')
SS32 A                                      REFFLD(SSCOD1)
SS34 A*************************************************************************
SS34 A* LNDBDD - Account Disbursement Deduction File
SS34 A*************************************************************************
SS34 A            DBDACC    R               COLHDG('Account Number')
SS34 A                                      REFFLD(SSACCN)
SS34 A            DBDACT    R               COLHDG('Account' 'Type')
SS34 A                                      REFFLD(SSACCT)
SS34 A            DBDSEQ    R               COLHDG('Sequence Number')
SS34 A                                      REFFLD(SSCOU5)
SS34 A            DBDIND    R               COLHDG('Deduction' 'Indicator')
SS34 A                                      REFFLD(SSCOD1)
SS34 A            DBDAMT    R               COLHDG('Deduction' 'Amount')
SS34 A                                      REFFLD(SSAMT4)
SS34 A            DBDCTP    R               COLHDG('Charge Type')
SS34 A                                      REFFLD(SSCOD2)
SS34 A            DBDCCD    R               COLHDG('Charge To' 'Misc/Othchg')
SS34 A                                      REFFLD(SSCOD1)
SS34 A            DBDEVE    R               COLHDG('Event Code')
SS34 A                                      REFFLD(SSCOD1)
SS34 A            DBDCSA    R               COLHDG('CA/SA Account')
SS34 A                                      REFFLD(SSACCN)
SS34 A            DBDCST    R               COLHDG('CA/SA Account' 'Type')
SS34 A                                      REFFLD(SSACCT)
SS35 A*************************************************************************
SS35 A* LNCTDR - Loan CB9 & TDR Information Maintenance File
SS35 A*************************************************************************
SS35 A            LNDRAC    R               COLHDG('Account Number')
SS35 A                                      REFFLD(SSACCN)
SS35 A            LNDRAT    R               COLHDG('Account' 'Type')
SS35 A                                      REFFLD(SSACCT)
SS35 A            LNDRCF    R               COLHDG('CIF Number')
SS35 A                                      REFFLD(SSCIFN)
SS35 A            LNDRCN    R               COLHDG('Contract Code')
SS35 A                                      REFFLD(SSDESS)
SS35 A            LNDRCD    R               COLHDG('TDR Code')
SS35 A                                      REFFLD(SSSEQ)
SS35 A            LNDROB    R               COLHDG('O/S before TDR')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRPR    R               COLHDG('Principal Reduction')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRIN    R               COLHDG('Interest Reduction')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRLS    R               COLHDG('Loss' 'Transfered Asset')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRAS    R               COLHDG('Transfered Asset')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRAP    R               COLHDG('Additional Provision')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDREV    R               COLHDG('VAT Exemption')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRES    R               COLHDG('Special' 'Tax Exemption')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDREO    R               COLHDG('Other Tax Exemption')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRTC    R               COLHDG('Transfer Asset' 'to Cust')
SS35 A                                      REFFLD(SSACCT)
SS35 A            LNDRLB    R               COLHDG('Transfer Asset' 'to Bank')
SS35 A                                      REFFLD(SSACCT)
SS35 A            LNDRCB    R               COLHDG('CAR Code Before TDR')
SS35 A                                      REFFLD(SSCOD2)
SS35 A            LNDRWO    R               COLHDG('Write Off Amount')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRQA    R               COLHDG('Quarterly Adjustment')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRSC    R               COLHDG('Satisfy in TDR')
SS35 A                                      REFFLD(SSACCT)
SS35 A            LNDRPL    R               COLHDG('Provision Loan Loss')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LNDRRM    R               COLHDG('Remark')
SS35 A                                      REFFLD(SSDESC)
SS35 A            LN9TDR    R               COLHDG('Restructuring Type')
SS35 A                                      REFFLD(SSACCT)
SS35 A            LN9LOS    R               COLHDG('Loss from TDR')
SS35 A                                      REFFLD(SSAMT4)
SS35 A            LN9RSC    R               COLHDG('Reason for' 'Chg Balance')
SS35 A                                      REFFLD(SSCOD3)
SS35 A            LN9RSD    R               COLHDG('Reason for' 'Debt Classify')
SS35 A                                      REFFLD(SSCOD3)
SS35 A            LN9ACC    R               COLHDG('Action Code')
SS35 A                                      REFFLD(SSCOD3)
R1001A*****************************************************************
R1001A** Campaign Code Parameter - LNPRPP
R1001A            LSPCOD    R               COLHDG('Campaign/Package' 'Code')
R1001A                                      REFFLD(SSCOD3)
R1001A            LSPDSC    R               COLHDG('Description')
R1001A                                      REFFLD(SSDESM)
R1001A            LSPRAT    R               COLHDG('Aggregate Rate')
R1001A                                      REFFLD(SSPERD)
R1001A            LSPFRQ    R               COLHDG('Aggregate Freq')
R1001A                                      REFFLD(SSCOU3)
R1001A            LSPFCD    R               COLHDG('Aggregate Freq Code')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSLOTR    R               COLHDG('Term from L/O Date')
R1001A                                      REFFLD(SSTERM)
R1001A            LSLOTC    R               COLHDG('Term Code from' 'L/O Date')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSRIND    R               COLHDG('Effective Rate' 'Indicator')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSEXD8    R               COLHDG('Expire Date')
R1001A                                      REFFLD(SSDAT8)
R1001A            LSILON    R               COLHDG('Subj Int' 'In Lieu of ntc')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSPTRM    R               COLHDG('Partial Prepymt' 'Ntc term')
R1001A                                      REFFLD(SSCOU3)
R1001A            LSPTCD    R               COLHDG('Partial Ppymt' 'Ntc trm cd')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSETRM    R               COLHDG('Early Settle' 'Ntc Term')
R1001A                                      REFFLD(SSCOU3)
R1001A            LSETCD    R               COLHDG('Early Settle' 'Ntc trm Cd')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSPREP    R               COLHDG('Subject to' 'Prepymt Fees')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSPPP1    R               COLHDG('PP - Fixed Amount')
R1001A                                      REFFLD(SSAMT4)
R1001A            LSPPP2    R               COLHDG('PP - % Amount repaid')
R1001A                                      REFFLD(SSPERD)
R1001A            LSPPP3    R               COLHDG('PP-% Original' 'Commitment')
R1001A                                      REFFLD(SSPERD)
R1001A            LSPPP4    R               COLHDG('PP-% Based on' 'Unexp Dur')
R1001A                                      REFFLD(SSPERD)
R1001A            LSESP1    R               COLHDG('ES - Fixed Amount')
R1001A                                      REFFLD(SSAMT4)
R1001A            LSESP2    R               COLHDG('ES - % Amount Repaid')
R1001A                                      REFFLD(SSPERD)
R1001A            LSESP3    R               COLHDG('ES-% Original' 'Commitment')
R1001A                                      REFFLD(SSPERD)
R1001A            LSESP4    R               COLHDG('ES-% Based on' 'Unexp Dur')
R1001A                                      REFFLD(SSPERD)
R1001A            LSPWXM    R               COLHDG('Calc Prepymt' 'if Partial-
R1001A                                      Prepymt' 'within XXX momths')
R1001A                                      REFFLD(SSCOU3)
R1001A            LSPIND    R               COLHDG('Commencement' 'of Prepaymen-
R1001A                                      t' 'Indicator')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSEWXM    R               COLHDG('Calc Prepymt' 'if E/Sett-
R1001A                                      within' 'XXX months')
R1001A                                      REFFLD(SSCOU3)
R1001A            LSEIND    R               COLHDG('Commencement' 'of E/Sett-
R1001A                                      Indicator')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSCANC    R               COLHDG('Subj to' 'Cancellation Fee')
R1001A                                      REFFLD(SSCOD1)
R1001A            LSCAN1    R               COLHDG('% on unutilized' 'when -
R1001A                                      schedule' 'expired')
R1001A                                      REFFLD(SSPERD)
R1001A            LSCAN2    R               COLHDG('% on unutilized' 'upon -
R1001A                                      payoff')
R1001A                                      REFFLD(SSPERD)
R1001A            LSCAN3    R               COLHDG('% on unexpired' 'duration -
R1001A                                      upon payoff')
R1001A                                      REFFLD(SSPERD)
R1001A            LSCAN4    R               COLHDG('% on unutilized' 'when -
R1001A                                      available' 'expired')
R1001A                                      REFFLD(SSPERD)
R1001A            LSCAN5    R               COLHDG('% on unexpired' 'duration -
R1001A                                      when' 'available expired')
R1001A                                      REFFLD(SSPERD)
R1001A            LSCRTN    R               COLHDG('Commitment Fee' 'Rate No.')
R1001A                                      REFFLD(SSRATE)
R1001A            LSCOMR    R               COLHDG('Commitment Fee Rate')
R1001A                                      REFFLD(SSPERD)
R1001A            LSPCLA    R               COLHDG('Minimum usage' 'limit' -
R1001A                                      '(% of commitment)')
R1001A                                      REFFLD(SSPERD)
R1001A            LSPCUD    R               COLHDG('% of total undrawn')
R1001A                                      REFFLD(SSPERD)
R1001A            LSUDR1    R               COLHDG('Undrawn Lmt' 'Excess Rate')
R1001A                                      REFFLD(SSPERD)
R1001A            LSUDR2    R               COLHDG('Undrawn Rt if' 'above lmt')
R1001A                                      REFFLD(SSPERD)
R1001A            LSFPR9    R               COLHDG('E/S - % on Interest' 'Reba-
R1001A                                      te Clawback')
R1001A                                      REFFLD(SSPERD)
R1001A            LSRCFL    R               COLHDG('Calc Rebate' 'Clawback if-
R1001A                                      PO within')
R1001A                                      REFFLD(SSCOU3)
R1001A            LSPDS1    R               COLHDG('Description 1')
R1001A                                      REFFLD(SSDESM)
R1001A            LSPDS2    R               COLHDG('Description 2')
R1001A                                      REFFLD(SSDESM)
R1001A            LSPDS3    R               COLHDG('Description 3')
R1001A                                      REFFLD(SSDESM)
R1001A*****************************************************************
R1001** Campaign Code Parameter - Schedule - LNPRPQ
R1001A            LDPCOD    R               COLHDG('Campaign/Package' 'Code')
R1001A                                      REFFLD(SSCOD3)
R1001A            LDPSEQ    R               COLHDG('Sequence' 'Number')
R1001A                                      REFFLD(SSCOU3)
R1001A            LDTERM    R               COLHDG('Term')
R1001A                                      REFFLD(SSCOU5)
R1001A            LDTMCD    R               COLHDG('Term Code')
R1001A                                      REFFLD(SSCOD1)
R1001A            LDRATE    R               COLHDG('Rate')
R1001A                                      REFFLD(SSPERD)
R1001A            LDRATN    R               COLHDG('Rate Number')
R1001A                                      REFFLD(SSRATE)
R1001A            LDVARI    R               COLHDG('Rate Variance')
R1001A                                      REFFLD(SSPERD)
R1001A            LDVCD     R               COLHDG('Rate Variance Code')
R1001A                                      REFFLD(SSCOD1)
R1001A            LDFLOR    R               COLHDG('Rate Floor')
R1001A                                      REFFLD(SSPERD)
R1001A            LDCEIL    R               COLHDG('Rate Ceiling')
R1001A                                      REFFLD(SSPERD)
R1001A            LDRTRM    R               COLHDG('Rate' 'Review Term')
R1001A                                      REFFLD(SSTERM)
R1001A            LDRCD     R               COLHDG('Rate Review' 'Term Code')
R1001A                                      REFFLD(SSCOD1)
R1001A
R1001A*****************************************************************
R1001** Loan Type - Campaign Code Parameter - LNPRPR
R1001A            LLPTYP    R               COLHDG('Loan Type')
R1001A                                      REFFLD(SSPROD)
R1001A            LLPCUR    R               COLHDG('Currency')
R1001A                                      REFFLD(SSCURC)
R1001A            LLPCOD    R               COLHDG('Package Code')
R1001A                                      REFFLD(SSCOD3)
R1002A*****************************************************************
R1002A* LNCPMS - Lending Compromise Payment Schedule
R1002A* LNBCSF - Lending Compromise Payment Schedule Upload file
R1002A*****************************************************************
R1002A            CPSACT    R               COLHDG('Account Number')
R1002A                                      REFFLD(SSACCN)
R1002A            CPSTYP    R               COLHDG('Account Type')
R1002A                                      REFFLD(SSACCT)
R1007A            CPSSEQ    R               COLHDG('Sequence' 'Number')
R1007A                                      REFFLD(SSCOU9)
R1002A            CPCRT8    R               COLHDG('Creation Date')
R1002A                                      REFFLD(SSDAT8)
R1002A            CPSDU8    R               COLHDG('Compromise' +
R1002A                                      'Settlement Due Date')
R1002A                                      REFFLD(SSDAT8)
R1002A            CPSPMT    R               COLHDG('Compromise' +
R1002A                                      'Settlement' +
R1002A                                      'Payment Amount')
R1002A                                      REFFLD(SSAMT4)
R1002A            CPSAPD    R               COLHDG('Amount Paid')
R1002A                                      REFFLD(SSAMT4)
R1044A            CPSNPD    R               COLHDG('No of Payments Made')
R1044A                                      REFFLD(SSCOU3)
R1002A            CPSLP8    R               COLHDG('Last Payment Date')
R1002A                                      REFFLD(SSDAT8)
R1002A*****************************************************************
R1002A* LNBCPF - LENDING COMPROMISE PAYMENT UPLOAD FILE
R1002A* LNCPRM - Lending Compromise Payment File
R1002A*****************************************************************
R1002A            CPMACT    R               COLHDG('Account Number')
R1002A                                      REFFLD(SSACCN)
R1002A            CPMTYP    R               COLHDG('Account Type')
R1002A                                      REFFLD(SSACCT)
R1007A            CPMSEQ    R               COLHDG('Sequence' 'Number')
R1007A                                      REFFLD(SSCOU9)
R1002A            CPMDT8    R               COLHDG('Creation Date')
R1002A                                      REFFLD(SSDAT8)
R1002A            CPMED8    R               COLHDG('Effective Date')
R1002A                                      REFFLD(SSDAT8)
R1002A            CPMSMT    R               COLHDG('Compromise Settle' +
R1002A                                      'ment Method')
R1002A                                      REFFLD(SSCOD1)
R1002A            CPMSTS    R               COLHDG('Compromise Settle' +
R1002A                                      'ment Status')
R1002A                                      REFFLD(SSCOD1)
R1002A            CPMSCH    R               COLHDG('Monitor Each Com' +
R1002A                                      'promise Settlement' +
R1002A                                      'Schedule')
R1002A                                      REFFLD(SSYON )
R1002A            CPMGRD    R               COLHDG('Grace Days before' +
R1002A                                      'Classified as ' +
R1002A                                      'Non-compliant')
R1002A                                      REFFLD(SSRET3)
R1002A            CPMWOC    R               COLHDG('Auto Write ' +
R1002A                                      'Off If Compliant')
R1002A                                      REFFLD(SSYON )
R1002A            CPMUTC    R               COLHDG('Auto un-tag ' +
R1002A                                      'Compromise' +
R1002A                                      'Flag if Compliant')
R1002A                                      REFFLD(SSYON )
R1002A            CPMGRC    R               COLHDG('Grace code b4' +
R1002A                                      'Classified as' 'non-complaint')
R1008A                                      REFFLD(SSCOD1)
R1002A            CPMRSN    R               COLHDG('Auto Reverse ' +
R1002A                                      'from Suspend if ' +
R1002A                                      'Non-compliant')
R1002A                                      REFFLD(SSYON )
R1002A            CPMRSC    R               COLHDG('Auto Reverse ' +
R1002A                                      'from Suspend if ' +
R1002A                                      'Compliant')
R1002A                                      REFFLD(SSYON )
R1002A            CPMLD8    R               COLHDG('Date of ' +
R1002A                                      'Compromised ' +
R1002A                                      'Settlement Letter')
R1002A                                      REFFLD(SSDAT8)
R1008A            CPMROF    R               COLHDG('Recovery Officer')
R1008A                                      REFFLD(SSDESC)
R1002A            CPMRM1    R               COLHDG('Remark 1')
R1002A                                      REFFLD(SSDESC)
R1002A            CPMRM2    R               COLHDG('Remark 2')
R1002A                                      REFFLD(SSDESC)
R1002A            CPMRM3    R               COLHDG('Remark 3')
R1002A                                      REFFLD(SSDESC)
R1002A*****************************************************************
R1002A* LNBENF - Entity Classification Upload File
R1002A*****************************************************************
R1002A            BFENTN    R               COLHDG('Entity Number')
R1002A                                      REFFLD(SSACCN)
R1002A            BFMIA     R               COLHDG('Maximum Aging Months')
R1002A                                      REFFLD(SSTERM)
R1002A            BFCARM    R               COLHDG('Classification Mthod')
R1002A                                      REFFLD(SSCOD2)
R1002A            BFCARC    R               COLHDG('Classification Code')
R1002A                                      REFFLD(SSCOD2)
R1002A            BFPROV    R               COLHDG('Provision Amount')
R1002A                                      REFFLD(SSAMT4)
R1002A*****************************************************************
R1002 * LNENCL - Entity Classification File
R1002 *****************************************************************
R1002             ECENTN    R               COLHDG('Entity Number')
R1002                                       REFFLD(SSACCN)
R1035             ECDAT8    R               COLHDG('Change Date')
R1035                                       REFFLD(SSDAT8)
R1002             ECMIA     R               COLHDG('Maximum Aging Months')
R1002                                       REFFLD(SSTERM)
R1002             ECCARM    R               COLHDG('Classification Mthod')
R1002                                       REFFLD(SSCOD2)
R1035             ECCART    R               COLHDG('Classification Type')
R1035                                       REFFLD(SSCOD1)
R1002             ECCARC    R               COLHDG('Classification Code')
R1002                                       REFFLD(SSCOD2)
R1002             ECQCAR    R               COLHDG('Qualitative Class' +
R1002                                       'ification Code')
R1002                                       REFFLD(SSCOD2)
R1002             ECQCRR    R               COLHDG('Qualitative Class' +
R1002                                       'ification Reason')
R1002                                       REFFLD(SSCOD6)
R1002             ECNPLS    R               COLHDG('NPL Status')
R1002                                       REFFLD(SSCOD1)
R1002             ECPROV    R               COLHDG('Provision Amount')
R1002                                       REFFLD(SSAMT4)
R1002             ECAPRV    R               COLHDG('Qualitative ' +
R1002                                       'Additional ' +
R1002                                       'Provision Amount')
R1002                                       REFFLD(SSAMT4)
T1003A            ECQEF8    R               COLHDG('Qualitative' +
T1003A                                      'Effective Date')
T1003A                                      REFFLD(SSDAT8)
R1002             ECLUP8    R               COLHDG('Last Upload Date')
R1002                                       REFFLD(SSDAT8)
R1002             ECLMN8    R               COLHDG('Last Maint Date')
R1002                                       REFFLD(SSDAT8)
R1002 *****************************************************************
R1002 * LNIRES - Restructuring Information at Account level
R1002 *****************************************************************
R1002             RIACCT    R               COLHDG('Account Number')
R1002                                       REFFLD(SSACCN)
R1002             RIACTY    R               COLHDG('Account Type')
R1002                                       REFFLD(SSACCT)
R1028             RIRSCN    R               COLHDG('Restructuring' 'Contract' +
R1028                                       'Number')
R1028                                       REFFLD(SSDESS)
R1002             RIPRNR    R               COLHDG('Principal Reduction')
R1002                                       REFFLD(SSAMT4)
R1002             RIINTR    R               COLHDG('Interest Reduction')
R1002                                       REFFLD(SSAMT4)
R1002             RIPRNF    R               COLHDG('Future Principal ' +
R1002                                       'Write-Off')
R1002                                       REFFLD(SSAMT4)
R1002             RIINTF    R               COLHDG('Future Interest ' +
R1002                                       'Write-Off')
R1002                                       REFFLD(SSAMT4)
R1002             RITRFA    R               COLHDG('Transfer Amount')
R1002                                       REFFLD(SSAMT4)
R1002             RITRFL    R               COLHDG('Loss from Transfer')
R1002                                       REFFLD(SSAMT4)
R1002             RIAPRV    R               COLHDG('Additional Provision')
R1002                                       REFFLD(SSAMT4)
T1003A            RIOOSB    R               COLHDG('Old Outstanding' 'Amount')
T1003A                                      REFFLD(SSAMT4)
T1003A            RIOPRN    R               COLHDG('Old Principal' 'Balance')
T1003A                                      REFFLD(SSAMT4)
T1003A            RIOINT    R               COLHDG('Old Accrued' 'Interest')
T1003A                                      REFFLD(SSAMT4)
T1003A            RITRLB    R               COLHDG('Transfer' 'Asset Amount' -
T1003A                                      '-Land & Building')
T1003A                                      REFFLD(SSAMT4)
T1003A            RITRSE    R               COLHDG('Transfer' 'Asset Amount' -
T1003A                                      '-Security')
T1003A                                      REFFLD(SSAMT4)
T1003A            RITROT    R               COLHDG('Transfer' 'Asset Amount' -
T1003A                                      '-Other')
T1003A                                      REFFLD(SSAMT4)
G002 A            RIDBR8    R               COLHDG('Date of Bankrupt ')
G002 A                                      REFFLD(SSDAT8)
G002 A            RIDRAC    R               COLHDG('Action code ')
G002 A                                      REFFLD(SSCOD6)
R1002 *****************************************************************
R1002 * LNLGBL - Lending Ledger Balance File
R1002 *****************************************************************
R1002             LDLBAL    R               COLHDG('Principal')
R1002                                       REFFLD(SSAMT4)
R1002             LDACIN    R               COLHDG('Interest')
R1002                                       REFFLD(SSAMTH)
R1002             LDINTS    R               COLHDG('IIS')
R1002                                       REFFLD(SSAMT4)
R1002             LDINTX    R               COLHDG('Taxable IIS')
R1002                                       REFFLD(SSAMT4)
R1002             LDINTN    R               COLHDG('Non-Taxable IIS')
R1002                                       REFFLD(SSAMT4)
R1002             LDRINT    R               COLHDG('Rest. Int')
R1002                                       REFFLD(SSAMT4)
R1002             LDRISP    R               COLHDG('Rest. IIS')
R1002                                       REFFLD(SSAMT4)
R1002             LDRISX    R               COLHDG('Rest. Taxable IIS')
R1002                                       REFFLD(SSAMT4)
R1002             LDRISN    R               COLHDG('Rest Non-Taxable IIS')
R1002                                       REFFLD(SSAMT4)
R1002             LDMORI    R               COLHDG('Mora Interest')
R1002                                       REFFLD(SSAMTH)
R1002             LDPENI    R               COLHDG('Late Charge')
R1002                                       REFFLD(SSAMTH)
R1048             LDLCSP    R               COLHDG('L/C-In-Susp')
R1048                                       REFFLD(SSAMT4)
R1002             LDRLC     R               COLHDG('Rest. Late Charge')
R1002                                       REFFLD(SSAMT4)
R1002             LDMISC    R               COLHDG('Misc. Cost')
R1002                                       REFFLD(SSAMT4)
R1002             LDOTHC    R               COLHDG('other charges')
R1002                                       REFFLD(SSAMT4)
R1002             LDLCOM    R               COLHDG('Comm. Fee')
R1002                                       REFFLD(SSAMTH)
R1048             LDBKSC    R               COLHDG('Bank' 'Discount')
R1048                                       REFFLD(SSAMT4)
R1002             LDIREB    R               COLHDG('Interest Rebate')
R1002                                       REFFLD(SSAMT4)
R1002             CONVD8    R               COLHDG('Conversion Date')
R1002                                       REFFLD(SSDAT8)
R1009 *****************************************************************
R1009 * LNFEAM - Facility Excess Authority Master
R1009 *****************************************************************
R1009             FEACCT    R               COLHDG('Account Number')
R1009                                       REFFLD(SSACCN)
R1009             FEACTY    R               COLHDG('Account Type')
R1009                                       REFFLD(SSACCT)
R1009             FESEQ     R               COLHDG('SEQUENCE' 'NUMBER')
R1009                                       REFFLD(SSCOU9)
R1009             FECDT8    R               COLHDG('Creation Date')
R1009                                       REFFLD(SSDAT8)
R1009             FEEXP8    R               COLHDG('Expriry Date')
R1009                                       REFFLD(SSDAT8)
R1009             FETAMT    R               COLHDG('Total Cheque' 'Amount')
R1009                                       REFFLD(SSAMT4)
R1009             FELIMT    R               COLHDG('FEA Limit')
R1009                                       REFFLD(SSAMT4)
R1009             FEGEND    R               COLHDG('FEA Generated')
R1009                                       REFFLD(SSCOD1)
R1009             FEASTS    R               COLHDG('FEA Status')
R1009                                       REFFLD(SSCOD1)
R1009             FEAPR1    R               COLHDG('1st Approver')
R1009                                       REFFLD(SSCODA)
R1009             FEAPR2    R               COLHDG('2nd Approver')
R1009                                       REFFLD(SSCODA)
R1009             FEAPR3    R               COLHDG('3nd Approver')
R1009                                       REFFLD(SSCODA)
R1009             FEAP18    R               COLHDG('1st Approval' 'Date')
R1009                                       REFFLD(SSDAT8)
R1009             FEAP28    R               COLHDG('2nd Approval' 'Date')
R1009                                       REFFLD(SSDAT8)
R1009             FEAP38    R               COLHDG('3nd Approval' 'Date')
R1009                                       REFFLD(SSDAT8)
R1009             FEREM1    R               COLHDG('Remark 1')
R1009                                       REFFLD(SSDESC)
R1009             FEREM2    R               COLHDG('Remark 2')
R1009                                       REFFLD(SSDESC)
R1009 *****************************************************************
R1009 * LNFEAD - Facility Excess Authority Detail
R1009 *****************************************************************
R1009             FDACCT    R               COLHDG('Account Number')
R1009                                       REFFLD(SSACCN)
R1009             FDACTY    R               COLHDG('Account Type')
R1009                                       REFFLD(SSACCT)
R1009             FDSEQ     R               COLHDG('SEQUENCE' 'NUMBER')
R1009                                       REFFLD(SSCOU9)
R1009             FDCDT8    R               COLHDG('Creation Date')
R1009                                       REFFLD(SSDAT8)
R1009             FDCQNO    R               COLHDG('Cheque Number')
R1009                                       REFFLD(SSACCN)
R1009             FDCAMT    R               COLHDG('Cheque' 'Amount')
R1009                                       REFFLD(SSAMT4)
R1009             FDINCL    R               COLHDG('Include In FEA')
R1009                                       REFFLD(SSCOD1)
R1047 *****************************************************************
R1047 * LNFEAX - Facility Excess Authority Exception file
R1047 *****************************************************************
R1047             FXACCT    R               COLHDG('Account' 'Number')
R1047                                       REFFLD(SSACCN)
R1047             FXACTY    R               COLHDG('Account' 'Type')
R1047                                       REFFLD(SSACCT)
R1047             FXPCOD    R               COLHDG('Exception' 'Code')
R1047                                       REFFLD(SSCOU3)
R1047             FXEXSS    R               COLHDG('Account Bal' 'In Excess')
R1047                                       REFFLD(SSAMT4)
R1047             FXCURT    R               COLHDG('Currency' 'Type')
R1047                                       REFFLD(SSCURC)
R1047             FXTRXC    R               COLHDG('Affected From' 'Trx Code')
R1047                                       REFFLD(SSTTCD)
R1047             FXTRD8    R               COLHDG('Transaction Date')
R1047                                       REFFLD(SSDAT8)
R1047             FXTAMT    R               COLHDG('Transaction Amount')
R1047                                       REFFLD(SSAMT4)
R1047             FXCHQN    R               COLHDG('Cheque number')
R1047                                       REFFLD(SSCOU9)
R1047             FXRTGN    R               COLHDG('Routing number')
R1047                                       REFFLD(SSCOU9)
R1047             FXSREF    R               COLHDG('System Ref.' 'No')
R1047                                       REFFLD(SSREFN)
R1047             FXTTIM    R               COLHDG('Transaction' 'Time')
R1047                                       REFFLD(SSTIM6)
R1019 *****************************************************************
R1019 * LNODIN - Overdraft capitalised interest detail
R1019 *****************************************************************
R1019             LOIACT    R               COLHDG('Account Number')
R1019                                       REFFLD(SSACCN)
R1019             LOIATY    R               COLHDG('Account Type')
R1019                                       REFFLD(SSACCT)
R1019             LOIDT8    R               COLHDG('Interest' -
R1019                                       'Capitalized Date')
R1019                                       REFFLD(SSDAT8)
R1019             LOIINO    R               COLHDG('Original Interest')
R1019                                       REFFLD(SSAMT4)
R1019             LOIINT    R               COLHDG('Outstanding' 'Excess' -
R1019                                       'Interest')
R1019                                       REFFLD(SSAMT4)
R1022 *****************************************************************
R1022 * LNASER - Loan Auxiliary Service
R1022 *****************************************************************
R1022             LASACT    R               COLHDG('ACCOUNT' 'NUMBER')
R1022                                       REFFLD(SSACCN)
R1022             LASTYP    R               COLHDG('ACCOUNT' 'TYPE')
R1022                                       REFFLD(SSACCT)
R1022             LASYID    R               COLHDG('System ID')
R1022                                       REFFLD(SSCODA)
R1022             LASCTP    R               COLHDG('Account Type Code')
R1022                                       REFFLD(SSCODA)
R1022             LASITY    R               COLHDG('Internal Account' 'Type')
R1022                                       REFFLD(SSCOD1)
     A*************************************************************************
     A* Multi tier financing file - LNAMTF
     A*************************************************************************
R1037A            AMAPNO    R               COLHDG('Application No.')
R1037A                                      REFFLD(SSACCN)
R1037A            AMACNO    R               COLHDG('Acct No.')
R1037A                                      REFFLD(SSACCN)
R1037A            AMACTY    R               COLHDG('Acct type')
R1037A                                      REFFLD(SSACCT)
R1037A            AMSEQN    R               COLHDG('Tier Seq No.')
R1037A                                      REFFLD(SSCOU3)
R1037A            AMSEQP    R               COLHDG('Tier' 'Posting Seq')
R1037A                                      REFFLD(SSCOU3)
R1037A            AMTLMT    R               COLHDG('Tier Limit')
R1037A                                      REFFLD(SSAMT4)
R1037A            AMTERM    R               COLHDG('Tier Term')
R1037A                                      REFFLD(SSTERM)
R1037A            AMTMCD    R               COLHDG('Tier' 'Term Code')
R1037A                                      REFFLD(SSCOD1)
R1037A            AMINTT    R               COLHDG('Interest Rate Type')
R1037A                                      REFFLD(SSCODA)
R1037A            AMRATE    R               COLHDG('Rate')
R1037A                                      REFFLD(SSPERD)
R1037A            AMDLRR    R               COLHDG('Dealer' 'Rate')
R1037A                                      REFFLD(SSPERD)
R1037A            AMPRTN    R               COLHDG('Rate' 'Number')
R1037A                                      REFFLD(SSRATE)
R1037A            AMPVAR    R               COLHDG('Rate' 'Variance')
R1037A                                      REFFLD(SSPERD)
R1037A            AMPVCD    R               COLHDG('Variance' 'Code')
R1037A                                      REFFLD(SSCOD1)
R1037A            AMPFLR    R               COLHDG('Rate' 'Floor')
R1037A                                      REFFLD(SSPERD)
R1037A            AMPCEL    R               COLHDG('Rate' 'Ceiling')
R1037A                                      REFFLD(SSPERD)
R1037A            AMPRTM    R               COLHDG('Rate' 'Review Term')
R1037A                                      REFFLD(SSTERM)
R1037A            AMPRCD    R               COLHDG('Rate Review' 'Term Code')
R1037A                                      REFFLD(SSCOD1)
R1037A            AMPRV8    R               COLHDG('Rate' 'Review Date')
R1037A                                      REFFLD(SSDAT8)
R1037A            AMPDAY    R               COLHDG('Rate' 'Review Day')
R1037A                                      REFFLD(SSDAT2)
R1037A            AMFDRT    R               COLHDG('Tied to' 'Deposit A/C')
R1037A                                      REFFLD(SSCOD1)
R1037A            AMNPMT    R               COLHDG('New Paym Amt')
R1037A                                      REFFLD(SSAMT4)
R1037A            AMNORG    R               COLHDG('New Original Amt')
R1037A                                      REFFLD(SSAMT4)
R1037A            AMYBSE    R               COLHDG('Year base')
R1037A                                      REFFLD(SSCOU1)
R1037A            AMRSTM    R               COLHDG('Rest Method')
R1037A                                      REFFLD(SSCOD1)
R1037A            AMPMCD    R               COLHDG('Upd When Pmtcod' 'Auto Chg')
R1037A                                      REFFLD(SSCOD1)
R1037A            AMGPPI    R               COLHDG('GPP Indicator')
R1037A                                      REFFLD(SSCOD1)
R1037A            AMDLM8    R               COLHDG('Last' 'Maint Date')
R1037A                                      REFFLD(SSDAT8)
R1041A*******************************************
R1041A** DAILY RECEIPTS PRINTING FILE (LNFACJ) **
R1041A*******************************************
R1041A            LJBR      R               COLHDG('Branch' 'Code')
R1041A                                      REFFLD(SSBRAN)
R1041A            LJSBRN    R               COLHDG('SERVICE' 'BRANCH')
R1041A                                      REFFLD(SSBRAN)
R1041A            LJRECN    R               COLHDG('Receipt' 'Number')
R1041A                                      REFFLD(SSDESS)
R1041A            LJVATN    R               COLHDG('Tax Invoice' 'Number')
R1041A                                      REFFLD(SSDESS)
R1041A            LJACCT    R               COLHDG('Account' 'Number')
R1041A                                      REFFLD(SSACCN)
R1041A            LJATYP    R               COLHDG('Account' 'Type')
R1041A                                      REFFLD(SSACCT)
R1041A            LJDENO    R               COLHDG('Debtor' 'Number')
R1041A                                      REFFLD(SSCOUB)
R1041A            LJPRIN    R               COLHDG('Principal Amt')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJINT     R               COLHDG('Interest Amt')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJFEE     R               COLHDG('Fee Amt')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJLC      R               COLHDG('Late Charges')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJOC      R               COLHDG('Others' 'Charges')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJMC      R               COLHDG('Misc.' 'Charges')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJVAT     R               COLHDG('VAT' 'Amount')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJWHT     R               COLHDG('Withholding' 'Tax')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJOFEE    R               COLHDG('Out of Town Fee')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJROUT    R               COLHDG('Rounting' 'No')
R1041A                                      REFFLD(SSCOU9)
R1041A            LJMDT8    R               COLHDG('Issue' 'Date')
R1041A                                      REFFLD(SSDAT8)
R1041A            LJAALA    R               COLHDG('Address' 'Sequence')
R1041A                                      REFFLD(SSCOU3)
R1041A            LJDISP    R               COLHDG('DISCOUNT PRODUCT')
R1041A                                      REFFLD(SSCOD1)
R1041A            LJOSBL    R               COLHDG('Outstanding' 'Amt')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJNCHQ    R               COLHDG('Cheque Number')
R1041A                                      REFFLD(SSCOU9)
R1041A* C=Cheque payment,M=Cash payment,O=Other
R1041A            LJPMOD    R               COLHDG('Payment' 'Mode')
R1041A                                      REFFLD(SSCOD4)
R1041A* R=Release,P=Payment
R1041A            LJPIND    R               COLHDG('Receipt' 'Purpose')
R1041A                                      REFFLD(SSCOD1)
R1041A            LJUSER    R               COLHDG('User' 'ID')
R1041A                                      REFFLD(SSCODA)
R1041A            LJTYPE    R               COLHDG('Loan' 'Type')
R1041A                                      REFFLD(SSPROD)
R1041A            LJGSRN    R               COLHDG('Grouping Seq.' 'Number')
R1041A                                      REFFLD(SSACCN)
R1041A            LJPAYN    R               COLHDG('Current' 'Instalment No.')
R1041A                                      REFFLD(SSACCN)
R1041A* 'C'=Receipt cancel
R1041A            LJSTAT    R               COLHDG('Receipt' 'Status')
R1041A                                      REFFLD(SSCOD1)
R1041A            LJPICN    R               COLHDG('Invoice/Cheque/PN/BE')
R1041A                                      REFFLD(SSDESS)
R1041A            LJINT2    R               COLHDG('Defer Interest')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJINT3    R               COLHDG('Int. B4 Restructure')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJLC3     R               COLHDG('L/C B4 Restructure')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJEFD8    R               COLHDG('Effective Date')
R1041A                                      REFFLD(SSDAT8)
R1041A            LJBATN    R               COLHDG('Batch Number')
R1041A                                      REFFLD(SSCOU7)
R1041A            LJPOFF    R               COLHDG('Payoff Flag')
R1041A                                      REFFLD(SSCOD1)
R1041A            LJCDT8    R               COLHDG('Cancel Date')
R1041A                                      REFFLD(SSDAT8)
R1041A            LJLTST    R               COLHDG('Last Install. No')
R1041A                                      REFFLD(SSAANO)
R1041A            LJCIFN    R               COLHDG('Customer Number')
R1041A                                      REFFLD(SSCIFN)
R1041A            LJRELA    R               COLHDG('Relationship')
R1041A                                      REFFLD(SSCOD2)
R1041A            LJAGTC    R               COLHDG('Runner Code')
R1041A                                      REFFLD(SSCODA)
R1041A            LJDWAM    R               COLHDG('Down Payment')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJDTAM    R               COLHDG('Amount Deduct')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJSVAM    R               COLHDG('Service Amount')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJCOMM    R               COLHDG('Commission')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJCREB    R               COLHDG('Commission Rebate')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJSUSP    R               COLHDG('Suspend Amount')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJDFEE    R               COLHDG('Fee Code')
R1041A                                      REFFLD(SSCOD2)
R1041A            LJCHTY    R               COLHDG('Misc/Other Charge')
R1041A                                      REFFLD(SSCOD1)
R1041A            LJCHCO    R               COLHDG('Charge Type Code')
R1041A                                      REFFLD(SSCOD2)
R1041A            LJTXCD    R               COLHDG('Aux. Trans. Code')
R1041A                                      REFFLD(SSCODA)
R1041A            LJHCOD    R               COLHDG('Trans. Code')
R1041A                                      REFFLD(SSCOU3)
R1041A            LJCVAT    R               COLHDG('Collection Fee VAT')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJCFEE    R               COLHDG('Collection Fee')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJPFEE    R               COLHDG('Prepayment Fee VAT')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJPPFE    R               COLHDG('Prepayment Fee')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJPDISC   R               COLHDG('Payoff discount' 'amount')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJOCVAT   R               COLHDG('Other charge vat')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJMCVAT   R               COLHDG('Misc charge vat')
R1041A                                      REFFLD(SSAMT4)
R1041A            LJCBAL    R               COLHDG('Current balance')
R1041A                                      REFFLD(SSAMT4)
R1043A            LJSYSRF   R               COLHDG('SYSTEM REF')
R1043A                                      REFFLD(SSREFN)
R1055A*ADD NEW FIELD IN LNFACJ
R1055A            LJAVPMT   R               COLHDG('ADVANCE PAYMENT')
R1055A                                      REFFLD(SSAMT4)
R1055A            LJOTH     R               COLHDG('OTHER PAYMENT')
R1055A                                      REFFLD(SSAMT4)
R1055A            LJPWOS    R               COLHDG('PAID-OFF STATUS')
R1055A                                      REFFLD(SSCOD1)
R1055A            LJRECS    R               COLHDG('RECALL STATUS')
R1055A                                      REFFLD(SSCOD1)
R1055A            LJCOMS    R               COLHDG('COMPROMISE STATUS')
R1055A                                      REFFLD(SSCOD1)
R1055A            LJSUPS    R               COLHDG('SUSP. PAYMENT STATUS')
R1055A                                      REFFLD(SSCOD1)
R1055A            LJJDS     R               COLHDG('JUDEMENT STATUS')
R1055A                                      REFFLD(SSCOD1)
R1055A            LJNPLS    R               COLHDG('NPL STATUS')
R1055A                                      REFFLD(SSCOD1)
R1055A            LJSTPS    R               COLHDG('SUSPENSED STATUS')
R1055A                                      REFFLD(SSCOD1)
R1055A*STATUS
R1055A            LJDAT1    R               COLHDG('LJ-DATE1')
R1055A                                      REFFLD(SSDAT8)
R1055A            LJDAT2    R               COLHDG('LJ-DATE2')
R1055A                                      REFFLD(SSDAT8)
R1055A            LJDAT3    R               COLHDG('LJ-DATE3')
R1055A                                      REFFLD(SSDAT8)
R1055A            LJDAT4    R               COLHDG('LJ-DATE4')
R1055A                                      REFFLD(SSDAT8)
R1055A            LJSTS1    R               COLHDG('LJ-STATUS-1')
R1055A                                      REFFLD(SSCURC)
R1055A            LJSTS2    R               COLHDG('LJ-STATUS-2')
R1055A                                      REFFLD(SSCURC)
R1055A            LJSTS3    R               COLHDG('LJ-STATUS-3')
R1055A                                      REFFLD(SSCURC)
R1055A            LJSTS4    R               COLHDG('LJ-STATUS-4')
R1055A                                      REFFLD(SSCURC)
R1055A*****************************************************************
T1001A** AUTO DEDUCTION SCHEME FILE   (LNAUTD) **
T1001A*******************************************
T1001A            LATACT    R               COLHDG('Account' 'Number')
T1001A                                      REFFLD(SSACCN)
T1001A            LATATY    R               COLHDG('Account' 'Type')
T1001A                                      REFFLD(SSACCT)
T1001A            LAT1PA    R               COLHDG('1P or Non-1P Loan')
T1001A                                      REFFLD(SSCOD1)
T1001A            LATETY    R               COLHDG('External System' +
T1001C                                      'Type')
T1001A                                      REFFLD(SSCODA)
T1001A            LATPSQ    R               COLHDG('Priority Sequence')
T1001A                                      REFFLD(SSCOUA)
T1001A            LATPRT    R               COLHDG('Allow Partial Deduct')
T1001A                                      REFFLD(SSCOD1)
T1001A            LATDAC    R               COLHDG('Auto Deduction Debit' +
T1001A                                      'Account Number')
T1001A                                      REFFLD(SSACCN)
T1001A            LATDTY    R               COLHDG('Auto Deduction Debit' +
T1001A                                      'Account Type')
T1001A                                      REFFLD(SSACCT)
T1002A*****************************************************************
T1002A** LOAN INVOICE/PURCHASE ORDER FILE (LNIVPO) **
T1002A*******************************************
T1002A            LIPACT    R               COLHDG('ACCOUNT' 'NUMBER')
T1002A                                      REFFLD(SSACCN)
T1002A            LIPATY    R               COLHDG('ACCOUNT' 'TYPE')
T1002A                                      REFFLD(SSACCT)
T1002A            LIPBAT    R               COLHDG('BATCH NUMBER')
T1002A                                      REFFLD(SSDESS)
T1002A            LIPNUM    R               COLHDG('INVOICE/PO NUMBER')
T1002A                                      REFFLD(SSDESS)
T1002A            LIPISS    R               COLHDG('ISSUER (3RD' +
T1002A                                      'PARTY) ID')
T1002A                                      REFFLD(SSCODA)
T1002A            LIPDT8    R               COLHDG('INVOICE/PO DATE')
T1002A                                      REFFLD(SSDAT8)
T1002A            LIPAMT    R               COLHDG('INVOICE/PO AMOUNT')
T1002A                                      REFFLD(SSAMT4)
M2002A*****************************************************************
M2002A* LNAUCT - Ar-Rahnu Auction Account
M2002A*****************************************************************
M2002A            LAACCN    R               COLHDG('Account Number')
M2002A                                      REFFLD(SSACCN)
M2002A            LAAUD8    R               COLHDG('Eligible Date')
M2002A                                      REFFLD(SSDAT8)
M2002A            LACOID    R               COLHDG('Collateral ID')
M2002A                                      REFFLD(SSACCN)
M2002A            LAPMTC    R               COLHDG('Payment Code')
M2002A                                      REFFLD(SSCOU1)
M2002A            LANPLS    R               COLHDG('NPL/NPF Status')
M2002A                                      REFFLD(SSCOD1)
M2002A            LAPRIN    R               COLHDG('Principal Amount')
M2002A                                      REFFLD(SSAMT4)
M2002A            LAACCI    R               COLHDG('Custodian Fees')
M2002A                                      REFFLD(SSAMTG)
M2002A            LAAUST    R               COLHDG('Auction Status')
M2002A                                      REFFLD(SSCOD1)
M2029A            LAINAU    R               COLHDG('Include' 'In Auction')
M2029A                                      REFFLD(SSACCT)
M2052A            LABANK    R               COLHDG('Account Bank' 'Number')
M2052A                                      REFFLD(SSBANK)
M2029A            LABRAN    R               COLHDG('Account Branch' 'Number')
M2029A                                      REFFLD(SSBRAN)
M2052A            LAABKN    R               COLHDG('Auction Bank' 'Number')
M2052A                                      REFFLD(SSBANK)
M2052A            LAABRN    R               COLHDG('Auction Branch' 'Number')
M2052A                                      REFFLD(SSBRAN)
M2052A            LADAT8    R               COLHDG('Auction Date')
M2052A                                      REFFLD(SSDAT8)
T1004A*****************************************************************
T1004A** Tier Penalty Charge Type Parameter File (LNPAREX)
T1004A*****************************************************************
T1004A            PESEQC    R               COLHDG('Sequence of charge')
T1004A                                      REFFLD(SSCOU3)
T1004A            PEMARR    R               COLHDG('Grace Number')
T1004A                                      REFFLD(SSCOU3)
T1004A            PEMATC    R               COLHDG('Grace Code')
T1004A                                      REFFLD(SSCOD1)
T1004A            PENRAT    R               COLHDG('Penalty Rate')
T1004A                                      REFFLD(SSPERD)
T1004A            PENRTN    R               COLHDG('Penalty Prime' +
T1004A                                             'Rate Number')
T1004A                                      REFFLD(SSRATE)
T1004A            PENVRI    R               COLHDG('Penalty Prime' +
T1004A                                             'Rate variance')
T1004A                                      REFFLD(SSPERD)
T1004A            PENVRC    R               COLHDG('Penalty Prime' +
T1004A                                             'Rate variance Code')
T1004A                                      REFFLD(SSCOD1)
T1004A            PEACTC    R               COLHDG('Active Code')
T1004A                                      REFFLD(SSCOD1)
T1004A*****************************************************************
T1004A** Tier Penalty Charge Master File - Extension (LNMASEX)
T1004A*****************************************************************
T1004A            MESEQC    R               COLHDG('Sequence of charge')
T1004A                                      REFFLD(SSCOU3)
T1004A            MEMARR    R               COLHDG('Grace Number')
T1004A                                      REFFLD(SSCOU3)
T1004A            MEMATC    R               COLHDG('Grace Code')
T1004A                                      REFFLD(SSCOD1)
T1004A            MENRAT    R               COLHDG('Penalty Rate')
T1004A                                      REFFLD(SSPERD)
T1004A            MENRTN    R               COLHDG('Penalty Prime' +
T1004A                                             'Rate Number')
T1004A                                      REFFLD(SSRATE)
T1004A            MENVRI    R               COLHDG('Penalty Prime' +
T1004A                                             'Rate variance')
T1004A                                      REFFLD(SSPERD)
T1004A            MENVRC    R               COLHDG('Penalty Prime' +
T1004A                                             'Rate variance Code')
T1004A                                      REFFLD(SSCOD1)
T1004A            MEACTC    R               COLHDG('Active Code')
T1004A                                      REFFLD(SSCOD1)
T1004A*****************************************************************
G001 A** Lending Multi tier Extension - LNAMTFE
G001 A*****************************************************************
G001 A            AMPMRV    R               COLHDG('Rate Variance' 'for Payment-
G001 A                                       Amount')
G001 A                                      REFFLD(SSPERD)
G001 A            AMPMRC    R               COLHDG('Rate Variance code' 'for Pa-
G001 A                                      yment Amount')
G001 A                                      REFFLD(SSCOD1)
G005 A            AMPMRT    R               COLHDG('Rate for' 'Payment Amount')
G005 A                                      REFFLD(SSPERD)
G005 A            AMPMRN    R               COLHDG('Rate Number' 'for' 'Payment-
G005 A                                       Amount')
G005 A                                      REFFLD(SSRATE)
G003 A*****************************************************************
G003 A** Lending Alternate rate schedule Extension - LNRATEE
G003 A*****************************************************************
G003 A            ARPMRV    R               COLHDG('Rate Variance' 'for Payment-
G003 A                                       Amount')
G003 A                                      REFFLD(SSPERD)
G003 A            ARPMRC    R               COLHDG('Rate Variance code' 'for Pa-
G003 A                                      yment Amount')
G003 A                                      REFFLD(SSCOD1)
G005 A            ARPMRT    R               COLHDG('Rate for' 'Payment Amount')
G005 A                                      REFFLD(SSPERD)
G005 A            ARPMRN    R               COLHDG('Rate Number' 'for' 'Payment-
G005 A                                       Amount')
G005 A                                      REFFLD(SSRATE)
G004 ** For Info only
G004 A            CTRCNO    R               COLHDG('Contract No.')
G004 A                                      REFFLD(SSDESS)
G004 A            ACBTCN    R               COLHDG('Creation' 'Batch Number')
G004 A                                      REFFLD(SSDES2)
G006  ***************************************************************
G006 A* CLREDR - COLLATERAL REDEMPTION REQUEST
G006  ***************************************************************
G006 A            REQDT8    R               COLHDG('Requested Date')
G006 A                                      REFFLD(SSDAT8)
G006 A            REQSTS    R               COLHDG('Requested Status')
G006 A                                      REFFLD(SSCOD2)
K0001A
K0001 ***************************************************************
K0001A* LNPARN - Scheme Code Parameter
K0001 ***************************************************************
K0001
K0001             LPNCOD    R               COLHDG('Scheme' 'code')
K0001                                       REFFLD(SSPROD)
K0001             LPNDSC    R               COLHDG('Scheme Description')
K0001                                       REFFLD(SSDESM)
K0001             LPNLDS    R               COLHDG('Scheme Local' 'Description')
K0001                                       REFFLD(SSDESM)
K0001 ***************************************************************
K0001A* LNPARN1 - Tier Scheme Code Parameter
K0001 ***************************************************************
K0001             LPNPCN    R               COLHDG('Scheme Percentage')
K0001                                       REFFLD(SSPERD)
K0001             LPNFMT    R               COLHDG('Fix Amount')
K0001                                       REFFLD(SSAMT4)
K0001             LPNTRM    R               COLHDG('Scheme Term')
K0001                                       REFFLD(SSTERM)
K0001             LPNTCD    R               COLHDG('Scheme Term Code')
K0001                                       REFFLD(SSCOD1)
K0001             LPNMTD    R               COLHDG('Scheme Method')
K0001                                       REFFLD(SSACCT)
K0024A            LPAMTF    R               COLHDG('Fee Amortize Flag')
k0024A                                      REFFLD(SSCOD1)
K0016A***************************************************************
K0016A* LNLOGB  - Backdated Transaction of Cross Product
K0016A***************************************************************
K0016A            BLGMPD    R               COLHDG('Main Product')
K0016A                                      REFFLD(SSPROD)
K0016A            BLGMFD    R               COLHDG('Main Facility ID')
K0016A                                      REFFLD(SSACCN)
K0016A            BLGMAC    R               COLHDG('Main Account')
K0016A                                      REFFLD(SSACCN)
K0016A            BLGMTE    R               COLHDG('Transaction' 'Effective'-
K0016A                                             'Date')
K0016A                                      REFFLD(SSDAT8)
K0016A            BLGMTP    R               COLHDG('Transaction' 'Posting'-
K0016A                                             'Date')
K0016A                                      REFFLD(SSDAT8)
K0016A            BLGMTC    R               COLHDG('Transaction Code')
K0016A                                      REFFLD(SSCOU3)
K0016A            BLGMTA    R               COLHDG('Transaction Amount')
K0016A                                      REFFLD(SSAMT4)
K0016A            BLGEPD    R               COLHDG('Effect Product')
K0016A                                      REFFLD(SSPROD)
K0016A            BLGEFD    R               COLHDG('Effect Facility ID')
K0016A                                      REFFLD(SSACCN)
K0016A            BLGEAC    R               COLHDG('Effect Account')
K0016A                                      REFFLD(SSACCN)
K0016A            BLGMBS1   R               COLHDG('Main Before' 'Status - PEN')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGMAS1   R               COLHDG('Main After' 'Status - PEN')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGMBS2   R               COLHDG('Main Before' 'Status - SUS')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGMAS2   R               COLHDG('Main After' 'Status - SUS')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGMBS3   R               COLHDG('Main Before' 'Status - STP')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGMAS3   R               COLHDG('Main After' 'Status - STP')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGEBS1   R               COLHDG('Effect Before'-
K0016A                                             'Status - PEN')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGEAS1   R               COLHDG('Effect After'-
K0016A                                             'Status - PEN')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGEBS2   R               COLHDG('Effect Before'-
K0016A                                             'Status - SUS')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGEAS2   R               COLHDG('Effect After'-
K0016A                                             'Status - SUS')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGEBS3   R               COLHDG('Effect Before'-
K0016A                                             'Status - STP')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGEAS3   R               COLHDG('Effect After'-
K0016A                                             'Status - STP')
K0016A                                      REFFLD(SSCOD1)
K0016A            BLGMTX    R               COLHDG('Main Interest' -
K0016A                                             'Taxable')
K0016A                                      REFFLD(SSAMT4)
K0016A            BLGMNT    R               COLHDG('Main Interest' -
K0016A                                             'Non-taxable')
K0016A                                      REFFLD(SSAMT4)
A0016A            BLGMMT    R               COLHDG('Main UCR Interest')
K0016A                                      REFFLD(SSAMT4)
K0016A            BLGMLC    R               COLHDG('Main Panalty' 'Interest')
K0016A                                      REFFLD(SSAMT4)
K0016A            BLGETX    R               COLHDG('Effect Interest' -
K0016A                                             'Taxable')
K0016A                                      REFFLD(SSAMT4)
K0016A            BLGENT    R               COLHDG('Effect Interest' -
K0016A                                             'Non-taxable')
K0016A                                      REFFLD(SSAMT4)
K0016A            BLGEMT    R               COLHDG('Effect UCR Interest')
K0016A                                      REFFLD(SSAMT4)
K0016A            BLGELC    R               COLHDG('Effect Panalty' 'Interest')
K0016A                                      REFFLD(SSAMT4)
K0016A            BLGMLM    R               COLHDG('Main Facility Limit')
K0016A                                      REFFLD(SSAMT4)
K0016A            BLGELM    R               COLHDG('Effect Facility' 'Limit')
K0016A                                      REFFLD(SSAMT4)
K0021A            BLGACD    R               COLHDG('Activity Code')
K0021A                                      REFFLD(SSCOD3)
K0022A***************************************************************
K0022A* LNEXCI  - Exception file for Cross Product Activity Relationship
K0022A***************************************************************
K0022A            BCODE1    R               COLHDG('Before Code#1')
K0022A                                      REFFLD(SSCOD3)
K0022A            ACODE1    R               COLHDG('After Code#1')
K0022A                                      REFFLD(SSCOD3)
K0022A            XAMT1     R               COLHDG('Process Amount#1')
K0022A                                      REFFLD(SSAMT4)
K0022A            BCODE2    R               COLHDG('Before Code#2')
K0022A                                      REFFLD(SSCOD3)
K0022A            ACODE2    R               COLHDG('After Code#2')
K0022A                                      REFFLD(SSCOD3)
K0022A            XAMT2     R               COLHDG('Process Amount#2')
K0022A                                      REFFLD(SSAMT4)
K0022A            XDATE1    R               COLHDG('Process Date#1')
K0022A                                      REFFLD(SSDAT8)
K0022A            XDATE2    R               COLHDG('Process Date#2')
K0022A                                      REFFLD(SSDAT8)
K0022A            XFACID    R               COLHDG('Process Facility ID')
K0022A                                      REFFLD(SSACCN)
K0022A***************************************************************
K0022A* LNEXAC  - Source of account effect cross product activity
K0022A***************************************************************
K0022A            EACCTN    R               COLHDG('Effect' 'Account Number')
K0022A                                      REFFLD(SSACCN)
K0022A            EACTYE    R               COLHDG('Effect' 'Account Type')
K0022A                                      REFFLD(SSACCT)
K0022A            FACID     R               COLHDG('Source' 'Facility ID')
K0022A                                      REFFLD(SSACCN)
K0022A            EFACID    R               COLHDG('Effect' 'Facility ID')
K0022A                                      REFFLD(SSACCN)
K0022A            EPROD8    R               COLHDG('Process Date')
K0022A                                      REFFLD(SSDAT8)
K0027A***************************************************************
K0027A* LNVHST  - Car Status History File
K0027A***************************************************************
K0027A            LVACCT    R               COLHDG('Account Number')
K0027A                                      REFFLD(SSACCN)
K0027A            LVACTP    R               COLHDG('Account Type')
K0027A                                      REFFLD(SSACCT)
K0027A            LVBCHN        29
K0027A                                      TEXT('Batch Number')
K0027A            LVCSTS    R               COLHDG('Car Status')
k0027A                                      REFFLD(SSADD1)
K0027A            LVCSTD    R               COLHDG('Car Status Date')
k0027A                                      REFFLD(SSDAT8)
K0027A            LVCUPD    R               COLHDG('Update By')
k0027A                                      REFFLD(SSCODA)
K0027A            LVCREM    R               COLHDG('Remark')
k0027A                                      REFFLD(SSDESC)
K0027A            LVCHKD    R               COLHDG('Check Date')
K0027A                                      REFFLD(SSDAT8)
K0027A***************************************************************
K0027A* LNVBCH  - Export Car Report-Batch Number File
K0027A***************************************************************
K0027A            LVBRN     R               COLHDG('Branch Number')
K0027A                                      REFFLD(SSBRAN)
K0027A            LVAPNO    R               COLHDG('Loanmain Number')
K0027A                                      REFFLD(SSACCN)
K0027A            LVBCHS    R               COLHDG('Batch Status')
K0027A                                      REFFLD(SSADD1)
K0027A            LVREXD    R               COLHDG('Report Export Date')
K0027A                                      REFFLD(SSDAT8)
K0027A            LVRCYD    R               COLHDG('Report Cycle Date')
K0027A                                      REFFLD(SSDAT8)
K0027A            LVEXID    R               COLHDG('Export by User ID')
K0027A                                      REFFLD(SSCODA)
K0027A            LVTREC    R               COLHDG('Total Record')
K0027A                                      REFFLD(SSCOU5)
K0027A            LVCHKID   R               COLHDG('Check by' +
K0027A                                      'Marketing/Checker')
K0027A                                      REFFLD(SSCODA)
K0028A***************************************************************
K0028A* LNWFDX - Facility Link to Contract Ratio
K0028A***************************************************************
K0028A            PPRAT     R               COLHDG('Proportion Rate')
K0028A                                      REFFLD(SSPERD)
K0028A            PPAMT     R               COLHDG('Proportion Amount')
K0028A                                      REFFLD(SSAMT4)
K0029A***************************************************************
K0029A* NEW FIELDS
K0029A***************************************************************
     A            REFN1     R               COLHDG('Reference 1')
     A                                      REFFLD(SSGLNO)
     A            REFN2     R               COLHDG('Reference 2')
     A                                      REFFLD(SSGLNO)
     A            BILID     R               COLHDG('Biller ID')
     A                                      REFFLD(SSCODF)
     A            INTUCR    R               COLHDG('Interest of Penalty')
     A*K031                                 REFFLD(SSAMT4)
K031 A                                      REFFLD(SSAMTG)
     A            UCRTAX    R               COLHDG('Interest of penalty' -
     A                                      'in suspend (Taxable)')
     A                                      REFFLD(SSAMT4)
     A            UCRNON    R               COLHDG('Interest of penalty' -
     A                                      'in suspend' '(NonTaxable)')
     A                                      REFFLD(SSAMT4)
     A            YESUCR    R               COLHDG('Yesterday Interest' -
     A                                      'of penalty')
     A                                      REFFLD(SSAMT4)
     A            BILUCR    R               COLHDG('Bill for interest' -
     A                                      'of penalty')
     A                                      REFFLD(SSAMT4)
     A            BILUCRO   R               COLHDG('Bill for interest' -
     A                                      'of penalty' 'overdue')
     A                                      REFFLD(SSAMT4)
     A            LBUCR     R               COLHDG('Bill for interest' -
     A                                      'of penalty O/S')
     A                                      REFFLD(SSAMT4)
     A            LBUCRO    R               COLHDG('Bill for interest' -
     A                                      'of penalty Original')
     A                                      REFFLD(SSAMT4)
     A            LJCDNT    R               COLHDG('Credit Note number')
     A                                      REFFLD(SSDESS)
     A            LJUCR     R               COLHDG('Interest of penalty')
     A                                      REFFLD(SSAMT4)
     A*FILLER
K0030A            FL1FLG    R               COLHDG('Filler Flag 1')
K0030A                                      REFFLD(SSCOD1)
K0030A            FL2FLG    R               COLHDG('Filler Flag 2')
K0030A                                      REFFLD(SSCOD1)
K0030A            FL1DTE    R               COLHDG('Filler Date 1')
K0030A                                      REFFLD(SSCOU8)
K0030A            FL2DTE    R               COLHDG('Filler Date 2')
K0030A                                      REFFLD(SSCOU8)
K0030A            FL1AMT    R               COLHDG('Filler Amount 1')
K0030A                                      REFFLD(SSAMT4)
K0030A            FL2AMT    R               COLHDG('Filler Amount 2')
K0030A                                      REFFLD(SSAMT4)
K0030A            FL1COD    R               COLHDG('Filler Code 1')
K0030A                                      REFFLD(SSCODA)
K0030A            FL2COD    R               COLHDG('Filler Code 2')
K0030A                                      REFFLD(SSCODA)
K0032A**************************************************************************
K0032A*LNMASR : LOAN MASTER FILE - EXTENSION
K0032A            LNIPPOF   R               REFFLD(SSCOD1)
K0032A                                      COLHDG('ALLOW IPP' 'PAID-OFF FLAG')
K0032A                                      TEXT('ALLOW IPP PAID-OFF FLAG')
K0032A
K0032A            LNIPPEX8  R               REFFLD(SSDAT8)
K0032A                                      COLHDG('ALLOW IPP' 'EXPIRE DATE')
K0032A                                      TEXT('ALLOW IPP EXPIRE DATE')
K6401A            LNIRPP    R               REFFLD(SSACCT)
K6401A                                      COLHDG('RATE PERCENT PLAN')
K6401A                                      TEXT('RATE PERCENT PLAN')
K6401A            LNIPPT    R               REFFLD(SSACCT)
K6401A                                      COLHDG('IPP PLAN TYPE')
K6401A                                      TEXT('IPP PLAN TYPE')
K6401A            LNIDT8    R               REFFLD(SSDAT8)
K6401A                                      COLHDG('Reserve field date')
K6401A                                      TEXT('Reserve field date')
K6401A            LNIDE8    R               REFFLD(SSDAT8)
K6401A                                      COLHDG('Reserve field date 2')
K6401A                                      TEXT('Reserve field date 2')
K6401A            LNIAMT1   R               REFFLD(SSAMT4)
K6401A                                      COLHDG('Reserve amount 1')
K6401A                                      TEXT('Reserve amount 1')
K6401A            LNIAMT2   R               REFFLD(SSAMT4)
K6401A                                      COLHDG('Reserve amount 2')
K6401A                                      TEXT('Reserve amount 2')
