     A*
     A* LOAN PARAMETER FIELD REFERENCE FILE
     A*
     A***********************************************************
     A*                                                         *
     A*  LNPREF     is a part of Silverlake System (R)          *
     A*  (C) Copyright 1993, 1994                               *
     A*                 By:  Silverlake System Sdn. Bhd.        *
     A*                      50050 Kuala Lumpur Malaysia        *
     A*                                                         *
     A***********************************************************
     A* LAST CHANGED
     A*REF#  DATE     DESCRIPTION OF CHANGE         IR No/Change No.
     A*---   ----     ---------------------         ----------------
     A*********************************************************************/
     A*********************************************************************/
     A*
     A                                      REF(SILVERLAKE)
     A          R RLNPREF                   TEXT('Loan field reference file')
     A*
     A* LOAN TYPE PARAMETER FILE - LNPAR2
     A*
     A            PTYPE     R               COLHDG('Loan' 'Type')
     A*V001                                 REFFLD(SSCOD2)
V001 A                                      REFFLD(SSPROD)
     A            PCURTY    R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A            PSHDSC    R               COLHDG('Short' 'description')
     A*R1001                                REFFLD(SSCODA)
R1001A                                      REFFLD(SSDESS)
     A            PTYDSC    R               COLHDG('Type' 'Description')
     A*R1001                                REFFLD(SSDESS)
R1001A                                      REFFLD(SSDESC)
R1001A            PLTYDS    R               COLHDG('Local' 'Description')
R1001A                                      REFFLD(SSDESC)
     A*K0009      PLNGRP    R               COLHDG('Group' 'Code')
K0009A            PLNGRP    R               COLHDG('GL Group' 'Code')
     A                                      REFFLD(SSCOU5)
     A*K0009      PGRDSC    R               COLHDG('Group' 'Description')
K0009A            PGRDSC    R               COLHDG('GL Group' 'Description')
     A                                      REFFLD(SSDESS)
     A            LP2CRT    R               COLHDG('Commercial/Retail')
     A                                      REFFLD(SSCOD1)
     A*R1031      LP2PRD    R               COLHDG('Product code')
R1031A*K0009      LP2PRD    R               COLHDG('Category' 'code')
K0009A            LP2PRD    R               COLHDG('GL Product' 'code')
H001 A*                                     REFFLD(SSCOU3)
H001 A                                      REFFLD(SSCOST)
V001 A            PGBOOK    R               COLHDG('GL Book')
V001 A                                      REFFLD(SSCOD1)
     A            PLONGP    R               COLHDG('Loan' 'Group')
     A                                      REFFLD(SSCOU3)
H001 A            PRDGRP    R               COLHDG('Product' 'Group')
H001 A                                      REFFLD(SSCOD2)
     A            PISLTP    R               COLHDG('SPTF loan type')
     A                                      REFFLD(SSCOD1)
AM02 A            PAPTYP    R               COLHDG('Application Type')
AM02 A                                      REFFLD(SSCOD1)
M009 A            PMCLNI    R               COLHDG('Multi CCY Loan' 'Code')
M009 A                                      REFFLD(SSCOD1)
M009 A            PSYNLN    R               COLHDG('Syndication' 'Loan')
M009 A                                      REFFLD(SSCOD1)
     A            PIBASE    R               COLHDG('Interest' 'Base')
     A                                      REFFLD(SSCOU1)
     A            PSIBAS    R               COLHDG('Switch' 'IBASE 9')
     A                                      REFFLD(SSCOD1)
     A            PMDINT    R               COLHDG('Mode of' 'Interest')
     A                                      REFFLD(SSCOD1)
     A            PYRBSE    R               COLHDG('Year Base')
     A                                      REFFLD(SSCOU1)
     A            PYBSEL    R               COLHDG('LC Accr' 'Year Base')
     A                                      REFFLD(SSCOU1)
     A            PYBSEC    R               COLHDG('Com Fee Accr' 'Year Base')
     A                                      REFFLD(SSCOU1)
     A            PANACT    R               COLHDG('Act/Non-Act')
     A                                      REFFLD(SSCOD1)
     A            PDEPTC    R               COLHDG('Dept' ' Code')
     A                                      REFFLD(SSCOU3)
     ** Islamic information
     A            PICEPT    R               COLHDG('Concept code')
     A                                      REFFLD(SSCOD2)
M021 A            PISFUN    R               COLHDG('Source of Fund')
M021 A                                      REFFLD(SSCOD5)
SS002A            PISTYF    R               COLHDG('Detail Type of Fund')
SS002A                                      REFFLD(SSCOD3)
SS002A            PMPOCT    R               COLHDG('Murabahah Purchase' -
SS002A                                      'Orderer Category')
SS002A                                      REFFLD(SSCOD1)
SS002A            PIJACT    R               COLHDG('Ijarah Category')
SS002A                                      REFFLD(SSCOD1)
SS002A            PMUYCT    R               COLHDG('Musyarakah Category')
SS002A                                      REFFLD(SSCOD2)
SS002A            POOLID    R               COLHDG('Pool ID')
SS002A                                      REFFLD(SSCOD3)
SS002A            PIDINC    R               COLHDG('Deferred Income')
SS002A                                      REFFLD(SSCOD1)
     A** F=Flat rate   Blank=refer to IBASE & IFREQ
     A            FULMTD    R               COLHDG('Fulrel Profit' 'cal mthod')
     A                                      REFFLD(SSCOD1)
     A** A=average  D=Drawdown schedule  F=Full amount
     A            GPPMTD    R               COLHDG('GPP calculation' 'Method')
     A                                      REFFLD(SSCOD1)
     A** Y= to compound         N=no compound
     A            COMMTD    R               COLHDG('Compounding' 'Method')
     A                                      REFFLD(SSCOD1)
     A**
     A********* REBATE REFUND METHOD P=UPON PAYMENT
     A** P=UPON REPAYMENT
     A** F=UPON FULLY RELEASED (GPP)
     A** E=UPON GRACE EXPIRY DATE (GPP)
     A** BLANK = NO REFUND
     A            PRFGPP    R               COLHDG('Refund' '- GPP Profit')
     A                                      REFFLD(SSCOD1)
     A            PRFPFT    R               COLHDG('Refund' '- Fulrel Profit')
     A                                      REFFLD(SSCOD1)
A005 A            PMXGTR    R               COLHDG('Max. GPP Term')
A005 A                                      REFFLD(SSTU05)
A005 A            PMNGTR    R               COLHDG('Min. GPP Term')
A005 A                                      REFFLD(SSTU05)
A005 A            PMGPPC    R               COLHDG('Max.& Min.' 'GPP -
A005 A                                      term code')
A005 A                                      REFFLD(SSCOD1)
     A            PFLCOM    R               COLHDG('Earn full' 'Comm-Payoff')
     A                                      REFFLD(SSCOD1)
     A            PSPLSD    R               COLHDG('Split to' 'S/dep shortfall')
     A                                      REFFLD(SSCOD1)
     A            PUPLSD    R               COLHDG('Grace - Uplift' 'Sec. Dep')
     A                                      REFFLD(SSCOU3)
AM01 A            PREBNT    R               COLHDG('Gen Notice' 'for Rebate')
     A                                      REFFLD(SSCOD1)
     ** Product control
     A            PALWBD    R               COLHDG('Allow' 'Backdating')
     A                                      REFFLD(SSCOD1)
     A            PBKDYS    R               COLHDG('NDays to' 'Backdate')
     A                                      REFFLD(SSCOU3)
     A            PLIMIT    R               COLHDG('Product' 'Limit')
     A                                      REFFLD(SSAMT4)
M021 A            PMAXLM    R               COLHDG('Product' 'Maximum Limit')
M021 A                                      REFFLD(SSAMT4)
SS09 A            PMINLM    R               COLHDG('Product' 'Minimum Limit')
SS09 A                                      REFFLD(SSAMT4)
M021 A            PMAXTM    R               COLHDG('Product' 'Maximum Term')
M021 A                                      REFFLD(SSCOU5)
M021 A            PMAXTC    R               COLHDG('Prod' 'Maximum Term Code')
M021 A                                      REFFLD(SSCOD1)
SS13 A            PMINTM    R               COLHDG('Product' 'Minimum Term')
SS13 A                                      REFFLD(SSCOU5)
SS13 A            PMINTC    R               COLHDG('Prod' 'Minimum Term Code')
SS13 A                                      REFFLD(SSCOD1)
H001 A            PEFFD8    R               COLHDG('Product' 'Effective Date')
H001 A                                      REFFLD(SSDAT8)
     A            PEXPD8    R               COLHDG('Product' 'expiry date')
     A                                      REFFLD(SSDAT8)
H001 A            PAGELM    R               COLHDG('Product' 'Age Limit')
H001 A                                      REFFLD(SSCOU3)
H001 A            PRDDLR    R               COLHDG('Dealer' 'Product')
H001 A                                      REFFLD(SSCOD1)
     ** Interest information
M033 A            PACMIN    R               COLHDG('Accrue memo' 'interest')
M033 A                                      REFFLD(SSCOD1)
     A            PRATE     R               COLHDG('Default' 'interest rate')
     A                                      REFFLD(SSPERD)
     A            PRATN     R               COLHDG('Default Prime' 'Rate No.')
     A                                      REFFLD(SSRATE)
M009 A            PRVARI    R               COLHDG('Variance')
M009 A                                      REFFLD(SSPERD)
M009 A            PVARC     R               COLHDG('Variance Code')
M009 A                                      REFFLD(SSCOD1)
     A            PMINRT    R               COLHDG('Minimum' 'Int Rate')
     A                                      REFFLD(SSPERD)
SS09 A            PMINRN    R               COLHDG('Minimum Prime' 'Rate No.')
SS09 A                                      REFFLD(SSRATE)
SS09 A            PMINVR    R               COLHDG('Minimum Rate' 'Variance')
SS09 A                                      REFFLD(SSPERD)
SS09 A            PMINVC    R               COLHDG('Minimum Rate' 'Variance' -
SS09 A                                      'Code')
SS09 A                                      REFFLD(SSCOD1)
     A            PMAXRT    R               COLHDG('Maximum' 'Int Rate')
     A                                      REFFLD(SSPERD)
SS09 A            PMAXRN    R               COLHDG('Maximum Prime' 'Rate No.')
SS09 A                                      REFFLD(SSRATE)
SS09 A            PMAXVR    R               COLHDG('Maximum Rate' 'Variance')
SS09 A                                      REFFLD(SSPERD)
SS09 A            PMAXVC    R               COLHDG('Maximum Rate' 'Variance' -
SS09 A                                      'Code')
SS09 A                                      REFFLD(SSCOD1)
R1025A            PMAXIC    R               COLHDG('Maximum' 'Income %')
R1025A                                      REFFLD(SSPERD)
     A            PRFLOR    R               COLHDG('Rate' 'Floor')
     A                                      REFFLD(SSPERD)
     A            PRCEIL    R               COLHDG('Rate' 'Ceiling')
     A                                      REFFLD(SSPERD)
A028 A            PVCEIL    R               COLHDG('Rate Variance' 'Ceiling')
A028 A                                      REFFLD(SSPERD)
A028 A            PVFLOR    R               COLHDG('Rate Variance' 'Floor')
A028 A                                      REFFLD(SSPERD)
     A            PMINCG    R               COLHDG('Minimum Int' 'Charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            PCRATE    R               COLHDG('Recal RATE' 'FD Pledged')
     A                                      REFFLD(SSCOD1)
     A            PDREST    R               COLHDG('Matured' 'Cal Daily Rest')
     A                                      REFFLD(SSCOD1)
     A            PMRATE    R               COLHDG('Cal Int' 'Maturity Rate')
     A                                      REFFLD(SSCOD1)
M021 A            PRDRST    R               COLHDG('Recalled' 'Cal Daily Rest')
M021 A                                      REFFLD(SSCOD1)
H001 A            PMXAVM    R               COLHDG('Max Adv' 'Margin')
H001 A                                      REFFLD(SSPERD)
     ** Earn additional day
H001 A            PERNAI    R               COLHDG('Earn Additional' 'Day Int')
H001 A                                      REFFLD(SSCOD1)
OS01 A            PERNAL    R               COLHDG('Earn Additional' 'Day LC')
OS01 A                                      REFFLD(SSCOD1)
OS01 A            PERNAC    R               COLHDG('Earn Additional' 'Day CF')
OS01 A                                      REFFLD(SSCOD1)
     ** Use yesterday balance for accrual
OS03 A            PYSBIN    R               COLHDG('Use Yesterday' 'Balance' -
OS03 A                                      'for accrue Int')
OS03 A                                      REFFLD(SSCOD1)
OS03 A            PYSBLC    R               COLHDG('Use Yesterday' 'Balance' -
OS03 A                                      'for accrue LC')
OS03 A                                      REFFLD(SSCOD1)
OS03 A            PYSBCF    R               COLHDG('Use Yesterday' 'Balance' -
OS03 A                                      'for accrue CF')
OS03 A                                      REFFLD(SSCOD1)
     ** Late charge information
     A            PACMLC    R               COLHDG('Accrue memo' 'Late charges')
     A                                      REFFLD(SSCOD1)
     A*R1022      PLATCD    R               COLHDG('Late Charge' 'Code')
R1022A            PLATCD    R               COLHDG('Int Late Charge' 'Code')
     A                                      REFFLD(SSCOU3)
     A            PLCTYP    R               COLHDG('Late charge' 'type')
     A                                      REFFLD(SSCOU3)
     A            PTAKLC    R               COLHDG('Take Late' 'Charges Always')
     A                                      REFFLD(SSCOD1)
     A            PMAXLC    R               COLHDG('Maximum' 'Late Charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            PWVELC    R               COLHDG('Waive L/C' 'B4 maturity')
     A                                      REFFLD(SSCOD1)
AM01 A            PLCFR     R               COLHDG('LC Freq')
     A                                      REFFLD(SSCOU3)
AM01 A            PLCFC     R               COLHDG('LC freq code')
     A                                      REFFLD(SSCOD1)
     ** Payment information
     A            PFREQ     R               COLHDG('Payment' 'Frequency')
     A                                      REFFLD(SSCOU3)
     A            PFCODE    R               COLHDG('Payment' 'Freq Code')
     A                                      REFFLD(SSCOD1)
     A            PIFREQ    R               COLHDG('Int Payment' 'Frequency')
     A                                      REFFLD(SSCOU3)
     A            PIFCOD    R               COLHDG('Int Payment' 'Freq Code')
     A                                      REFFLD(SSCOD1)
     A            PPMTCD    R               COLHDG('Payment' 'Code')
     A                                      REFFLD(SSCOU1)
     A            PUPPCD    R               COLHDG('Auto update' 'Pymt cpde')
     A                                      REFFLD(SSCOD1)
     A            PDFPCD    R               COLHDG('Default' 'Pymt cpde(Upt)')
     A                                      REFFLD(SSCOU1)
     ** Auto Set Rate Review Date
SS002A            PCRRD     R               COLHDG('Auto set Rate Review' -
SS002A                                      'Date')
SS002A                                      REFFLD(SSCOD1)
SS002A            PPRTM     R               COLHDG('Prime Review Term')
SS002A                                      REFFLD(SSCOU5)
SS002A            PPRCD     R               COLHDG('Prime Review Term' -
SS002A                                      'Code')
SS002A                                      REFFLD(SSCOD1)
     ** Auto Set Payment Date
     A            PADJDD    R               COLHDG('Adj NPDT' 'on NBD or PH')
     A                                      REFFLD(SSCOD1)
M001 A            PADJID    R               COLHDG('Adj NIPDT' 'on NBD or PH')
M001 A                                      REFFLD(SSCOD1)
     A            PFFPDT    R               COLHDG('Set FPDT' 'Upon 1st rel')
     A                                      REFFLD(SSCOD1)
     A            PCFPDT    R               COLHDG('Cal 1st Instl' 'Date')
     A                                      REFFLD(SSCOD1)
R1034A            PRCFPD    R               COLHDG('Recal 1st Instl' 'Date')
R1034A                                      REFFLD(SSCOD1)
     A            PUPDOB    R               COLHDG('Disburse' 'on/bef day')
     A                                      REFFLD(SSCOU2)
     A            PDAFP     R               COLHDG('Day for auto' '1st pymt')
     A                                      REFFLD(SSCOU2)
     A            PCNIPD    R               COLHDG('Auto set' 'NIPDT')
     A                                      REFFLD(SSCOD1)
     A            PUPIOB    R               COLHDG('Disburse' 'on/bef day')
     A                                      REFFLD(SSCOU2)
     A            PDANIP    R               COLHDG('Day for auto' 'NIPDT')
     A                                      REFFLD(SSCOU2)
     **AM01
     A            PCLCD     R               COLHDG('Auto set' 'first LC dt')
     A                                      REFFLD(SSCOD1)
     A            PUPLCB    R               COLHDG('Day for Auto' 'set on/b4')
     A                                      REFFLD(SSCOU2)
     A            PDANLC    R               COLHDG('Day of mth' 'For auto set')
     A                                      REFFLD(SSCOU2)
     A            PCCFD     R               COLHDG('Auto set' 'first CF dt')
     A                                      REFFLD(SSCOD1)
     A            PUPCFB    R               COLHDG('Day for Auto' 'set on/b4')
     A                                      REFFLD(SSCOU2)
     A            PDANCF    R               COLHDG('Day of mth' 'For auto set')
     A                                      REFFLD(SSCOU2)
     **
     A            PASMAT    R               COLHDG('Auto set' 'maturity date?')
     A                                      REFFLD(SSCOD1)
     A            PMTHBK    R               COLHDG('Nmth grace on' 'FPDT6 cal')
     A                                      REFFLD(SSCOU3)
SS09 A            PDAYBK    R               COLHDG('Day grace on' 'FPDT6 cal')
SS09 A                                      REFFLD(SSCOU3)
     A            PPRCPM    R               COLHDG('Percent of' 'Payment')
     A                                      REFFLD(SSPERD)
R1001A            PVRAMT    R               COLHDG('Payment Variance' 'Amount')
R1001A                                      REFFLD(SSAMT4)
     **AM01
     A            PGFREL    R               COLHDG('Grace period' 'FREL Date')
     A                                      REFFLD(SSCOU3)
     A            PGFRCD    R               COLHDG('Grace period' 'FREL Date')
     A                                      REFFLD(SSCOD1)
     A            PGFUL     R               COLHDG('Grace period' 'FULL Date')
     A                                      REFFLD(SSCOU3)
     A            PGFUCD    R               COLHDG('Grace period' 'FULL Date')
     A                                      REFFLD(SSCOD1)
     A            PGAVAI    R               COLHDG('Grace period' 'Avail Date')
     A                                      REFFLD(SSCOU3)
     A            PGAVCD    R               COLHDG('Grace period' 'Avail Date')
     A                                      REFFLD(SSCOD1)
     ** Past Due info
     A            P1MMPD    R               COLHDG('Months for 1st' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P2MMPD    R               COLHDG('Months for 2nd' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P3MMPD    R               COLHDG('Months for 3rd' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P4MMPD    R               COLHDG('Months for 4th' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P5MMPD    R               COLHDG('Months for 5th' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P6MMPD    R               COLHDG('Months for 6th' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
SS01 A            P4SCMO    R               COLHDG('HP 4th Schedule' '- Month')
SS01 A                                      REFFLD(SSCOU3)
     A            P1DDPD    R               COLHDG('Days for 1st' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P2DDPD    R               COLHDG('Days for 2nd' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P3DDPD    R               COLHDG('Days for 3rd' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P4DDPD    R               COLHDG('Days for 4th' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P5DDPD    R               COLHDG('Days for 5th' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
     A            P6DDPD    R               COLHDG('Days for 6th' 'Pdue Not')
     A                                      REFFLD(SSCOU3)
SS01 A            P4SCDA    R               COLHDG('HP 4th Schedule' '- Day')
SS01 A                                      REFFLD(SSCOU3)
SS01 A            P1RADA    R               COLHDG('HP 1st RA Day fr' +
SS01 A                                               '4th Schedule')
SS01 A                                      REFFLD(SSCOU3)
SS01 A            P2RADA    R               COLHDG('HP 2nd RA Day fr' +
SS01 A                                               '4th Schedule')
SS01 A                                      REFFLD(SSCOU3)
     A            PPDRPT    R               COLHDG('NDays for' ' Pdue Report')
     A                                      REFFLD(SSCOU3)
     A            PRHSNW    R               COLHDG('Print History' 'New')
     A                                      REFFLD(SSCOD1)
     A            PRHSPD    R               COLHDG('Print History' 'Past Due')
     A                                      REFFLD(SSCOD1)
     A            PRHSPO    R               COLHDG('Print History' 'Paid off')
     A                                      REFFLD(SSCOD1)
     A            PDHSDY    R               COLHDG('NDays for' 'Pdue History')
     A                                      REFFLD(SSCOU3)
     ** Update maturity date
H001 A            PCMATD    R               COLHDG('Maturity' 'Calc Method')
H001 A                                      REFFLD(SSCOD1)
     A            PUMATD    R               COLHDG('Auto extend' 'maturity dat')
     A                                      REFFLD(SSCOD1)
     A            PUMDRC    R               COLHDG('Update Mat dt' '-Rate chg')
     A                                      REFFLD(SSCOD1)
     A            PUMDCP    R               COLHDG('Update Mat date' '- C/P')
     A                                      REFFLD(SSCOD1)
M009 A            PUMDDB    R               COLHDG('Upd Mat date' '- Disb')
M009 A                                      REFFLD(SSCOD1)
AM01 A            PRCMRT    R               COLHDG('Use Maturity Rate' -
     A                                      'Upon Recalled')
     A                                      REFFLD(SSCOD1)
OS01 A            PSDDYM    R               COLHDG('Switch to' 'Monthly Pay' -
OS01 A                                      'Feq Upon Matured')
OS01 A                                      REFFLD(SSCOD1)
OS01 A            PDDAYM    R               COLHDG('Due day' 'Upon Matured')
OS01 A                                      REFFLD(SSCOU2)
SS09 A            PTYPTR    R               COLHDG('Matured Transfer' -
SS09 A                                      'Product Type')
SS09 A                                      REFFLD(SSPROD)
     A* REAMORTIZE OPTION
     A            PREAMO    R               COLHDG('Reamortize' 'pmt amount')
     A                                      REFFLD(SSCOD1)
     A            PCPAMR    R               COLHDG('Reamortise when' 'CP')
     A                                      REFFLD(SSCOD1)
     A            PABKD     R               COLHDG('Reamortise' 'upon disburse')
     A                                      REFFLD(SSCOD1)
SS08 A            PRUEXI    R               COLHDG('Reamortise upon' 'exc int')
SS08 A                                      REFFLD(SSCOD1)
M009 A            PREAMG    R               COLHDG('Reamortise Payment' 'Grace')
M009 A                                      REFFLD(SSCOU3)
     A* C-REAMORTIZE ON CBAL, D-REAMORTIZE ON AMTREL, BLANK-REAMORTIZE ON ORGAMT
     A            POREAM    R               COLHDG('Reamortize' 'Rate chg opt')
     A                                      REFFLD(SSCOD1)
     A            POCPAM    R               COLHDG('Reamortize' 'Cap.Rep. opt')
     A                                      REFFLD(SSCOD1)
     A            POABKD    R               COLHDG('Reamortize' 'Disburse opt')
     A                                      REFFLD(SSCOD1)
SS08 A            POREXI    R               COLHDG('Reamortize' 'Exc Int. opt')
SS08 A                                      REFFLD(SSCOD1)
     ** Date for rebate computation
     A            PRDTBK    R               COLHDG('Date for' 'Rebate - Bank')
     A                                      REFFLD(SSCOD1)
     A            PRDTDL    R               COLHDG('Date for' 'Rebate - Dlr')
     A                                      REFFLD(SSCOD1)
     A            PRDTCL    R               COLHDG('Date for' 'Rebate - CL')
     A                                      REFFLD(SSCOD1)
     A            PRDTAH    R               COLHDG('Date for' 'Rebate - A & H')
     A                                      REFFLD(SSCOD1)
     A            PRDTMS    R               COLHDG('Date for' 'Rebate - Misc')
     A                                      REFFLD(SSCOD1)
     A            PRDTTT    R               COLHDG('Date for' 'Rebate-2 Tier')
     A                                      REFFLD(SSCOD1)
SS01 A            PRDTDR    R               COLHDG('Date for Rebate' '-Dlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRDTSD    R               COLHDG('Date for Rebate' 'SDlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRDTSM    R               COLHDG('Date for Rebate' 'Sman Com')
SS01 A                                      REFFLD(SSCOD1)
     ** Days for rebate computation
     A            PRLDBK    R               COLHDG('NDays Roll' 'Rebate - Bank')
     A                                      REFFLD(SSCOU3)
     A            PRLDDL    R               COLHDG('NDays Roll' 'Rebate - Dlr')
     A                                      REFFLD(SSCOU3)
     A            PRLDCL    R               COLHDG('NDays Roll' 'Rebate - CL')
     A                                      REFFLD(SSCOU3)
     A            PRLDAH    R               COLHDG('NDays Roll' 'Rebate - A&H')
     A                                      REFFLD(SSCOU3)
     A            PRLDMS    R               COLHDG('NDays Roll' 'Rebate - Misc')
     A                                      REFFLD(SSCOU3)
     A            PRLDTT    R               COLHDG('NDays Roll' 'Rebate - 2' -
     A                                      'Tier')
     A                                      REFFLD(SSCOU3)
SS01 A            PRLDDR    R               COLHDG('NDays Roll Rebate' +
SS01 A                                               '-Dlr Com')
SS01 A                                      REFFLD(SSCOU3)
SS01 A            PRLDSD    R               COLHDG('NDays Roll Rebate' +
SS01 A                                               'SubDlr Com')
SS01 A                                      REFFLD(SSCOU3)
SS01 A            PRLDSM    R               COLHDG('NDays Roll Rebate' +
SS01 A                                               'Salesman Com')
SS01 A                                      REFFLD(SSCOU3)
     ** Extra month earning on 1st day
     A            PRMEBK    R               COLHDG('Earn 1 Mo' '1st Day - Bank')
     A                                      REFFLD(SSCOD1)
     A            PRMEDL    R               COLHDG('Earn 1 Mo' '1st Day - Dlr')
     A                                      REFFLD(SSCOD1)
     A            PRMECL    R               COLHDG('Earn 1 Mo' '1st Day - CL')
     A                                      REFFLD(SSCOD1)
     A            PRMEAH    R               COLHDG('Earn 1 Mo' '1st Day - A&H')
     A                                      REFFLD(SSCOD1)
     A            PRMEMS    R               COLHDG('Earn 1 Mo' '1st Day - Misc')
     A                                      REFFLD(SSCOD1)
     A            PRMETT    R               COLHDG('Earn 1 Mo' '1st Day - 2' -
     A                                      'Tier')
     A                                      REFFLD(SSCOD1)
SS01 A            PRMEDR    R               COLHDG('Earn 1 Mo 1st Day' +
SS01 A                                               '-Dlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRMESD    R               COLHDG('Earn 1 Mo 1st Day' +
SS01 A                                               'SubDlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRMESM    R               COLHDG('Earn 1 Mo 1st Day' +
SS01 A                                               'Salesman Com')
SS01 A                                      REFFLD(SSCOD1)
     A** R=Rule 78  S=Straight line  O=Islamic  D=Daily   A=Actual
     A            PRMTBK    R               COLHDG('Rebate' 'Method - Bank')
     A                                      REFFLD(SSCOD1)
     A            PRMTDL    R               COLHDG('Rebate' 'Method - Dealer')
     A                                      REFFLD(SSCOD1)
     A            PRMTCL    R               COLHDG('Rebate' 'Method - CL')
     A                                      REFFLD(SSCOD1)
     A            PRMTAH    R               COLHDG('Rebate' 'Method - A&H')
     A                                      REFFLD(SSCOD1)
     A            PRMTMS    R               COLHDG('Rebate' 'Method - Misc Ins')
     A                                      REFFLD(SSCOD1)
     A            PRMTTT    R               COLHDG('Rebate' 'Method - 2 Tier')
     A                                      REFFLD(SSCOD1)
SS01 A            PRMTDR    R               COLHDG('Rebate Method' '-Dlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRMTSD    R               COLHDG('Rebate Method' +
SS01 A                                               'SubDlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRMTSM    R               COLHDG('Rebate Method' +
SS01 A                                               'Salesman Com')
SS01 A                                      REFFLD(SSCOD1)
     ** Rebate method upon payoff
V009 ** R=Rule 78  S=Straight line
V009 A            PRPOBK    R               COLHDG('Reb Mtd' 'Upn PF - Bank')
V009 A                                      REFFLD(SSCOD1)
V009 A            PRPODL    R               COLHDG('Reb Mtd' 'Upn PF - Dealer')
V009 A                                      REFFLD(SSCOD1)
V009 A            PRPOCL    R               COLHDG('Reb Mtd' 'Upn PF - CL')
V009 A                                      REFFLD(SSCOD1)
V009 A            PRPOAH    R               COLHDG('Reb Mtd' 'Upn PF - A&H')
V009 A                                      REFFLD(SSCOD1)
V009 A            PRPOMS    R               COLHDG('Reb Mtd' 'Upn PF- Misc Ins')
V009 A                                      REFFLD(SSCOD1)
V009 A            PRPOTT    R               COLHDG('Reb Mtd' 'Upn PF - 2 Tier')
V009 A                                      REFFLD(SSCOD1)
SS01 A            PRPODR    R               COLHDG('Reb Mtd' 'Upn PF-Dlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRPOSD    R               COLHDG('Reb Mtd' 'Upn PF-SDlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRPOSM    R               COLHDG('Reb Mtd' 'Upn PF-SMan Com')
SS01 A                                      REFFLD(SSCOD1)
     ** Minimum amount to rebate
     A            PMNRBK    R               COLHDG('Min to Rebate - Bank')
     A                                      REFFLD(SSAMT1)
     A            PMNRDL    R               COLHDG('Min to Rebate' ' - Dealer')
     A                                      REFFLD(SSAMT1)
     A            PMNRCL    R               COLHDG('Min to Rebate - CL')
     A                                      REFFLD(SSAMT1)
     A            PMNRAH    R               COLHDG('Min to Rebate - A&H')
     A                                      REFFLD(SSAMT1)
     A            PMNRMS    R               COLHDG('Min to Rebate' '- Misc Ins')
     A                                      REFFLD(SSAMT1)
     A            PMNRTT    R               COLHDG('Min to Rebate' '- 2 Tier')
     A                                      REFFLD(SSAMT1)
SS01 A            PMNRDR    R               COLHDG('Min to Rebate' '-Dlr Com')
SS01 A                                      REFFLD(SSAMT1)
SS01 A            PMNRSD    R               COLHDG('Min to Rebate' +
SS01 A                                               '-SubDlr Com')
SS01 A                                      REFFLD(SSAMT1)
SS01 A            PMNRSM    R               COLHDG('Min to Rebate' +
SS01 A                                               '-Salesman Com')
SS01 A                                      REFFLD(SSAMT1)
     ** Compute rebate on Calender/Anniversary
     A            PRCABK    R               COLHDG('Rebate on' 'Cal/Ann - Bank')
     A                                      REFFLD(SSCOD1)
     A            PRCADL    R               COLHDG('Rebate on' 'Cal/Ann - Deal')
     A                                      REFFLD(SSCOD1)
     A            PRCACL    R               COLHDG('Rebate on' 'Cal/Ann - CL')
     A                                      REFFLD(SSCOD1)
     A            PRCAAH    R               COLHDG('Rebate on' 'Cal/Ann - A&H')
     A                                      REFFLD(SSCOD1)
     A            PRCAMS    R               COLHDG('Rebate on' 'Cal/Ann - Misc')
     A                                      REFFLD(SSCOD1)
     A            PRCATT    R               COLHDG('Rebate on' 'Cal/Ann-2 Tier')
     A                                      REFFLD(SSCOD1)
SS01 A            PRCADR    R               COLHDG('Rebate on' 'Cal/Ann-2 Dlr')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRCASD    R               COLHDG('Rebate on' 'Cal/Ann-2 SDlr')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRCASM    R               COLHDG('Rebate on' 'Cal/Ann-2 SMan')
SS01 A                                      REFFLD(SSCOD1)
     ** Extra month earning upon payoff
     A            PREXBK    R               COLHDG('Earn extra mo' 'R78 payoff')
     A                                      REFFLD(SSCOD1)
     A            PREXDL    R               COLHDG('Earn extra mo' 'R78 payoff')
     A                                      REFFLD(SSCOD1)
     A            PREXCL    R               COLHDG('Earn extra mo' 'R78 payoff')
     A                                      REFFLD(SSCOD1)
     A            PREXAH    R               COLHDG('Earn extra mo' 'R78 payoff')
     A                                      REFFLD(SSCOD1)
     A            PREXMS    R               COLHDG('Earn extra mo' 'R78 payoff')
     A                                      REFFLD(SSCOD1)
     A            PREXTT    R               COLHDG('Earn extra mo' 'R78 payoff')
     A                                      REFFLD(SSCOD1)
SS01 A            PREXDR    R               COLHDG('Earn extra mo' 'R78 payoff')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PREXSD    R               COLHDG('Earn extra mo' 'R78 payoff')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PREXSM    R               COLHDG('Earn extra mo' 'R78 payoff')
SS01 A                                      REFFLD(SSCOD1)
     ** Refund upon payoff
     A            PRFDBK    R               COLHDG('Payoff Refund' '- BKDISC')
     A                                      REFFLD(SSCOD1)
     A            PRFDDL    R               COLHDG('Payoff Refund' '- DLRDSC')
     A                                      REFFLD(SSCOD1)
     A            PRFDCL    R               COLHDG('Payoff Refund' '-CL rebate')
     A                                      REFFLD(SSCOD1)
     A            PRFDAH    R               COLHDG('Payoff Refund' 'A&H rebate')
     A                                      REFFLD(SSCOD1)
     A            PRFDMS    R               COLHDG('Payof Refund' 'M/I rebate')
     A                                      REFFLD(SSCOD1)
     A            PRFDTT    R               COLHDG('Payoff Refund' '2 tier reb')
     A                                      REFFLD(SSCOD1)
SS01 A            PRFDLR    R               COLHDG('Payoff Refund' 'Dlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRFDSD    R               COLHDG('Payoff Refund' 'SubDlr Com')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PRFDSM    R               COLHDG('Payoff Refund' 'SMan Com')
SS01 A                                      REFFLD(SSCOD1)
     ** Capitalised Info
     A            PCAPMT    R               COLHDG('Cap. accrue' 'at maturity')
     A                                      REFFLD(SSCOD1)
     A            PCAPNP    R               COLHDG('Cap. acc EOM' 'for NPL/MAT')
     A                                      REFFLD(SSCOD1)
     A            PCAPIN    R               COLHDG('Capitalize accrue' 'at EOM')
     A                                      REFFLD(SSCOD1)
     A            PCAPLC    R               COLHDG('Capitalize L/C' 'at EOM')
     A                                      REFFLD(SSCOD1)
     A            PCAPCA    R               COLHDG('Capitalize com fee' 'to OC')
     A                                      REFFLD(SSCOD1)
     A            PCPCOM    R               COLHDG('Cap Com fee' 'OTHCHG/MISC')
     A                                      REFFLD(SSCOD1)
     A            PCTYPE    R               COLHDG('Charge type' 'Cap com fee')
     A                                      REFFLD(SSCOD2)
     A            PCAPFL    R               COLHDG('Cap Int' 'On Full Rel')
     A                                      REFFLD(SSCOD1)
     A            PACCAP    R               COLHDG('Accrue on' 'Cap Interest')
     A                                      REFFLD(SSCOD1)
     A* Add on balance for accrue b4 1st payment date
     A            PACMC     R               COLHDG('Accrue on' 'Misc cost(Y/N)')
     A                                      REFFLD(SSCOD1)
     A            PACOC     R               COLHDG('Accrue on' 'Other chg(Y/N)')
     A                                      REFFLD(SSCOD1)
     A            PACLC     R               COLHDG('Accrue on' 'Late chg (Y/N)')
     A                                      REFFLD(SSCOD1)
     A            PACINT    R               COLHDG('Accrue on' 'Pyble int(Y/N)')
     A                                      REFFLD(SSCOD1)
M009 A            PACCF     R               COLHDG('Accrue on' 'Comm Fee (Y/N)')
M009 A                                      REFFLD(SSCOD1)
M019 A            PACRIN    R               COLHDG('Accrue on' 'Restr int(Y/N)')
M019 A                                      REFFLD(SSCOD1)
M019 A            PACRLC    R               COLHDG('Accrue on' 'Restr LC (Y/N)')
M019 A                                      REFFLD(SSCOD1)
M024 A            PACMOR    R               COLHDG('Accrue on' 'Mora Int during-
M024 A                                      ' 'Mora Prd (Y/N)')
M024 A                                      REFFLD(SSCOD1)
     A* Cater for Add on accrual loan
M001 A            PPBORG    R               COLHDG('Incl ORGAMT on' 'rest bal')
M001 A                                      REFFLD(SSCOD1)
     A            PPBMC     R               COLHDG('Incl MISC' 'on rest bal')
     A                                      REFFLD(SSCOD1)
     A            PPBOC     R               COLHDG('Incl OTHCHG'  'on rest bal')
     A                                      REFFLD(SSCOD1)
     A            PPBLC     R               COLHDG('Incl L/C'  'on rest bal')
     A                                      REFFLD(SSCOD1)
     A            PPBINT    R               COLHDG('Incl INTPAY'  'on rest bal')
     A                                      REFFLD(SSCOD1)
M009 A            PPBCF     R               COLHDG('Incl COMACC' 'on rest bal')
M009 A                                      REFFLD(SSCOD1)
M019 A            PPBRIN    R               COLHDG('Incl R/Int'  'on rest bal')
M019 A                                      REFFLD(SSCOD1)
SS09 A            PPBMIN    R               COLHDG('Incl M/Int'  'on rest bal')
SS09 A                                      REFFLD(SSCOD1)
M019 A            PPBRLC    R               COLHDG('Incl R/LC'  'on rest bal')
M019 A                                      REFFLD(SSCOD1)
     A            PPBUUL    R               COLHDG('Incl Unused' 'on rest bal')
     A                                      REFFLD(SSCOD1)
     A* Cater for matured or recalled
BA21 A            PACMC3    R               COLHDG('Acc on M/C' 'Mature')
BA21 A                                      REFFLD(SSCOD1)
BA21 A            PACOC3    R               COLHDG('Acc on O/C' 'Mature')
BA21 A                                      REFFLD(SSCOD1)
BA21 A            PACLC3    R               COLHDG('Acc on L/C' 'Mature')
BA21 A                                      REFFLD(SSCOD1)
BA21 A            PACIN3    R               COLHDG('Acc on Int' 'Mature')
BA21 A                                      REFFLD(SSCOD1)
BA21 A            PACCF3    R               COLHDG('Acc on C/F' 'Mature')
BA21 A                                      REFFLD(SSCOD1)
M019 A            PACRI3    R               COLHDG('Acc on R/I' 'Mature')
M019 A                                      REFFLD(SSCOD1)
SS09 A            PACMI3    R               COLHDG('Acc on M/I' 'Mature')
SS09 A                                      REFFLD(SSCOD1)
M019 A            PACRL3    R               COLHDG('Acc on R/L' 'Mature')
M019 A                                      REFFLD(SSCOD1)
     A* Cater for matured or recalled
M023 A            PACMCR    R               COLHDG('Acc on M/C' 'Recall')
M023 A                                      REFFLD(SSCOD1)
M023 A            PACOCR    R               COLHDG('Acc on O/C' 'Recall')
M023 A                                      REFFLD(SSCOD1)
M023 A            PACLCR    R               COLHDG('Acc on L/C' 'Recall')
M023 A                                      REFFLD(SSCOD1)
M023 A            PACINR    R               COLHDG('Acc on Int' 'Recall')
M023 A                                      REFFLD(SSCOD1)
M023 A            PACCFR    R               COLHDG('Acc on C/F' 'Recall')
M023 A                                      REFFLD(SSCOD1)
M023 A            PACRIR    R               COLHDG('Acc on R/I' 'Recall')
M023 A                                      REFFLD(SSCOD1)
SS09 A            PACMIR    R               COLHDG('Acc on M/I' 'Recall')
SS09 A                                      REFFLD(SSCOD1)
M023 A            PACRLR    R               COLHDG('Acc on R/L' 'Recall')
M023 A                                      REFFLD(SSCOD1)
     ** Cater for Add on LC Accrual
     A            PLCMC     R               COLHDG('Cal L/C on' 'Misc Cost')
     A                                      REFFLD(SSCOD1)
M019 A            PLCOC     R               COLHDG('Cal L/C on' 'Other Charges')
M019 A                                      REFFLD(SSCOD1)
     A            PLCLC     R               COLHDG('Incl L/C'  'on L/C cal')
     A                                      REFFLD(SSCOD1)
     A            PLCIN     R               COLHDG('Incl INTPAY'  'on L/C cal')
     A                                      REFFLD(SSCOD1)
M009 A            PLCCF     R               COLHDG('Incl COMACC'  'on L/C cal')
M009 A                                      REFFLD(SSCOD1)
SS09 A            PLCRI     R               COLHDG('Incl RESINT'  'on L/C cal')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            PLCMI     R               COLHDG('Incl MORINT'  'on L/C cal')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            PLCRL     R               COLHDG('Incl RESLC'  'on L/C cal')
SS09 A                                      REFFLD(SSCOD1)
     ** Cater for Add on LC Accrual for Matured
M019 A            PLCMC3    R               COLHDG('L/C on M/C' 'Mature')
M019 A                                      REFFLD(SSCOD1)
M019 A            PLCOC3    R               COLHDG('L/C on O/C' 'Mature')
M019 A                                      REFFLD(SSCOD1)
M019 A            PLCLC3    R               COLHDG('L/C on L/C' 'Mature')
M019 A                                      REFFLD(SSCOD1)
M019 A            PLCIN3    R               COLHDG('L/C on Int' 'Mature')
M019 A                                      REFFLD(SSCOD1)
M019 A            PLCCF3    R               COLHDG('L/C on C/F' 'Mature')
M019 A                                      REFFLD(SSCOD1)
SS09 A            PLCRI3    R               COLHDG('L/C on R/I' 'Mature')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            PLCMI3    R               COLHDG('L/C on M/I' 'Mature')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            PLCRL3    R               COLHDG('L/C on R/L' 'Mature')
SS09 A                                      REFFLD(SSCOD1)
     ** Cater for Add on LC Accrual for Recalled
M023 A            PLCMCR    R               COLHDG('L/C on M/C' 'Recall')
M023 A                                      REFFLD(SSCOD1)
M023 A            PLCOCR    R               COLHDG('L/C on O/C' 'Recall')
M023 A                                      REFFLD(SSCOD1)
M023 A            PLCLCR    R               COLHDG('L/C on L/C' 'Recall')
M023 A                                      REFFLD(SSCOD1)
M023 A            PLCINR    R               COLHDG('L/C on Int' 'Recall')
M023 A                                      REFFLD(SSCOD1)
M023 A            PLCCFR    R               COLHDG('L/C on C/F' 'Recall')
M023 A                                      REFFLD(SSCOD1)
SS09 A            PLCRIR    R               COLHDG('L/C on R/I' 'Recall')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            PLCMIR    R               COLHDG('L/C on M/I' 'Recall')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            PLCRLR    R               COLHDG('L/C on R/L' 'Recall')
SS09 A                                      REFFLD(SSCOD1)
     ** Forecast billing
M023 A            PBILIN    R               COLHDG('Forecast' 'Bill Interest')
M023 A                                      REFFLD(SSCOD1)
M023 A            PBILLC    R               COLHDG('Forecast' 'Bill LC')
M023 A                                      REFFLD(SSCOD1)
M023 A            PBILCF    R               COLHDG('Forecast' 'Bill Comm Fees')
M023 A                                      REFFLD(SSCOD1)
M032 A            PBILFE    R               COLHDG('Forecast' 'Bill Fees')
M032 A                                      REFFLD(SSCOD1)
     A** FEES
     A            PEPEN     R               COLHDG('Subject for' 'Penalty')
     A                                      REFFLD(SSCOD1)
     ** INT IN LIEU OF NOTICE
     A            PFILON    R               COLHDG('Subj Int In' 'Lieu Of Notc')
     A                                      REFFLD(SSCOD1)
R1001A            PCTINT    R               COLHDG('Charge to Interest')
R1001A                                      REFFLD(SSCOD1)
R1001A*R1016      PILCC     R               COLHDG('Int In' 'Lieu Charge Type')
R1001A*R1016                                REFFLD(SSCOD2)
R1001A*R1016      PILCT     R               COLHDG('Charge to Misc/' 'Othchg')
R1001A*R1016                                REFFLD(SSCOD1)
R1016A            PILCT     R               COLHDG('Charge to Misc/' 'Othchg')
R1016A                                      REFFLD(SSCOD2)
R1016A            PILCC     R               COLHDG('Int In' 'Lieu Charge Type')
R1016A                                      REFFLD(SSCOD1)
M021 A            PFILCT    R               COLHDG('P. Fee' 'Charge Type')
M021 A                                      REFFLD(SSCOD2)
M021 A            PFILCD    R               COLHDG('Charge to Misc/' 'Othchg')
M021 A                                      REFFLD(SSCOD1)
     A            PODGRC    R               COLHDG('Grace day' 'int lieu ntc')
     A                                      REFFLD(SSCOU3)
     A            PPTERM    R               COLHDG('Prepayment' 'Def Exp Term')
     A                                      REFFLD(SSCOU3)
     A            PPTMCD    R               COLHDG('Prepymt' 'Def Exp Term cod')
     A                                      REFFLD(SSCOD1)
     A            PPTMIN    R               COLHDG('Prepaym' 'Cal or Bus days')
     A                                      REFFLD(SSCOD1)
     A            PDFESN    R               COLHDG('E/S Def' 'Exp term')
     A                                      REFFLD(SSCOU3)
     A            PDFESC    R               COLHDG('E/S Def' 'Exp term code')
     A                                      REFFLD(SSCOD1)
     A            PDFESI    R               COLHDG('E/S Def' 'Cal or Bus days')
     A                                      REFFLD(SSCOD1)
     ** PREPAYMENT FEES
     A            PFPREP    R               COLHDG('Subj For' 'Prepaym Fee')
     A                                      REFFLD(SSCOD1)
AM01 A            PFPRP2    R               COLHDG('Prep Fee whichever' -
     A                                      'Higher/Lower')
     A                                      REFFLD(SSCOD1)
     A            PFPRCT    R               COLHDG('P. Fee' 'Charge Type')
     A                                      REFFLD(SSCOD2)
     A            PFPRCD    R               COLHDG('Charge to Misc/' 'Othchg')
     A                                      REFFLD(SSCOD1)
R1001A            PNTCPR    R               COLHDG('times frm Inst' 'Amt consid-
R1001A                                      er .Prepyt')
R1001A*                                     REFFLD(SSCOD1)
R1013A                                      REFFLD(SSCOU3)
R1032A            PNTCPF    R               COLHDG('Fee charge' 'Over prepaid')
R1032A                                      REFFLD(SSCOD1)
R1026A            PNTMPR    R               COLHDG('No of Inst' 'Made-
R1026A                                      bef .Prepyt')
R1026A                                      REFFLD(SSCOU3)
     A            PFPR1     R               COLHDG('Prepaym Fee' 'Flat Amt')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            PFPR2     R               COLHDG('P. Fee' '% Of Amt Prepaid')
     A                                      REFFLD(SSPERD)
     A            PFPR3     R               COLHDG('P. Fee' '% Of Loan Amount')
     A                                      REFFLD(SSPERD)
     A            PFPR4     R               COLHDG('P. Fee' '% Unexpr Period')
     A                                      REFFLD(SSPERD)
M021 A            PFPRP1    R               COLHDG('P. Fee' '% Of Int Rebate')
M021 A                                      REFFLD(SSPERD)
SS09 A            PFPRBL    R               COLHDG('P. Fee' '% Of Current Bal')
SS09 A                                      REFFLD(SSPERD)
R1001A            PFPRPI    R               COLHDG('Minimum Amt for' 'Capital-
R1001A                                      Prepyt')
R1001A                                      REFFLD(SSAMT4)
R1001A            PFPRPM    R               COLHDG('Maximum Amt for' 'Capital-
R1001A                                      Prepyt')
R1001A                                      REFFLD(SSAMT4)
R1015A            PFALP     R               COLHDG('Allow if Within' 'Lock In-
R1015A                                      Period ' 'P.Fee')
R1015A                                      REFFLD(SSCOD1)
R1007A            PAWAIV    R               COLHDG('Allow Waiver' 'P.Fee')
R1007A                                      REFFLD(SSCOD1)
AM01 A            PFPR11    R               COLHDG('Sett Fee whichever' -
     A                                      'Higher/Lower')
     A                                      REFFLD(SSCOD1)
V001 A            PFPR5     R               COLHDG('Settlement' 'Flat Amt')
V001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
V001 A            PFPR6     R               COLHDG('Settlem' '% Of Amt Prepaid')
V001 A                                      REFFLD(SSPERD)
V001 A            PFPR7     R               COLHDG('Settlem' '% Of Loan Amount')
V001 A                                      REFFLD(SSPERD)
V001 A            PFPR8     R               COLHDG('Settlem' '% Unexpr Period')
V001 A                                      REFFLD(SSPERD)
M021 A            PFESM1    R               COLHDG('Settlem' '% Of Int Rebate')
M021 A                                      REFFLD(SSPERD)
SS09 A            PFERBL    R               COLHDG('Settlem' '% Of Current Bal')
SS09 A                                      REFFLD(SSPERD)
R1001A            PFESMI    R               COLHDG('Minimum Amt for' 'Early-
R1001A                                      Settlement')
R1001A                                      REFFLD(SSAMT4)
R1001A            PFESMM    R               COLHDG('Maximum Amt for' 'Early-
R1001A                                      Settlement')
R1001A                                      REFFLD(SSAMT4)
R1015A            PFESLP    R               COLHDG('Allow if Within' 'Lock In-
R1015A                                      Period ' 'E.Settlement')
R1015A                                      REFFLD(SSCOD1)
R1007A            PFWAIV    R               COLHDG('Allow Waiver' 'E.Settl')
R1007A                                      REFFLD(SSCOD1)
V001 A            PFPR9     R               COLHDG('Buy Fee' '% on int rebate')
V001 A                                      REFFLD(SSPERD)
H001 A            PFPR10    R               COLHDG('Penalty' 'on int rebate')
H001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
M009 A            PPCIND    R               COLHDG('Cmmn of Prepymt' ' Per Ind')
M009 A                                      REFFLD(SSCOD1)
M009 A            PDCIND    R               COLHDG('Cmmn of Early' 'settle Ind')
M009 A                                      REFFLD(SSCOD1)
     A            PFWMTH    R               COLHDG('C/pre pym' 'Pof w/in X mth')
     A                                      REFFLD(SSCOU3)
V001 A            PFWFUL    R               COLHDG('Calc. if' 'ful poff within')
V001 A                                      REFFLD(SSCOU3)
M001 A            PLODTR    R               COLHDG('Term from L/O Date')
M001 A                                      REFFLD(SSCOU3)
M001 A            PLODTC    R               COLHDG('Term Code from' ' L/O Date')
M001 A                                      REFFLD(SSCOD1)
V001 A            PFPRTI    R               COLHDG('Tiered' 'Prepayment')
V001 A                                      REFFLD(SSCOD1)
     ** BUY BACK FEES
     A            PFBYCD    R               COLHDG('Charge to Misc/' 'Othchg')
     A                                      REFFLD(SSCOD1)
     A            PFBYCT    R               COLHDG('Buy back Fee' 'Charge Type')
     A                                      REFFLD(SSCOD2)
     ** REPLACEMENT COSTS -> FUNDING LOSS
M009 A            PFREPL    R               COLHDG('Subj to' 'Funding Loss')
M009 A                                      REFFLD(SSCOD1)
M009 A            PFRPOM    R               COLHDG('F.Loss' 'Charge To MC/OC')
M009 A                                      REFFLD(SSCOD1)
M009 A            PFRCTP    R               COLHDG('F.Loss' 'Charge Type')
M009 A                                      REFFLD(SSCOD2)
M032 A            PFRP1     R               COLHDG('F.Loss' 'Flat Amt')
M032 A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
M032 A            PFRP2     R               COLHDG('F.Loss' '% Of Amt Prepaid')
M032 A                                      REFFLD(SSPERD)
M032 A            PFRP3     R               COLHDG('F.Loss' '% Of Loan Amount')
M032 A                                      REFFLD(SSPERD)
M032 A            PFRP4     R               COLHDG('F.Loss' '% Unexpr Period')
M032 A                                      REFFLD(SSPERD)
AM01 A            PFRPP1    R               COLHDG('F.Loss' '% Int/Pft Rebate')
     A                                      REFFLD(SSPERD)
SS09 A            PFRRBL    R               COLHDG('F.Loss' '% Of Current Bal')
SS09 A                                      REFFLD(SSPERD)
AM01 A            PFRPP2    R               COLHDG('F.Loss Whichever' -
     A                                      'Higher/Lower')
     A                                      REFFLD(SSCOD1)
R1015A            PFRRPI    R               COLHDG('Minimum Amt for' 'F.Loss')
R1015A                                      REFFLD(SSAMT4)
R1015A            PFRRPM    R               COLHDG('Maximum Amt for' 'F.Loss')
R1015A                                      REFFLD(SSAMT4)
R1015A            PFRSLP    R               COLHDG('Allow if Within' 'Lock In-
R1015A                                      Period ' 'F. Loss')
R1015A                                      REFFLD(SSCOD1)
R1015A            PRWAIV    R               COLHDG('Allow Waiver' 'F.Loss')
R1015A                                      REFFLD(SSCOD1)
M032 A            PFRP5     R               COLHDG('Settle F.Loss' 'Flat Amt')
M032 A                                      REFFLD(SSAMT4)
M032 A            PFRP6     R               COLHDG('F.Loss %' 'Of Amt Settled')
M032 A                                      REFFLD(SSPERD)
M032 A            PFRP7     R               COLHDG('S.F.Loss %' 'Of Ln Amount')
M032 A                                      REFFLD(SSPERD)
M032 A            PFRP8     R               COLHDG('S.F.Loss %' 'Unexpr Period')
M032 A                                      REFFLD(SSPERD)
AM01 A            PFRP9     R               COLHDG('S.F.Loss %' 'Int/Pft Reb')
     A                                      REFFLD(SSPERD)
SS09 A            PFSRBL    R               COLHDG('S.F.Loss %' 'Of Current' -
SS09 A                                      'Bal')
SS09 A                                      REFFLD(SSPERD)
AM01 A            PFRP10    R               COLHDG('S.F.Loss Whichever' -
     A                                      'Higher/Lower')
     A                                      REFFLD(SSCOD1)
R1015A            PFRPPI    R               COLHDG('Minimum Amt for' 'S.F.Loss')
R1015A                                      REFFLD(SSAMT4)
R1015A            PFRPPM    R               COLHDG('Maximum Amt for' 'S.F.Loss')
R1015A                                      REFFLD(SSAMT4)
R1015A            PFRPLP    R               COLHDG('Allow if Within' 'Lock In-
R1015A                                      Period ' 'S.F. Loss')
R1015A                                      REFFLD(SSCOD1)
R1015A            PPWAIV    R               COLHDG('Allow Waiver' 'S.F.Loss')
R1015A                                      REFFLD(SSCOD1)
     ** Cancellation Fee
     A            PFCANC    R               COLHDG('Subj For' 'Cancel. Fee')
     A                                      REFFLD(SSCOD1)
     A            PFCACT    R               COLHDG('Cancel Fee' 'Charge Type')
     A                                      REFFLD(SSCOD2)
     A            PFCACD    R               COLHDG('Charge to Misc/' 'Othchg')
     A                                      REFFLD(SSCOD1)
     A            PFCA1     R               COLHDG('Cancel Fee' 'Expr Drw Schd')
     A                                      REFFLD(SSPERD)
     A            PFCA2     R               COLHDG('Cancel Fee' 'Early Sett.')
     A                                      REFFLD(SSPERD)
V001 A            PFCA3     R               COLHDG('ESett Cfee' '% Unexpr Dura')
V001 A                                      REFFLD(SSPERD)
V001 A            PFCA4     R               COLHDG('Avail Cfee' '% Of Undrawn')
V001 A                                      REFFLD(SSPERD)
V001 A            PFCA5     R               COLHDG('Avail Cfee' '% Unexpr Dura')
V001 A                                      REFFLD(SSPERD)
     ** Commitment Fees
     A            PCMRTN    R               COLHDG('Commitment fee' 'rate no')
H001 A*                                     REFFLD(SSCOU3)
H001 A                                      REFFLD(SSRATE)
     A            PCMRT     R               COLHDG('Commitment fees' 'rate')
     A                                      REFFLD(SSPERD)
     A            PFUDRW    R               COLHDG('Undrawn' 'Limit')
     A                                      REFFLD(SSAMT4)
     A            PFUDPC    R               COLHDG('% Of Total' 'Undrawn')
     A                                      REFFLD(SSPERD)
     A            PFUDER    R               COLHDG('Undrawn lmt' 'excess rate')
     A                                      REFFLD(SSPERD)
     A            PFUDAR    R               COLHDG('Undrawn %' 'If Above Lmt')
     A                                      REFFLD(SSPERD)
     A            PMINUL    R               COLHDG('Min. Usage Limit')
     A                                      REFFLD(SSAMT4)
     A            PMULPC    R               COLHDG('Min Usage Lmt' '% Of Ln Am')
     A                                      REFFLD(SSPERD)
R1001A            PCOMFE    R               COLHDG('CF Calculation' 'base on')
R1001A                                      REFFLD(SSCOD1)
R1001A            PSTAGL    R               COLHDG('Subject to' 'Aggregate Lmt')
R1001A                                      REFFLD(SSCOD1)
AM01 A*SS17       PCFFR     R               COLHDG('LC Freq')
SS17 A            PCFFR     R               COLHDG('CF Freq')
     A                                      REFFLD(SSCOU3)
AM01 A*SS17       PCFFC     R               COLHDG('LC freq code')
SS17 A            PCFFC     R               COLHDG('CF freq code')
     A                                      REFFLD(SSCOD1)
     ** NPL Information
     A            PNPLF     R               COLHDG('NPL' 'Flag')
     A                                      REFFLD(SSCOD1)
     A*SS09       PRMSUP    R               COLHDG('No. of mths' 'to Suspend')
SS09 A            PRMSUP    R               COLHDG('No. of mths' 'to Classify')
     A                                      REFFLD(SSCOU3)
H001 A*SS09       PNPLDY    R               COLHDG('No. of days' 'to Suspend')
SS09 A            PNPLDY    R               COLHDG('No. of days' 'to Classify')
H001 A                                      REFFLD(SSCOU3)
H001 A            PPLMO     R               COLHDG('No. Of Mth' 'To Reclassify')
H001 A                                      REFFLD(SSCOU3)
H001 A            PPLDY     R               COLHDG('No.Of Days' 'To Reclassify')
H001 A                                      REFFLD(SSCOU3)
H001 A*SS09       PNPL3M    R               COLHDG('No. Of Month' 'Suspend Pmt -
H001 A*SS09                                 Freq >=3')
SS09 A            PNPL3M    R               COLHDG('No. Of Month' 'Classify' -
H001 A                                      'Pmt Freq >=3')
H001 A                                      REFFLD(SSCOU3)
H001 A*SS09       PNPL3D    R               COLHDG('No. Of Days' 'Suspend Pmt -
H001 A*SS09                                 Freq >=3')
SS09 A            PNPL3D    R               COLHDG('No. Of Days' 'Classify' -
SS09 A                                      'Pmt Freq >=3')
H001 A                                      REFFLD(SSCOU3)
H001 A            PPL3MO    R               COLHDG('No. Of Month' 'Reclsfy Pmt -
H001 A                                      Freq >=3')
H001 A                                      REFFLD(SSCOU3)
H001 A            PPL3DY    R               COLHDG('No. Of Days' 'Reclsfy Pmt -
H001 A                                      Freq >=3')
H001 A                                      REFFLD(SSCOU3)
     A            PCLWBK    R               COLHDG('N of months' ' To clawback')
     A                                      REFFLD(SSCOU3)
     A            PNPLMT    R               COLHDG('Turn NPL' 'at maturity')
     A                                      REFFLD(SSCOD1)
     A            PNDNPL    R               COLHDG('Nday/mth Mat' 'turn NPL')
     A                                      REFFLD(SSCOU3)
     A            PNPLCD    R               COLHDG('Nday/mth aft Mat' 'turnNPL')
     A                                      REFFLD(SSCOD1)
H001 A            PNPLEM    R               COLHDG('Classify NPL' 'at mth end')
H001 A                                      REFFLD(SSCOD1)
     A            PPLOPT    R               COLHDG('Declassify' 'option')
     A                                      REFFLD(SSCOD1)
     A** I=Upon full payment of all O/S interest
     A** W=WALL STREET WHEN INT IS LESS THAN NO OF MO TO SUSPEND
     A** Blank = Upon full payment of Interest & principal
     A            PNPLOP    R               COLHDG('Dt opt to' ' classify NPL')
     A                                      REFFLD(SSCOD1)
     A** I=Interest pay to date(PDTOD6)
     A** Blank = NPDT or NIPDT whichever is earlier
     A            PSUPCL    R               COLHDG('NPL-Mth in dft' 'Bal<Col')
     A                                      REFFLD(SSCOU3)
     A** C=Compare collateral value against CBAL
     A** Blank = Not used
     A            PNPLTX    R               COLHDG('NPL tax' 'code')
     A                                      REFFLD(SSCOD1)
A005 A* New Fields for ABB Islamic Loan
A006 A            PVARMO    R               COLHDG('Variation' 'no of mth to' -
A006 A                                      'reclassify')
A006 A                                      REFFLD(SSCOU3)
A006 A            PVARR     R               COLHDG('Variation' 'reset if' -
A006 A                                      'unpaid aft no of mth')
A006 A                                      REFFLD(SSCOD1)
H001 A            PTGAAS    R               COLHDG('Auto Tag' 'AA if NPL')
H001 A                                      REFFLD(SSCOD1)
     A* Suspend ineterest
SS09 A            PSUPF     R               COLHDG('Suspend Interest' 'Flag')
SS09 A                                      REFFLD(SSCOD1)
R1007A            PNDTXB    R               COLHDG('No. of Days' ' Recognize' +
R1007A                                      ' Taxable Interest')
R1007A                                      REFFLD(SSCOU5)
R1007A            PNMTXB    R               COLHDG('No. of Month' ' Recognize' +
R1007A                                      ' Taxable Interest')
R1007A                                      REFFLD(SSCOU5)
R1007A            PCODDO    R               COLHDG('Classify NPL' ' Af Dormant')
R1007A                                      REFFLD(SSCOD1)
R1007A            PNODD     R               COLHDG('No. of Days' ' Af Dormant')
R1007A                                      REFFLD(SSCOU3)
R1007A            PNODM     R               COLHDG('No. of Month' ' Af Dormant')
R1007A                                      REFFLD(SSCOU3)
SS09 A            PSUPPM    R               COLHDG('No. of mths' 'to Suspend' -
SS09 A                                      'Principal due')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PSUPPD    R               COLHDG('No. of days' 'to Suspend' -
SS09 A                                      'Principal due')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PSUPIM    R               COLHDG('No. of mths' 'to Suspend' -
SS09 A                                      'Interest due')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PSUPID    R               COLHDG('No. of days' 'to Suspend' -
SS09 A                                      'Interest due')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PSP3PM    R               COLHDG('No. Of mths' 'Suspend Pmt' -
SS09 A                                      'Freq >=3  Prin Due')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PSP3PD    R               COLHDG('No. Of days' 'Suspend Pmt' -
SS09 A                                      'Freq >=3  Prin Due')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PSP3IM    R               COLHDG('No. Of mths' 'Suspend Pmt' -
SS09 A                                      'Freq >=3  Int Due')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PSP3ID    R               COLHDG('No. Of days' 'Suspend Pmt' -
SS09 A                                      'Freq >=3  Int Due')
SS09 A                                      REFFLD(SSCOU3)
     A*
M021 A            PCART     R               COLHDG('CAR' 'Type')
M021 A                                      REFFLD(SSCOD1)
M021 A            PCARF     R               COLHDG('CAR' 'Flag')
M021 A                                      REFFLD(SSCOD1)
     **AM01
     A            PCAR1M    R               COLHDG('CAR Declassification' -
     A                                      'Freq < 3M')
     A                                      REFFLD(SSCOU3)
     A            PCAR3M    R               COLHDG('CAR Declassification' -
     A                                      'Freq >= 3M')
     A                                      REFFLD(SSCOU3)
     A            PCARMD    R               COLHDG('CAR Declassification' -
     A                                      'Month/Day')
     A                                      REFFLD(SSCOD1)
R1001A            PLCL3M    R               COLHDG('Min Classification' '<3M')
R1001A                                      REFFLD(SSCOU3)
R1001A            PLCG3M    R               COLHDG('Max Classification' '<3M')
R1001A                                      REFFLD(SSCOU3)
R1001A            PLMCOD    R               COLHDG('Min Classification' 'Code')
R1001A                                      REFFLD(SSCOD1)
SS02 A            PSPFLG    R               COLHDG('SP Flag')
SS02 A                                      REFFLD(SSCOD1)
     A* Auto Charge Off
SS09 A            PMPDCO    R               COLHDG('Month past' 'due auto' -
SS09 A                                      'charge off')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PDPDCO    R               COLHDG('Day past' 'due auto' -
SS09 A                                      'charge off')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PCOMTH    R               COLHDG('Auto Charge' 'off Method')
SS09 A                                      REFFLD(SSCOD1)
     A* TDR - Trouble Debt Restruturing
SS09 A            PGEXPM    R               COLHDG('Grace Exp' 'TDR split' -
SS09 A                                      '- Mth')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PGEXPD    R               COLHDG('Grace Exp' 'TDR split' -
SS09 A                                      '- Day')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            PDRGCD    R               COLHDG('TDR Pass' 'due Grace day')
SS09 A                                      REFFLD(SSCOU3)
     ** Schedule
     A            PDRWDN    R               COLHDG('Drawdown' 'Schedule')
     A                                      REFFLD(SSCOD1)
SS03 A            PRDRAW    R               COLHDG('Redraw')
SS03 A                                      REFFLD(SSCOD1)
     A            PTIERD    R               COLHDG('Tiered loan(Y/N)')
     A                                      REFFLD(SSCOD1)
     A            PALTRT    R               COLHDG('Alternate' 'Rate')
     A                                      REFFLD(SSCOD1)
     A            PALTSC    R               COLHDG('Alternate' 'Pymt Schedule')
     A                                      REFFLD(SSCOD1)
H001 A            PPRSCH    R               COLHDG('Principal' 'Repaym Schd')
H001 A                                      REFFLD(SSCOD1)
H001 A            PINVRO    R               COLHDG('Prin' 'Inverse Order')
H001 A                                      REFFLD(SSCOD1)
     A            PROLM     R               COLHDG('Rollover' 'method')
     A                                      REFFLD(SSCOD1)
R1001A            POMETD    R               COLHDG('Rollover' 'Balance')
R1001A                                      REFFLD(SSCOD1)
AM01 A            PROLNT    R               COLHDG('Rollover' 'notice')
     A                                      REFFLD(SSCOD1)
H001 A            PLLSCH    R               COLHDG('Loan Limit' 'Schd')
H001 A                                      REFFLD(SSCOD1)
H001 A            PTWSCH    R               COLHDG('Tranche' 'Working Schd')
H001 A                                      REFFLD(SSCOD1)
SS05 A            PANRGC    R               COLHDG('Cooperative' 'Registration')
SS05 A                                      REFFLD(SSCOD1)
     A            PHASAR    R               COLHDG('ARM information')
     A                                      REFFLD(SSCOD1)
R1007A            PAGENC    R               COLHDG('Funded Loan')
R1007A                                      REFFLD(SSCOD1)
R1001A            PAUTDB    R               COLHDG('Auto Debit')
R1001A                                      REFFLD(SSCOD1)
R1001A            PRTRYS    R               COLHDG('Number of Days' ' Retries')
R1001A                                      REFFLD(SSCOU3)
     A            PMIAMR    R               COLHDG('Mo Int on' 'ARM Payoff')
     A                                      REFFLD(SSCOD1)
     A            PUPRAT    R               COLHDG('Margin rate' 'Upwards')
     A                                      REFFLD(SSPERD)
     A            PESCRO    R               COLHDG('Escrow information')
     A                                      REFFLD(SSCOD1)
     A            PESCPO    R               COLHDG('Include Escrow' 'in payoff')
     A                                      REFFLD(SSCOD1)
     ** Miscellaneous Codes
     A            PSTATU    R               COLHDG('Status')
     A                                      REFFLD(SSCOU1)
     A            PPARTI    R               COLHDG('Participation' 'code')
     A                                      REFFLD(SSCOD1)
     A            PCLSZR    R               COLHDG('Close' 'on zero balance')
     A                                      REFFLD(SSCOD1)
R1007A            PCAZBG    R               COLHDG('Close Account on' +
R1007A                                      ' Zero Balance Grace')
R1007A                                      REFFLD(SSCOU3)
R1007A            PCAZBT    R               COLHDG('Close Account on' +
R1007A                                      ' Zero Balance Grace' ' Term Code')
R1007A                                      REFFLD(SSCOD1)
     A            PNEGBL    R               COLHDG('Allow negative' 'bal loans')
     A                                      REFFLD(SSCOD1)
R1043A            POVPIN    R               COLHDG('Recognize' 'Overpayment' -
R1043A                                      'as Income')
R1043A                                      REFFLD(SSCOD1)
     A            POTOL     R               COLHDG('Payoff' 'Tolerance')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
R1001A            POTCB     R               COLHDG('Payoff Tolerance' 'Credit-
R1001A                                       Balance')
R1001A                                      REFFLD(SSAMT4)
R1001A            POTOT     R               COLHDG('Payoff Tolerance' 'Term')
R1001A                                      REFFLD(SSCOU5)
R1001A            POTOC     R               COLHDG('Payoff Tolerance' 'Term-
R1001A                                       Code')
R1001A                                      REFFLD(SSCOD1)
R1001A            PREDEM    R               COLHDG('Number of Days for' 'Rede-
R1001A                                      mption')
R1001A                                      REFFLD(SSCOU3)
R1007A            PADJBL    R               COLHDG('Adjust Billing' +
R1007A                                      ' Before Due Date')
R1007A                                      REFFLD(SSCOD1)
M009 A            PREBIL    R               COLHDG('Rebilling')
M009 A                                      REFFLD(SSCOD1)
AM01 A            PSKBIL    R               COLHDG('Skip Bill Int' 'Past-
     A                                      billing Cycle')
     A                                      REFFLD(SSCOD1)
     A            PBLNDY    R               COLHDG('Ndays for' 'Billing Record')
     A                                      REFFLD(SSCOU3)
M009 A            PPBADV    R               COLHDG('NDAYs for' 'Billing Notice')
M009 A                                      REFFLD(SSCOU3)
     A            PMTBOA    R               COLHDG('Pmt Split' 'Bill or Accrue')
     A                                      REFFLD(SSCOD1)
AM01 A            PSPFAB    R               COLHDG('Split Profit' -
     A                                      'Across Billing')
     A                                      REFFLD(SSCOD1)
     A            PBILAW    R               COLHDG('Always use' 'Billed amts')
     A                                      REFFLD(SSCOD1)
     A            PBILDY    R               COLHDG('Ignore billing' 'After')
     A                                      REFFLD(SSCOU3)
     A            PSPLTO    R               COLHDG('Splt to O''due' 'bf C''due')
     A                                      REFFLD(SSCOD1)
     A            PINALC    R               COLHDG('NPL-allocate' 'Int first')
     A                                      REFFLD(SSCOD1)
     A            PNOADV    R               COLHDG('No. of advance' 'instl due')
     A                                      REFFLD(SSCOU3)
SS09 A            PNFPMA    R               COLHDG('Number of' 'Future' -
SS09 A                                      'Payment Allow')
     A                                      REFFLD(SSCOU3)
     A            PNEARD    R               COLHDG('Cal Instl' 'Nearest D')
     A                                      REFFLD(SSCOD1)
SS09 A            PNEARA    R               COLHDG('Cal Instl' 'Nearest Amt')
SS09 A                                      REFFLD(SSAMT4)
     A            PADJBK    R               COLHDG('Adj BKDISC' 'Aft Cal. Pymt')
     A                                      REFFLD(SSCOD1)
AM01 A            PADJAC    R               COLHDG('Adjust Earning on' -
     A                                      'calculated pymt')
     A                                      REFFLD(SSCOD1)
     A            PBKFUL    R               COLHDG('Cal BKDISC' 'On F/rel date')
     A                                      REFFLD(SSCOD1)
     A            PLSADV    R               COLHDG('Less advance' 'for Int cal')
     A                                      REFFLD(SSCOD1)
     A            PLSARR    R               COLHDG('Less arrears' 'for Int Cal')
     A                                      REFFLD(SSCOD1)
SS10 A            PLSRTS    R               COLHDG('Less retension' 'sum' -
SS09 A                                      'for Int Cal')
SS09 A                                      REFFLD(SSCOD1)
A001 A            PCALBK    R               COLHDG('Cal Rest Bal' 'E/P/X')
     A                                      REFFLD(SSCOD1)
     A            PINPAY    R               COLHDG('Int payble-' 'mth b4 FPDT')
     A                                      REFFLD(SSCOD1)
     A            PINMAT    R               COLHDG('Use int maty dt')
     A                                      REFFLD(SSCOD1)
     A            PUSESP    R               COLHDG('Use Payment Suspense')
     A                                      REFFLD(SSCOD1)
     A            PADVPM    R               COLHDG('Use Advance' 'Payment')
     A                                      REFFLD(SSCOD1)
OS01 A            PUADVP    R               COLHDG('Auto Uplift' 'Advance' -
OS01 A                                      'Payment')
OS01 A                                      REFFLD(SSCOD1)
M024 A            PADVIN    R               COLHDG('Allow Interest' 'Overpaid')
M024 A                                      REFFLD(SSCOD1)
     ** Notice & Report
     A            PHMAIL    R               COLHDG('Hold mail')
     A                                      REFFLD(SSCOD1)
     A            PINCLU    R               COLHDG('Include on' 'Comb Stmt')
     A                                      REFFLD(SSCOD1)
M009 A            PSNDCL    R               COLHDG('Send' 'Confirmn. Letter')
M009 A                                      REFFLD(SSCOD1)
     A            PPDNOT    R               COLHDG('Send Past' 'Due Notice')
     A                                      REFFLD(SSCOD1)
     A            PCDNOT    R               COLHDG('Send Billing' 'Notice')
     A                                      REFFLD(SSCOD1)
     A            PRMIND    R               COLHDG('Reminder Code')
     A                                      REFFLD(SSCOD1)
R1007A            PRUFPN    R               COLHDG('Recognize Unearned' +
R1007A                                      ' Fee Upon NPL')
R1007A                                      REFFLD(SSCOD1)
R1001A            PPAYCD    R               COLHDG('Allow Payment Card' 'Gener-
R1001A                                      ation')
R1001A                                      REFFLD(SSCOD1)
R1001A            PWADVP    R               COLHDG('Allow Refund' 'of Advan-
R1001A                                      ce Payment')
R1001A                                      REFFLD(SSCOD1)
R1001A            PLGENS    R               COLHDG('Generate Statement')
R1001A                                      REFFLD(SSCOD1)
R1001A            PSTFRQ    R               COLHDG('Statement Frequency')
R1001A                                      REFFLD(SSTU05)
R1001A            PSTFRC    R               COLHDG('Statement Frequency' 'Code')
R1001A                                      REFFLD(SSCOD1)
R1007A            PSTSUP    R               COLHDG('Stop Interest' ' Suspend')
R1007A                                      REFFLD(SSCOD1)
R1001A            PBCFTD    R               COLHDG('Billing Cycle' 'from/to day-
R1001A                                       based on')
R1001A                                      REFFLD(SSCOD1)
R1001A*R1036      PDNCPM    R               COLHDG('Do not Change' 'Payment Amo-
R1036A            PDNCPM    R               COLHDG('Change' 'Payment Amo-
R1001A                                      unt if')
R1001A                                      REFFLD(SSCOD1)
R1007A            PINSRJ    R               COLHDG('Reject' 'OD Utilization' +
R1007A                                      'Upon Int Suspense')
R1007A                                      REFFLD(SSCOD1)
R1007A            PNSGGC    R               COLHDG('Maturity GL Group')
R1007A                                      REFFLD(SSCOU5)
R1007A            PNPMGR    R               COLHDG('Month Grace for' +
R1007A                                      ' New Payment Amount')
R1007A                                      REFFLD(SSCOU5)
R1001A            PMIHAM    R               COLHDG('Billing Minimum' 'Threshold-
R1001A                                       Amount')
R1001A                                      REFFLD(SSAMT4)
R1001A            PMSHAM    R               COLHDG('Billing Maximum' 'Threshold-
R1001A                                       Amount')
R1001A                                      REFFLD(SSAMT4)
R1001A            PMXPHL    R               COLHDG('Max times of Payment' 'Holi-
R1001A                                      day per Year')
R1001A                                      REFFLD(SSTU05)
R1001A            PMXHLT    R               COLHDG('Max times of Payment' 'Holi-
R1001A                                      day per LN term')
R1001A                                      REFFLD(SSCOD1)
R1001A            PSAMEI    R               COLHDG('Stop Accrual' 'Overdue Freq-
R1001A                                      uency')
R1001A                                      REFFLD(SSTU05)
R1001A            PSAMEC    R               COLHDG('Stop Accrual' 'Overdue Freq-
R1001A                                      uency Cd')
R1001A                                      REFFLD(SSCOD1)
R1015A            PMCINS    R               COLHDG('Min. Change' 'Of Inst Amt')
R1015A                                      REFFLD(SSAMT4)
R1015A            PAIRRA    R               COLHDG('Allow Change' 'Pymt for' -
R1015A                                      'Restruc/Resched Acct')
R1015A                                      REFFLD(SSCOD1)
R1015A            PAIPLA    R               COLHDG('Allow Change' 'Pymt for' -
R1015A                                      'PL and Prompt Acct')
R1015A                                      REFFLD(SSCOD1)
R1015A            PAIMAT    R               COLHDG('Allow Change' 'Pymt for -
R1015A                                      matured' 'account')
R1015A                                      REFFLD(SSCOD1)
     A            PBLLBR    R               COLHDG('DBal for' 'Low Bal Report')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            PMNNEW    R               COLHDG('Minimum D' 'New Loan Reprt')
     A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A            PPRCNO    R               COLHDG('Print Rate' 'Chg Notice')
     A                                      REFFLD(SSCOD1)
     A            PNCRTC    R               COLHDG('Print Notice'  'Rate chg')
     A                                      REFFLD(SSCOD1)
     A            PPRRTC    R               COLHDG('Print Right' 'to-Cure''s')
     A                                      REFFLD(SSCOD1)
     A            PRTCDY    R               COLHDG('No of Days' 'for RTCs')
     A                                      REFFLD(SSCOU3)
     A            PRTCMX    R               COLHDG('Maximum no' 'of RTCs')
     A                                      REFFLD(SSCOU3)
     A            PCPN      R               COLHDG('Print' 'Coupon Book')
     A                                      REFFLD(SSCOD1)
     A            PDCBTR    R               COLHDG('Default Coupon' 'Book Term')
     A                                      REFFLD(SSCOU3)
R1019A            P2BLNT    R               COLHDG('2nd Billing Notice')
R1019A                                      REFFLD(SSCOU3)
     ** SIC Code
     A            PLSIC1    R               COLHDG('SIC N1')
     A                                      REFFLD(SSCOD1)
     A            PLSIC2    R               COLHDG('SIC N2')
     A                                      REFFLD(SSCOD1)
     A            PLSIC3    R               COLHDG('SIC N3')
     A                                      REFFLD(SSCOD1)
     A            PLSIC4    R               COLHDG('SIC N4')
     A                                      REFFLD(SSCOD1)
SS01 A            PLSIC5    R               COLHDG('SIC N5')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PLSIC6    R               COLHDG('SIC N6')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PLSIC7    R               COLHDG('SIC N7')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PLSIC8    R               COLHDG('SIC N8')
SS01 A                                      REFFLD(SSCOD1)
     **
     ** Field in PAR2 but not used
     A            PCALRE    R               COLHDG('Call report' 'code')
     A*M021                                 REFFLD(SSCOD3)
M021 A                                      REFFLD(SSCOD6)
     A            PCLASS    R               COLHDG('Class' 'Code')
A003 A                                      REFFLD(SSCLAS)
V001 A            PSTAFF    R               COLHDG('Staff' 'Indicator')
V001 A                                      REFFLD(SSCOD1)
     A            PALMTY    R               COLHDG('ALM' 'Type')
     A                                      REFFLD(SSCOD1)
     A            PRBEXF    R               COLHDG('Rebate' 'Extension Fees')
     A                                      REFFLD(SSCOD1)
     A            PTITLE    R               COLHDG('Title still' 'needed')
     A                                      REFFLD(SSCOD1)
     A            PDOCTR    R               COLHDG('Document' 'Tracking')
     A                                      REFFLD(SSCOD1)
     A            P1098C    R               COLHDG('1098' ' Code')
     A                                      REFFLD(SSCOD1)
M021 A            PCGCRP    R               COLHDG('CGC Reporting' 'Flag')
M021 A                                      REFFLD(SSCOD1)
     A            PCRREP    R               COLHDG('Credit Bureau' 'Reporting')
     A                                      REFFLD(SSCOD1)
     A            PCRTYP    R               COLHDG('Credit Bureau' 'Type')
     A                                      REFFLD(SSCOD1)
     A*SS09       PKINTR    R               COLHDG('No of Yr to' 'keep int rec')
SS09 A            PKINTR    R               COLHDG('Mth Def' 'to switch sts 8 ')
     A                                      REFFLD(SSCOU3)
     A            PSHARE    R               COLHDG('Loans' 'Against Shares')
     A                                      REFFLD(SSCOD1)
     A            PWHCD     R               COLHDG('Withholding code')
     A                                      REFFLD(SSCOU1)
     A            PDISRB    R               COLHDG('Disposal value' 'Rebate %')
     A                                      REFFLD(SSPERD)
H001 A            PATOPI    R               COLHDG('Auto Pay Int' 'By Unutil-
H001 A                                      ised Prin')
H001 A                                      REFFLD(SSCOD1)
     ** PROMOTION INFORMATION
H001 A*R1006      PROMOT    R               COLHDG('Promotion Arrs' 'Flag')
R1006A            PROMOT    R               COLHDG('Default Rate' 'Flag')
H001 A                                      REFFLD(SSCOD1)
SS09 A            PROCLB    R               COLHDG('Clawback arrears' 'to last-
SS09 A                                       due date')
SS09 A                                      REFFLD(SSCOD1)
H001 A            PROARR    R               COLHDG('Arrs Mths/Days' 'To Switch')
H001 A                                      REFFLD(SSCOU3)
M019 A            PROATC    R               COLHDG('Arrears Grace' 'Prd Code')
M019 A                                      REFFLD(SSCOD1)
AM01 A*R1006      PRORAT    R               COLHDG('Promotion Arrs' 'Rate')
R1006A            PRORAT    R               COLHDG('Default' 'Rate')
     A                                      REFFLD(SSPERD)
H001 A            PAVADY    R               COLHDG('Avail.' 'Period in Day')
H001 A                                      REFFLD(SSCOU3)
H001 A            PAVAMO    R               COLHDG('Avail.' 'Period in Mth')
H001 A                                      REFFLD(SSCOU3)
H001 A*R1006      PRORTN    R               COLHDG('Promotion Arrs' 'Rate No.')
R1006A            PRORTN    R               COLHDG('Default Rate' ' Number')
H001 A                                      REFFLD(SSRATE)
H001 A*R1006      PROVRI    R               COLHDG('Promotion' 'Arrs Variance')
R1006A            PROVRI    R               COLHDG('Default Rate' 'Variance')
H001 A                                      REFFLD(SSPERD)
H001 A*R1006      PROVRC    R               COLHDG('Promotion' 'Arrs Var Code')
R1006A            PROVRC    R               COLHDG('Default Rate' 'Var Code')
H001 A                                      REFFLD(SSCOD1)
R1007A            PRENRT    R               COLHDG('Reinstate Normal' ' Rate')
R1007A                                      REFFLD(SSCOD1)
R1046A            PSTDRT    R               COLHDG('Standard Rate')
R1046A                                      REFFLD(SSPERD)
R1046A            PSTDRN    R               COLHDG('Standard Rate Number')
R1046A                                      REFFLD(SSRATE)
R1046A            PSTDVR    R               COLHDG('Standard Rate' -
R1046A                                      'Variance')
R1046A                                      REFFLD(SSPERD)
R1046A            PSTDVC    R               COLHDG('Standard Rate' -
R1046A                                      'Variance Code')
R1046A                                      REFFLD(SSCOD1)
H001 A*** HP'S REQUIREMENT
H001 A            PROEXP    R               COLHDG('Repossession' 'Order -
H001 A                                      Expiry Days')
H001 A                                      REFFLD(SSCOU3)
A011 A            P5SHEX    R               COLHDG('HP 5th Schd' 'Expiry Days')
A011 A                                      REFFLD(SSCOU3)
A011 A            P5SIEX    R               COLHDG('IHP 5th Schd' 'Expiry Days')
A011 A                                      REFFLD(SSCOU3)
H001 A            PRCFLG    R               COLHDG('Registration' 'Card (Y/N)')
H001 A                                      REFFLD(SSCOD1)
H001 A            PINCTV    R               COLHDG('Allwed' 'Incentive (Y/N)')
H001 A                                      REFFLD(SSCOD1)
R1021A            P5REMC    R               COLHDG('5th Schd' ' Repo Reminder')
R1021A                                      REFFLD(SSCOD1)
     A*
SS01 A            PDFD1     R               COLHDG('Agmt From Day - #1')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDTD1     R               COLHDG('Agmt To Day - #1')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDDD1     R               COLHDG('Agmt Due Day - #1')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDFD2     R               COLHDG('Agmt From Day - #2')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDTD2     R               COLHDG('Agmt To Day - #2')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDDD2     R               COLHDG('Agmt Disb Due Day-#2')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDFD3     R               COLHDG('Agmt From Day - #3')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDTD3     R               COLHDG('Agmt To Day - #3')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDDD3     R               COLHDG('Agmt Due Day - #3')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDFD4     R               COLHDG('Agmt From Day - #4')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDTD4     R               COLHDG('Agmt To Day - #4')
SS01 A                                      REFFLD(SSCOU2)
SS01 A            PDDD4     R               COLHDG('Agmt Due Day - #4')
SS01 A                                      REFFLD(SSCOU2)
R1019A            PDFD5     R               COLHDG('Agmt From Day - #5')
R1019A                                      REFFLD(SSCOU2)
R1019A            PDTD5     R               COLHDG('Agmt To Day - #5')
R1019A                                      REFFLD(SSCOU2)
R1019A            PDDD5     R               COLHDG('Agmt Due Day - #5')
R1019A                                      REFFLD(SSCOU2)
R1019A            PDFD6     R               COLHDG('Agmt From Day - #6')
R1019A                                      REFFLD(SSCOU2)
R1019A            PDTD6     R               COLHDG('Agmt To Day - #6')
R1019A                                      REFFLD(SSCOU2)
R1019A            PDDD6     R               COLHDG('Agmt Due Day - #6')
R1019A                                      REFFLD(SSCOU2)
SS01 A            PDLMTD    R               COLHDG('Commission Calc' 'method')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PAGHPA    R               COLHDG('Auto Gen HPA' 'Form A/B')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PSUBJC    R               COLHDG('Subject to Commis' +
SS01 A                                               'sion/Dealership')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PTMDR     R               COLHDG('Dlr Comm Amor.' 'Period')
SS01 A                                      REFFLD(SSCOU5)
SS01 A            PTMCDR    R               COLHDG('Dlr Comm Amor.'  +
SS01 A                                               'Period Term Cd')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PTMSD     R               COLHDG('Sub-Dlr Comm Amor' 'Period')
SS01 A                                      REFFLD(SSCOU5)
SS01 A            PTMCSD    R               COLHDG('Sub-Dlr Comm Amor' +
SS01 A                                               'Period Term Cd')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            PTMSM     R               COLHDG('Salesman Comm Amor ' +
SS01 A                                               'Period')
SS01 A                                      REFFLD(SSCOU5)
SS01 A            PTMCSM    R               COLHDG('Salesman Comm Amor ' +
SS01 A                                               'Period Term Cd')
SS01 A                                      REFFLD(SSCOD1)
SS12 A            P2SVAT    R               COLHDG('Stop VAT Frequency')
SS12 A                                      REFFLD(SSCOU5)
SS12 A            P2SVTC    R               COLHDG('Stop VAT Freq. Code')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            P2MINV    R               COLHDG('Close Account' +
SS12 A                                               'According to Min VAT')
SS12 A                                      REFFLD(SSCOD1)
H001 A*** LEASING REQUIREMENT
H001 A            PFTICD    R               COLHDG('Charge to Misc/' 'Othchg')
H001 A                                      REFFLD(SSCOD1)
H001 A            PFTICT    R               COLHDG('Tax Indem' 'Charge Type')
H001 A                                      REFFLD(SSCOD2)
     A*
A048 A            PLNCSV    R               COLHDG('Link Loan to CA/SA')
A048 A                                      REFFLD(SSCOD1)
R1007A            PMXHAM    R               COLHDG('Billing Maximum' +
R1007A                                      'Threshold Amount')
R1007A                                      REFFLD(SSAMT4)
R1007A            PMXHTL    R               COLHDG('Maximum Times of' +
R1007A                                      'Payment Holiday' 'per Tenor')
R1007A                                      REFFLD(SSCOU5)
K0002A** LOAN PRODUCT PARAMETER
K0002A            LPPTEM    R               COLHDG('Temporary Suspense' +
K0002A                                      'Card (Days)')
K0002A                                      REFFLD(SSCOU3)
K0002A            LPPPCC    R               COLHDG('Permanent Cancel' +
K0002A                                      'Card Due Date' +
kk006A                                      '(Days)')
K0002A                                      REFFLD(SSCOU3)
K0002A            LPPRAT    R               COLHDG('Minimum Patment' +
K0002A                                      'Ratio X %')
K0002A                                      REFFLD(SSPERD)
K0002A            LPPIND    R               COLHDG('Base Indicator of' +
K0002A                                      'Minimum Payment X %')
K0002A                                      REFFLD(SSCLAS)
K0002A            LPPMIN    R               COLHDG('Minimum Patment' +
K0002A                                      'Amount of X %')
K0002A                                      REFFLD(SSAMT4)
K0002A            PPINTB    R               COLHDG('Interest Payment' +
K0002A                                      'Before Day')
K0002A                                      REFFLD(SSCOU5)
K0002A            PMXPDD    R               COLHDG('Number of Past Due' +
K0002A                                      'for Suspense' +
k0002a                                      'Facility')
K0002A                                      REFFLD(SSCOU5)
K0002A            PPMOVR    R               COLHDG('Override Current In' +
K0002A                                      'tallment Amount by' +
K0002A                                      'Interest Due Amount')
K0002A                                      REFFLD(SSYON)
K0002A            PMXAVR    R               COLHDG('Number of Average Lo' +
K0002A                                      'an Term(Days) for' +
K0002A                                      'Suspend Limit')
K0002A                                      REFFLD(SSCOU5)
K0004A            PUPDMR    R               COLHDG('Update Maturity' +
K0004A                                      'Date (Redraw)')
K0004A                                      REFFLD(SSCOD1)
K0006A            PADDIN    R               COLHDG('Additional Interest' +
K0006A                                      'to Fee when Pay-off')
K0006A                                      REFFLD(SSPERD)
K0006A            PADDCT    R               COLHDG('Charge Type of' +
K0006A                                      'Additional Fee When' +
K0006A                                      'Pay-Off')
K0006A                                      REFFLD(SSCOD1)
K0006A            PADDCC    R               COLHDG('Charge Code of' +
K0006A                                      'Additional Fee When' +
K0006A                                      'Pay-Off')
K0006A                                      REFFLD(SSCOD2)
K0006A            PMXPMT    R               COLHDG('Number of Past Due' +
K0006A                                      'After Maturity for' +
K0006A                                      'Suspense Facility')
K0006A                                      REFFLD(SSCOU5)
K0008A            PNRPM     R               COLHDG('Allow Normal Payment' +
K0008A                                      'For Bundle Product')
K0008A                                      REFFLD(SSYON)
     *** Field removed from LNPAR2
     A*M021       PISFUN    R               COLHDG('Fund Type')
     A*M021                                 REFFLD(SSCOD1)
     A*M020       PPPPCD    R               COLHDG('Prepayment' 'Penalty Code')
     A*M020                                 REFFLD(SSCOD1)
A036 A*M020       PMCLIN    R               COLHDG('Multi-Currency' '(Y/N)')
A036 A*M020                                 REFFLD(SSCOD1)
     A**V001      PFPR5     R               COLHDG('% on interest rebate')
     A**V001                                REFFLD(SSPERD)
H001 A*           PARELP    R               COLHDG('Alt Rate By' 'Rel Period')
H001 A*                                     REFFLD(SSCOD1)
     ***
     A*****************************************************************
H001 A* LNDPR2 - Product Type Div Code Parameter.
     A            LDP2DV    R               COLHDG('Division')
     A                                      REFFLD(SSCOD3)
     A            LDP2PT    R               COLHDG('Loan' 'Type')
     A                                      REFFLD(SSPROD)
     A            LDP2CU    R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A*****************************************************************
     A*
     A* PARAMETER 3  - TRAN CODES - LNPAR3
     A*
     A            L3TRAN    R               COLHDG('Tran' 'Code')
     A                                      REFFLD(SSTRAN)
     A            L3RTRN    R               COLHDG('Reversal' 'Tran Code')
     A                                      REFFLD(SSTRAN)
     A            L3GLIF    R               COLHDG('GL Interface' 'Number')
     A                                      REFFLD(SSCOU3)
     A            L3DORC    R               COLHDG('Dr/Cr' 'Code')
     A                                      REFFLD(SSCOD1)
     A            L3AFFT    R               COLHDG('Affects' 'Code')
     A*V001                                 REFFLD(SSCOD1)
V001 A                                      REFFLD(SSCOD2)
     A            L3AFNP    R               COLHDG('Affects Next' 'Pymt Date')
     A                                      REFFLD(SSCOD1)
     A            L3AFAR    R               COLHDG('Affects' 'Amount Released')
     A                                      REFFLD(SSCOD1)
     A            L3EPEN    R               COLHDG('Subject to' 'Penalty')
     A                                      REFFLD(SSCOD1)
     A            L3RBAL    R               COLHDG('Affect' 'Rest Balance')
     A                                      REFFLD(SSCOD1)
     A            L3PSEQ    R               COLHDG('Posting' 'Sequence')
     A                                      REFFLD(SSCOD1)
R1049A            L3AFCA    R               COLHDG('Affects' 'Current Account' -
R1049A                                      'Balance')
R1049A                                      REFFLD(SSCOD1)
     A            L3AFRE    R               COLHDG('Affects' 'Amount refund')
     A                                      REFFLD(SSCOD1)
SS03 A            L3AFRD    R               COLHDG('Affects Redraw Limit')
SS03 A                                      REFFLD(SSCOD1)
SS03 A            L3RDWP    R               COLHDG('Redraw %')
SS03 A                                      REFFLD(SSPERD)
V001 A            L3TTYP    R               COLHDG('Transaction' 'Type')
V001 A                                      REFFLD(SSCOD2)
M005 A            L3CORF    R               COLHDG('Correction Flag')
M005 A                                      REFFLD(SSCOD1)
BA01 A            L3REDM    R               COLHDG('Redemption' 'transaction')
BA01 A                                      REFFLD(SSCOD1)
M024 A            L3WAIV    R               COLHDG('Waiver' 'transaction')
M024 A                                      REFFLD(SSCOD1)
M024 A            L3ADJF    R               COLHDG('Aff Susp/Prov' 'Balance')
M024 A                                      REFFLD(SSCOD1)
     A            L3TCDS    R               COLHDG('Tran Code' 'Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
AM01 A            L3EXAF    R               COLHDG('Excess Amount' -
     A                                      'Affect Code')
     A                                      REFFLD(SSCOD2)
R1047A*
R1047A            L3ITAX    R               COLHDG('Affect Interest' -
R1047A                                      'Taxable-Code')
R1047A                                      REFFLD(SSCOD1)
R1047A*
R1003A            L3TLDS    R               COLHDG('Tran Code Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            L3TSDS    R               COLHDG('Tran Code Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
     A* LNPAR5 - CENSUS TRACT INFORMATION
     A*
     A            L5SMSA    R               COLHDG('SMSA' 'Number')
     A                                      REFFLD(SSCODA)
     A            L5CENS    R               COLHDG('Census' 'Number')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            L5STAT    R               COLHDG('State' 'Number')
     A                                      REFFLD(SSCOU3)
     A            L5CNTY    R               COLHDG('County' 'Number')
     A                                      REFFLD(SSCOU3)
     A            L5DESC    R               COLHDG('Description')
     A                                      REFFLD(SSDESM)
     A            L5INCM    R               COLHDG('Income' 'Code')
     A                                      REFFLD(SSCOU1)
     A            L5MINT    R               COLHDG('Minority' 'Code')
     A                                      REFFLD(SSCOD1)
     A*****************************************************************
     A*
     A** LOAN NOTICE WORDING PARAMETER FILE - LNPARA
     A*
     A            LPACOD    R               COLHDG('Report/Notice' 'Code')
     A                                      REFFLD(SSCOD2)
     A            LPATYP    R               COLHDG('Report/Notice' 'Type')
     A*V001                                 REFFLD(SSCOD2)
V001 A                                      REFFLD(SSPROD)
     A            LPAHDG        55          COLHDG('Report' 'Heading')
     A            LPAL1         55          COLHDG('Report' 'Line 1')
     A            LPAL2         55          COLHDG('Report' 'Line 2')
     A            LPAL3         55          COLHDG('Report' 'Line 3')
     A            LPAL4         55          COLHDG('Report' 'Line 4')
     A            LPAL5         55          COLHDG('Report' 'Line 5')
     A*  LPACOD
     A*  BO - Billing Notice
     A*  P1 - 1st Past Due Notice
     A*  P2 - 2nd Past Due Notice
     A*  PD - Past Due Report
     A*  PR - Rate Change Notice
     A*  EM - End of Month Program
     A*
     A*****************************************************************
     A*
     A** ESCROW DISTRIBUTION FILE - LNPARB
     A*
     A            LPBDCD    R               COLHDG('Dist' 'Code')
     A                                      REFFLD(SSCOU3)
     A            LPBDES    R               COLHDG('Distribution' 'Description')
     A                                      REFFLD(SSDESC)
R1003A            LPBLDS    R               COLHDG('Distribution' 'Local -
R1003A                                      Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPBSDS    R               COLHDG('Distribution' 'Short -
R1003A                                      Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
     A** ESCROW POSITION FILE - LNPARC
     A*
     A            LPCTYP    R               COLHDG('Escrow TYPE' 'Number')
     A                                      REFFLD(SSCOU1)
     A            LPCDES    R               COLHDG('Escrow Type' 'Description')
     A                                      REFFLD(SSDESC)
R1003A            LPCELD    R               COLHDG('Escrow Type' 'Local -
R1003A                                      Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPCESD    R               COLHDG('Escrow Type' 'Short -
R1003A                                      Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
     A** LOAN INSURANCE COMPANY PARAMETER FILE - LNPARD
     A*
     A            LPDNUM    R               COLHDG('Insurance' 'Number')
     A                                      REFFLD(SSCOU3)
     A            LPDNA1    R               COLHDG('Insurance' 'Name')
     A                                      REFFLD(SSNAML)
     A            LPDNA2    R               COLHDG('Insurance' 'Address')
     A                                      REFFLD(SSNAML)
     A            LPDNA3    R               COLHDG('Insurance' 'City/State')
     A                                      REFFLD(SSNAML)
     A            LPDFON    R               COLHDG('Insurance Co.' 'Phone N')
     A                                      REFFLD(SSTELE)
     A            LPDRSV    R               COLHDG('Reserve' 'Percent')
     A                                      REFFLD(SSPERD)
H001 A            LPDPAN    R               COLHDG('Panel/' 'non-panel')
H001 A                                      REFFLD(SSCOD1)
     A*****************************************************************
     A*
     A** LOAN USER CODE PARAMETER FILE - LNPARU
     A*
     A            LPUUCD    R               COLHDG('User' 'Code')
     A                                      REFFLD(SSCOD3)
R1003A*R1015      LPUSDS    R               COLHDG('User Local'  'Description')
R1015A            LPUSDS    R               COLHDG('User Short'  'Description')
R1003A                                      REFFLD(SSDES2)
     A            LPUUDS    R               COLHDG('User' 'Description')
     A*R1015                                REFFLD(SSDESM)
R1015A                                      REFFLD(SSDESC)
R1003A            LPULDS    R               COLHDG('User Local'  'Description')
R1003A                                      REFFLD(SSDESC)
     A            LPUICD    R               COLHDG('Item' 'Code')
     A                                      REFFLD(SSCOD3)
R1003A*R1015      LPUISD    R               COLHDG('Item Local'  'Description')
R1015A            LPUISD    R               COLHDG('Item Short'  'Description')
R1003A                                      REFFLD(SSDESC)
     A            LPUIDS    R               COLHDG('Item' 'Description')
     A                                      REFFLD(SSDESM)
R1003A            LPUILD    R               COLHDG('Item Local'  'Description')
R1003A                                      REFFLD(SSDESC)
     A*****************************************************************
     A*
     A** LOAN USER CODE PARAMETER FILE - LNPARX
     A*
     A            LPXTYP    R               COLHDG('Misc or' 'Other charges')
     A                                      REFFLD(SSCOD1)
     A            LPXCOD    R               COLHDG('charge' 'type code')
     A                                      REFFLD(SSCOD2)
     A            LPXDES    R               COLHDG('charge' 'description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPXILD    R               COLHDG('Charge Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPXISD    R               COLHDG('Charge Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A            LPXMNE    R               COLHDG('C/Type' ' Mnemonic Code')
     A                                      REFFLD(SSCOD3)
SS09 A            LPXPSP    R               COLHDG('Payment' 'Split Priority')
SS09 A                                      REFFLD(SSCOU2)
     A            LPXAGL    R               COLHDG('G/L' 'Account number')
     A                                      REFFLD(SSACGL)
M006 A            LPXZGL    R               COLHDG('Amortize earn' 'susp GL AC')
M006 A                                      REFFLD(SSACGL)
M006 A            LPXAMZ    R               COLHDG('Amortize fee earning')
M006 A                                      REFFLD(SSCOD1)
M006 A            LPXNDB    R               COLHDG('Ndays for' 'Billing Notice')
M006 A                                      REFFLD(SSCOU3)
M006 A            LPXVAT    R               COLHDG('Subject to VAT')
M006 A                                      REFFLD(SSCOD1)
R1009A            LPXMCB    R               COLHDG('Subject to' +
R1009A                                      ' Maximum Central' ' Bank Cap')
R1009A                                      REFFLD(SSCOD1)
R1009A            LPXRFD    R               COLHDG('Refundable')
R1009A                                      REFFLD(SSCOD1)
R1009A            LPXSBT    R               COLHDG('Subject to' +
R1009A                                      ' Special Business' 'Tax')
R1009A                                      REFFLD(SSCOD1)
M006 A            LPXIVT    R               COLHDG('In/Ex of VAT')
M006 A                                      REFFLD(SSCOD1)
M006 A            LPXDIS    R               COLHDG('Subject to' 'Cust Discount')
M006 A                                      REFFLD(SSCOD1)
M006 A            LPXICT    R               COLHDG('Internal Charge Type')
M006 A                                      REFFLD(SSCOD2)
M006 A            LPXVTP    R               COLHDG('VAT %')
M006 A                                      REFFLD(SSPERD)
R1009A            LPXGLS    R               COLHDG('GL Account' +
R1009A                                      ' Number for VAT')
R1009A                                      REFFLD(SSACCN)
SS16 A            LPXWH     R               COLHDG('W/H Code')
SS16 A                                      REFFLD(SSCOU1)
K0011A            LPXWTX    R               COLHDG('Withholding Tax %')
K0011A                                      REFFLD(SSPERD)
     A*****************************************************************
     A*
     A** LOAN PROCESSING DATE PARAMETER FILE - LNPAR1
     A*
OS01 A            LP1LP8    R               COLHDG('Last Processing Date')
OS01 A                                      REFFLD(SSDAT8)
     A            LP1PD8    R               COLHDG('Processing Date')
     A                                      REFFLD(SSDAT8)
M017 A            LP1NB8    R               COLHDG('Next Business' 'Date')
M017 A                                      REFFLD(SSDAT8)
M001 A            LP1TR8    R               COLHDG('Processing' 'through date')
M001 A                                      REFFLD(SSDAT8)
     A            LP1NUM    R               COLHDG('N of Days' 'To Accrue')
     A                                      REFFLD(SSCOU1)
     A            LP1EOM    R               COLHDG('Days to' 'End of month')
     A                                      REFFLD(SSCOU1)
     A*****************************************************************
     A*
     A** DEPARTMENT CODE PARAMETER FILE - LNPAR4
     A*
     A            LP4COD    R               COLHDG('Department' 'Code')
     A                                      REFFLD(SSCOU3)
     A            LP4DSC    R               COLHDG('Department' 'Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LP4LDS    R               COLHDG('Department Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LP4SDS    R               COLHDG('Department Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
     A** Penalty Interest Parameter File - LNPAR6
     A*
     A            LP6TYP    R               COLHDG('Penalty Int' 'Type')
     A                                      REFFLD(SSCOU3)
     A            LP6DSC    R               COLHDG('Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LP6LDS    R               COLHDG('Penalty Int Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LP6SDS    R               COLHDG('Penalty Int Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A            LP6PCT    R               COLHDG('Percent of' 'Payment')
     A                                      REFFLD(SSPERD)
     A            LP6MAX    R               COLHDG('Maximum' 'Charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LP6MIN    R               COLHDG('Minimum' 'Charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LP6DAY    R               COLHDG('Day to' 'Charge')
     A                                      REFFLD(SSCOU3)
     A            LP6MON    R               COLHDG('Month to' 'Charge')
     A                                      REFFLD(SSCOU3)
     A            LP6PEG    R               COLHDG('Peg (P/E)')
     A                                      REFFLD(SSCOD1)
     A            LP6RN     R               COLHDG('Peg to' 'RateN')
     A                                      REFFLD(SSRATE)
     A            LP6GRC    R               COLHDG('Grace on each' 'P/D pmt')
     A                                      REFFLD(SSCOD1)
M005 A            LP6ANO    R               COLHDG('SBV Rate')
M005 A                                      REFFLD(SSPERD)
M005 A            LP6CEI    R               COLHDG('Ceiling rate')
M005 A                                      REFFLD(SSPERD)
M005 A            LP6FLR    R               COLHDG('Floor rate')
M005 A                                      REFFLD(SSPERD)
A005 A*           LP6FIX    R               COLHDG('Fix Amount Charge')
A005 A*                                     REFFLD(SSAMT2)
     A*** PROGRESSIVE RELEASE
     A            LP6PPC    R               COLHDG('Prog rel' 'pct of payment')
     A                                      REFFLD(SSPERD)
     A            LP6PMA    R               COLHDG('Prog rel' 'max Charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LP6PMI    R               COLHDG('Prog rel' 'min Charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LP6PDA    R               COLHDG('Prog rel' 'day to CHG')
     A                                      REFFLD(SSCOU3)
     A            LP6PMO    R               COLHDG('Prog rel' 'month to CHG')
     A                                      REFFLD(SSCOU3)
     A            LP6PPE    R               COLHDG('Prog rel' 'peg (P/E)')
     A                                      REFFLD(SSCOD1)
     A            LP6PRN    R               COLHDG('Prog rel' 'Peg to RateN')
     A                                      REFFLD(SSRATE)
     A            LP6PGR    R               COLHDG('Prog rel' 'grc each PD pmt')
     A                                      REFFLD(SSCOD1)
M005 A            LP6BNO    R               COLHDG('Progressive Rel' 'SBV Rate')
M005 A                                      REFFLD(SSPERD)
A005 A*           LP6PFX    R               COLHDG('Prog rel' 'Fix Amount')
A005 A*                                     REFFLD(SSAMT2)
     A*** MATURED LOANS
     A            LP6MPC    R               COLHDG('Matured' 'pct of payment')
     A                                      REFFLD(SSPERD)
     A            LP6MMA    R               COLHDG('Matured' 'max Charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LP6MMI    R               COLHDG('Matured' 'min Charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LP6MDA    R               COLHDG('Matured' 'day to CHG')
     A                                      REFFLD(SSCOU3)
     A            LP6MMO    R               COLHDG('Matured' 'month to CHG')
     A                                      REFFLD(SSCOU3)
     A            LP6MPE    R               COLHDG('Matured' 'peg (P/E)')
     A                                      REFFLD(SSCOD1)
     A            LP6MRN    R               COLHDG('Matured' 'Peg to Rate#')
H001 A*                                     REFFLD(SSCOU3)
H001 A                                      REFFLD(SSRATE)
     A            LP6MGR    R               COLHDG('Matured' 'grc each PD pmt')
     A                                      REFFLD(SSCOD1)
     A            LP6BAL    R               COLHDG('Use loan value' 'after mat')
     A                                      REFFLD(SSCOD1)
     A            LP6WAV    R               COLHDG('Waive grace' 'period chg')
     A                                      REFFLD(SSCOD1)
M005 A            LP6MNO    R               COLHDG('Matured Rel' 'SBV Rate')
M005 A                                      REFFLD(SSPERD)
M005 A            LP6TIR    R               COLHDG('TIER LC FLAG')
M005 A                                      REFFLD(SSCOD1)
A005 A*           LP6MFX    R               COLHDG('Matured Fix Amount')
A005 A*                                     REFFLD(SSAMT2)
     A** Y = L/c start after grace day
     A** N = L/c clawback to payment due date
     A*
     A*****************************************************************
     A*
     A** LOAN CALL REPORT PARAMETER FILE - LNPAR7
     A*
     A            LP7CAL    R               COLHDG('Call Report' 'Code')
     A                                      REFFLD(SSCOD6)
     A            LP7DSC    R               COLHDG('Call Report' 'Description')
     A                                      REFFLD(SSDESC)
R1003A            LP7LDS    R               COLHDG('Call Report Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LP7SDS    R               COLHDG('Call Report Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
     A*****************************************************************
     A*
     A** LOAN PURPOSE CODE PARAMETER FILE - LNPAR9
     A*
     A            LP9PUR    R               COLHDG('Purpose' 'Code')
     A                                      REFFLD(SSCOD2)
     A            LP9DES        60          COLHDG('Purpose' 'Description')
R1003A            LP9LDS    R               COLHDG('Purpose Code Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LP9SDS    R               COLHDG('Purpose Code Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
     A** LOAN ESCROW CHECK DIST NAME FILE - LNPARF
     A*
     A            LPFCOD    R               COLHDG('Check Name' 'Code')
     A                                      REFFLD(SSCOU5)
     A            LPFAD1    R               COLHDG('Check Name/Add' 'Line 1')
     A                                      REFFLD(SSNAML)
     A            LPFAD2    R               COLHDG('Check Name/Add' 'Line 2')
     A                                      REFFLD(SSNAML)
     A            LPFAD3    R               COLHDG('Check Name/Add' 'Line 3')
     A                                      REFFLD(SSNAML)
     A            LPFAD4    R               COLHDG('Check Name/Add' 'Line 4')
     A                                      REFFLD(SSNAML)
     A            LPFAD5    R               COLHDG('Check Name/Add' 'Line 5')
     A                                      REFFLD(SSNAML)
     A            LPFAD6    R               COLHDG('Check Name/Add' 'Line 6')
     A                                      REFFLD(SSNAML)
     A*****************************************************************
     A*
     A* LNASIC - APPLICATION SIC NO. DESCRIPTION PARAMETER
     A*
     A*V001       LSICSQ    R
     A*V001                                 REFFLD(SSCOU1)
     A*V001       LSICDS    R
     A*V001                                 REFFLD(SSPROM)
     A
     A*****************************************************************
     A*
     A* LNDSIC - APPLICATION SIC CODE PARAMETER
     A*
     A*V001       LDSSEQ    R
     A*V001                                 REFFLD(SSCOU1)
     A*V001       LDSCOD    R
     A*V001                                 REFFLD(SSCOD5)
     A*V001       LDSDES    R
     A*V001                                 REFFLD(SSPROM)
     A
     A*****************************************************************
     A*
     A** GENERAL LOAN PARAMETER FILE - LNPARZ
     A*
     A            LPZLIN    R               COLHDG('Amount for' 'Total Liab')
     A                                      REFFLD(SSAMT4)
     A            LPZERN    R               COLHDG('Show earnings' 'in history')
     A                                      REFFLD(SSCOD1)
V001 A            LPZGPV    R               COLHDG('General' 'Provision %')
V001 A                                      REFFLD(SSPERD)
M001 A            LPZSTM    R               COLHDG('Statement of' 'A/C Freq')
M001 A                                      REFFLD(SSCOD1)
M001 A            LPZCSH    R               COLHDG('Y-Cash basis' +
M001 A                                      'N-Accrual basis')
M001 A                                      REFFLD(SSCOD1)
M004 A            LPZMTD    R               COLHDG('Balance' 'Method')
M004 A                                      REFFLD(SSCOD1)
M028 A            LPZSPD    R               COLHDG('SP Closing Day')
M028 A                                      REFFLD(SSTDVR)
M028 A            LPZSD8    R               COLHDG('SP Closing Date')
M028 A                                      REFFLD(SSDAT8)
M034 A            LPZSSU    R               COLHDG('Use Syndicated' 'Suspense')
M034 A                                      REFFLD(SSCOD1)
SS01 A            LPZHPA    R               COLHDG('HPA Member Code')
SS01 A                                      REFFLD(SSCODA)
SS09 A            LPZRET    R               COLHDG('Retantion Year')
SS09 A                                      REFFLD(SSCOU1)
SS09 A            LPZSDL    R               COLHDG('Security Deposit' 'in Loan')
SS09 A                                      REFFLD(SSCOD1)
V1001A            LPZSPT    R               COLHDG('Auto splitting Y/N')
V1001A                                      REFFLD(SSCOD1)
R1001A            LPZDPM    R               COLHDG('Days overdue' 'to +
R1001A                                      prompt Disb Msg')
R1001A                                      REFFLD(SSCOU3)
R1001A            LPZCON    R               COLHDG('Constitution Code')
R1001A                                      REFFLD(SSCOD1)
R1001A            LPZTLM    R               COLHDG('Commitment Fee' +
R1001A                                      'Threshold Limit')
R1001A                                      REFFLD(SSAMT4)
R1028A            LPZSID    R               COLHDG('G/L Source System ID')
R1028A                                      REFFLD(SSCODA)
R1037A            LPZRBN    R               COLHDG('Use RBRN for' 'Auth Chk')
R1037A                                      REFFLD(SSCOD1)
     A*****************************************************************
     A*
     A*****************************************************************
     A*
     A** TERRITORY CODE PARAMETER LNPART)
     A**
     A            LTCODE    R               COLHDG('Territory' 'Code')
     A                                      REFFLD(SSCOD3)
     A            LTDESC    R               COLHDG('Territory' 'Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LTLDSC    R               COLHDG('Territory Code Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LTSDSC    R               COLHDG('Territory Code Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A            LTCCHG    R               COLHDG('Collection' 'Charges')
     A                                      REFFLD(SSAMT4)
     A*****************************************************************
     A*
     A*****************************************************************
     A*
     A* LOAN GROUP PARAMETER (LNPARQ)
     A**
     A            LONDSC    R               COLHDG('Loan Group Desc.')
     A*R1003                                REFFLD(SSDESS)
R1003A                                      REFFLD(SSDESC)
R1003A            LOLDSC    R               COLHDG('Loan Group Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LOSDSC    R               COLHDG('Loan Group Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A**
     A* CAR CODE PARAMETER (LNPARR)
     A*
M010 A*R1001      CARTYP    R               COLHDG('CAR Type')
R1001A            CARTYP    R               COLHDG('Classification Type')
M010 A                                      REFFLD(SSCOD1)
     A*R1001      CARCOD    R               COLHDG('CAR Code')
R1001A            CARCOD    R               COLHDG('Classification Code')
     A                                      REFFLD(SSCOD2)
     A*R1001      CARDSC    R               COLHDG('Description')
R1001A            CARDSC    R               COLHDG('Classification' -
R1001A                                      'Description')
     A*R1003                                REFFLD(SSDESS)
R1003A                                      REFFLD(SSDESC)
R1003A            CARLDS    R               COLHDG('Classification' 'Code' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            CARSDS    R               COLHDG('Classification' 'Code' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     A            CARNRV    R               COLHDG('Shortfall of NRV %')
     A                                      REFFLD(SSPERD)
H001 A*M029       CARPOF    R               COLHDG('Default' 'Position From')
M029 A            CARPOF    R               COLHDG('Paym Freq < 3 Months')
H001 A                                      REFFLD(SSCOU3)
H001 A*M029       CARPOT    R               COLHDG('Default' 'Position To')
M029 A            CARPOT    R               COLHDG('Paym Freq >= 3 Mths')
H001 A                                      REFFLD(SSCOU3)
H001 A            CARMOD    R               COLHDG('Mode')
H001 A                                      REFFLD(SSCOD1)
R1009A            CARNPL    R               COLHDG('Entity NPL Status')
R1009A                                      REFFLD(SSCOD1)
R1009A            CARSUP    R               COLHDG('Entity Interest' +
R1009A                                      ' Suspend Status')
R1009A                                      REFFLD(SSCOD1)
R1041A            CARRST    R               COLHDG('Restructured Default' -
R1041A                                      'Classification')
R1041A                                      REFFLD(SSCOD2)
R1046A            CARCMP    R               COLHDG('Compromised Settl.' -
R1046A                                      'Classification')
R1046A                                      REFFLD(SSCOD2)
     A*****************************************************************
     A**
     A* DEALER GROUP  (LNDLGP)
     A            LGDLGP    R               COLHDG('Dealer' 'Group')
     A*                                     REFFLD(SSCOU3)
H001 A                                      REFFLD(SSCODA)
     A            LGDESC    R               COLHDG('Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LGLLDS    R               COLHDG('Dealer Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LGSSDS    R               COLHDG('Dealer Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
H001 A            LGLIMT    R               COLHDG('Dealer Group' 'Limit')
H001 A                                      REFFLD(SSAMT4)
H001 A            LGUFBR    R               COLHDG('Undertaking' 'Limit-FBR')
H001 A                                      REFFLD(SSAMT4)
H001 A            LGUFBT    R               COLHDG('Undertaking' 'Limit-FBT')
H001 A                                      REFFLD(SSAMT4)
H001 A            LGDRAT    R               COLHDG('Delinquency' 'Rate')
H001 A                                      REFFLD(SSPERD)
H001 A            LGCRAT    R               COLHDG('Conversion' 'Rate')
H001 A                                      REFFLD(SSPERD)
H001 A            LGAFEE    R               COLHDG('Admin Fee')
H001 A*OS01                                 REFFLD(SSAMT3)
OS01 A                                      REFFLD(SSAMT4)
     A*****************************************************************
H002 A* DEALER GROUP ADDITONAL INFORAMTION (LNDEVA)
H002 A            LDAGRP    R               COLHDG('Dealer' 'Group')
H002 A                                      REFFLD(SSCODA)
H002 A            LDACON    R               COLHDG('Company' 'No.')
H002 A                                      REFFLD(SSCODA)
H002 A            LDADD1    R               COLHDG('Dealer Grp' 'Address Line1')
H002 A                                      REFFLD(SSNAML)
H002 A            LDADD2    R               COLHDG('Dealer Grp' 'Address Line2')
H002 A                                      REFFLD(SSNAML)
H002 A            LDADD3    R               COLHDG('Dealer Grp' 'Address Line3')
H002 A                                      REFFLD(SSNAML)
H002 A            LDAPH1    R               COLHDG('Dealer Grp' 'Phone1')
H002 A                                      REFFLD(SSTELE)
H002 A            LDAPH2    R               COLHDG('Dealer Grp' 'Phone2')
H002 A                                      REFFLD(SSTELE)
     A*****************************************************************
     A**
     A* NOTICE CHARGES PARAMETER (LNPPAR)
     A*
     A            NCCODE    R               COLHDG('Notice' 'Code')
     A                                      REFFLD(SSCOD2)
H001 A            NCTYPE    R               COLHDG('Product' 'Type')
     A                                      REFFLD(SSPROD)
     A            NCCUR     R               COLHDG('Currency')
     A                                      REFFLD(SSCURC)
     A            NCSEQ     R               COLHDG('Seq')
     A                                      REFFLD(SSCOU3)
     A            NCDESC    R               COLHDG('Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            NCLLDS    R               COLHDG('Notice Code Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            NCSSDS    R               COLHDG('Notice Code Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A            NCCHG     R               COLHDG('Charges')
     A                                      REFFLD(SSAMT4)
     A            NCCTYP    R               COLHDG('Charge' 'Type')
     A                                      REFFLD(SSCOD2)
H001 A            NCMCOC    R               COLHDG('Charge to MC or OC')
H001 A                                      REFFLD(SSCOD1)
H003 A            NCGUAT    R               COLHDG('Charge to' 'guarantor flag')
H003 A                                      REFFLD(SSCOD1)
A032 A            NCPHLM    R               COLHDG('Hold Mail(Y/N)')
A032 A                                      REFFLD(SSCOD1)
A032 A            NCGHLM    R               COLHDG('Hold Guarantor'  +
A032 A                                      'Mail(Y/N)')
A032 A                                      REFFLD(SSCOD1)
A032 A            NCHMSC    R               COLHDG('Hold Mail' 'Srv.Charge')
A032 A                                      REFFLD(SSAMT4)
A032 A            NCHMCT    R               COLHDG('Hold Mail' 'Charge Type')
A032 A                                      REFFLD(SSCOD2)
A032 A            NCHMMO    R               COLHDG('Hold Mail' +
A032 A                                              'Charges to MC or OC')
A032 A                                      REFFLD(SSCOD1)
A032 A            NCGPNC    R               COLHDG('Generate Notice Y/N')
A032 A                                      REFFLD(SSCOD1)
A032 A            NCGGNC    R               COLHDG('Generate Guarantor'  +
A032 a                                      'Notice Y/N')
A032 A                                      REFFLD(SSCOD1)
     A*****************************************************************
     A**
     A* DEALER TYPE  PARAMETER (LNPARW)
     A*
     A            LWTYPE    R               COLHDG('Dealer' 'Type')
     A                                      REFFLD(SSCOD1)
     A            LWDESC    R               COLHDG('Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LWLLDS    R               COLHDG('Dealer Type Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LWSSDS    R               COLHDG('Dealer Type Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A**
     A* LOAN PAYMENT SPLIT PARAMETER FILE - LNPAR0
     A*
     A            LSTYPE    R               COLHDG('Loan' 'Type')
     A*V001                                 REFFLD(SSCOD2)
V001 A                                      REFFLD(SSPROD)
     A            LSCUR     R               COLHDG('Currency code')
     A                                      REFFLD(SSCURC)
     A            LSTC      R               COLHDG('Tran code')
     A                                      REFFLD(SSTRAN)
BA01 A            LSFLG     R               COLHDG('Payment Split' 'flag')
BA01 A                                      REFFLD(SSCOD1)
R1039A            LSSBU     R               COLHDG('Strategic' 'Business Unit')
R1039A                                      REFFLD(SSCOD4)
     A            LSPPRN    R               COLHDG('NPL' 'Principal')
     A                                      REFFLD(SSCOU2)
     A            LSPINT    R               COLHDG('NPL' 'Interest')
     A                                      REFFLD(SSCOU2)
     A            LSPIN1    R               COLHDG('NPL nonpaybl' 'Int not sus')
     A                                      REFFLD(SSCOU2)
     A            LSPESC    R               COLHDG('NPL' 'Escrow')
     A                                      REFFLD(SSCOU2)
     A            LSPLC     R               COLHDG('NPL' 'Late charges')
     A                                      REFFLD(SSCOU2)
     A            LSPOC     R               COLHDG('NPL' 'Other charges')
     A                                      REFFLD(SSCOU2)
     A            LSPMC     R               COLHDG('NPL' 'Misc charges')
     A                                      REFFLD(SSCOU2)
     A            LSPCF     R               COLHDG('NPL' 'Acc Com fees')
     A                                      REFFLD(SSCOU2)
     A            LSPINS    R               COLHDG('NPL payable' 'Susp int')
     A                                      REFFLD(SSCOU2)
     A            LSPIS1    R               COLHDG('NPL nonpayable' 'Susp int')
     A                                      REFFLD(SSCOU2)
     A            LSPLCS    R               COLHDG('NPL' 'Sus Late charges')
     A                                      REFFLD(SSCOU2)
V001 A            LSPCPF    R               COLHDG('NPL' 'CPF')
V001 A                                      REFFLD(SSCOU2)
A006 A            LSPRI     R               COLHDG('NPL' 'Restructure Int.')
A006 A                                      REFFLD(SSCOU2)
SS09 A            LSPMI     R               COLHDG('NPL' 'Moratorium Int.')
SS09 A                                      REFFLD(SSCOU2)
SS09 A            LSPVAT    R               COLHDG('NPL' 'VAT')
SS09 A                                      REFFLD(SSCOU2)
M016 A            LSPRLC    R               COLHDG('NPL' 'Restructure LC.')
M016 A                                      REFFLD(SSCOU2)
     A            LSCPRN    R               COLHDG('Current' 'Principa l')
     A                                      REFFLD(SSCOU2)
     A            LSCINT    R               COLHDG('Current' 'Interest ')
     A                                      REFFLD(SSCOU2)
     A            LSCESC    R               COLHDG('Current' 'Escrow')
     A                                      REFFLD(SSCOU2)
     A            LSCLC     R               COLHDG('Current' 'Late cha rges')
     A                                      REFFLD(SSCOU2)
     A            LSCOC     R               COLHDG('Current' 'Other ch arges')
     A                                      REFFLD(SSCOU2)
     A            LSCMC     R               COLHDG('Current' 'Misc cha rges')
     A                                      REFFLD(SSCOU2)
     A            LSCCF     R               COLHDG('Current' 'Acc Com fees')
     A                                      REFFLD(SSCOU2)
V001 A            LSCCPF    R               COLHDG('Current' 'CPF')
V001 A                                      REFFLD(SSCOU2)
A006 A            LSCRI     R               COLHDG('Current' 'Restructure Int.')
A006 A                                      REFFLD(SSCOU2)
SS09 A            LSCMI     R               COLHDG('Current' 'Moratorium Int.')
SS09 A                                      REFFLD(SSCOU2)
SS09 A            LSCVAT    R               COLHDG('Current' 'VAT')
SS09 A                                      REFFLD(SSCOU2)
M016 A            LSCRLC    R               COLHDG('Current' 'Restructure LC')
M016 A                                      REFFLD(SSCOU2)
     A*** FOLLOWING FIELDS DEFINE DOWN OR ACROSS ALLOCATION OF LNPMTB
     A*** 'A' INDICATES ACROSS AND ' ' INDICATES DOWN ALLOCATION
     A*** LN1200 WILL PROCESS ALL DOWN ALLOCATIONS THEN ACROSS
     A            LSXPRN    R               COLHDG('NPL' 'Principal')
     A                                      REFFLD(SSCOD1)
     A            LSXINT    R               COLHDG('NPL payable' 'Int not sus')
     A                                      REFFLD(SSCOD1)
     A            LSXIN1    R               COLHDG('NPL nonpaybl' 'Int not sus')
     A                                      REFFLD(SSCOD1)
     A            LSXESC    R               COLHDG('NPL' 'Escrow')
     A                                      REFFLD(SSCOD1)
     A            LSXLC     R               COLHDG('NPL' 'Late charges not sus')
     A                                      REFFLD(SSCOD1)
     A            LSXOC     R               COLHDG('NPL' 'Other charges')
     A                                      REFFLD(SSCOD1)
     A            LSXMC     R               COLHDG('NPL' 'Misc charges')
     A                                      REFFLD(SSCOD1)
     A            LSXCF     R               COLHDG('NPL' 'Acc com fees')
     A                                      REFFLD(SSCOD1)
     A            LSXINS    R               COLHDG('NPL payable' 'Susp int')
     A                                      REFFLD(SSCOD1)
     A            LSXIS1    R               COLHDG('NPL nonpayable' 'Susp int')
     A                                      REFFLD(SSCOD1)
     A            LSXLCS    R               COLHDG('NPL' 'Sus Late charges')
     A                                      REFFLD(SSCOD1)
V001 A            LSXCPF    R               COLHDG('NPL' 'CPF')
V001 A                                      REFFLD(SSCOD1)
A006 A            LSXRI     R               COLHDG('NPL' 'Restructure Int.')
A006 A                                      REFFLD(SSCOD1)
SS09 A            LSXMI     R               COLHDG('NPL' 'Moratorium Int.')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            LSXVAT    R               COLHDG('NPL' 'VAT')
SS09 A                                      REFFLD(SSCOD1)
M016 A            LSXRLC    R               COLHDG('NPL' 'Restructure LC')
M016 A                                      REFFLD(SSCOD1)
     A            LSZPRN    R               COLHDG('Current' 'Principal')
     A                                      REFFLD(SSCOD1)
     A            LSZINT    R               COLHDG('Current' 'Interest')
     A                                      REFFLD(SSCOD1)
     A            LSZESC    R               COLHDG('Current' 'Escrow')
     A                                      REFFLD(SSCOD1)
     A            LSZLC     R               COLHDG('Current' 'L/C')
     A                                      REFFLD(SSCOD1)
     A            LSZOC     R               COLHDG('Current' 'Other charges')
     A                                      REFFLD(SSCOD1)
     A            LSZMC     R               COLHDG('Current' 'Misc charges')
     A                                      REFFLD(SSCOD1)
     A            LSZCF     R               COLHDG('Curr' 'Acc com fees')
     A                                      REFFLD(SSCOD1)
V001 A            LSZCPF    R               COLHDG('Current' 'CPF')
V001 A                                      REFFLD(SSCOD1)
A006 A            LSZRI     R               COLHDG('Current' 'Restructure Int.')
A006 A                                      REFFLD(SSCOD1)
SS09 A            LSZMI     R               COLHDG('Current' 'Moratorium Int.')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            LSZVAT    R               COLHDG('Current' 'VAT')
SS09 A                                      REFFLD(SSCOD1)
M016 A            LSZRLC    R               COLHDG('Current' 'Restructure LC')
M016 A                                      REFFLD(SSCOD1)
     A            LSFM8     R               COLHDG('Maintenance date 6 ')
     A                                      REFFLD(SSDAT8)
     A*****************************************************************
     A*
     A* CCB PURPOSE CODE - LNPCCB
     A*
     A            LPCBPC    R               COLHDG('CCB Purpose code')
     A                                      REFFLD(SSCOU4)
     A            LPCBDS    R               COLHDG('CCB Purpse code desc')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPPLDS    R               COLHDG('CCB Purpose Code' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPPSDS    R               COLHDG('CCB Purpose Code' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
H001 A** PARAMETER TO DEFINE FREEBIES CODE (LNJPAR)
H001 A*
H001 A            LPFRB     R               COLHDG('Freebies  Code')
H001 A                                      REFFLD(SSCODA)
H001 A            LPFDSC    R               COLHDG('Description')
H001 A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPFLDS    R               COLHDG('Freebies Code' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPFSDS    R               COLHDG('Freebies Code' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
H001 A** PARAMETER TO DEFINE ORIGINATION/DELIVERY CHANNEL CODE (LNKPAR)
H001 A*
H001 A*           LPDLVY    R               COLHDG('Delivery Channel' 'Code')
H001 A*                                     REFFLD(SSCODA)
H001 A*           LPDDSC    R               COLHDG('Description')
H001 A*                                     REFFLD(SSDESM)
     A*****************************************************************
     A*
H001 A** PARAMETER TO DEFINE SOURCE/PROMOTION CODE (LNLPAR)
H001 A*
H001 A*           LPSRCE    R               COLHDG('Source' 'Code')
H001 A*                                     REFFLD(SSCODA)
H001 A*           LPSDSC    R               COLHDG('Description')
H001 A*                                     REFFLD(SSDESM)
     A*****************************************************************
     A*
H001 A** PARAMETER TO DEFINE ALL LAWYER DETAILS (LNNPAR)
H001 A*
H001 A            LPLWCD    R               COLHDG('Lawyer ID Code')
H001 A                                      REFFLD(SSCODA)
H001 A            LPLWRF    R               COLHDG('Lawyer Ref. Number')
H001 A                                      REFFLD(SSIDNO)
H001 A            LPLWNM    R               COLHDG('Lawyer Name')
H001 A                                      REFFLD(SSNAML)
H001 A            LPLBRN    R               COLHDG('Lawyer Branch')
H001 A                                      REFFLD(SSCOD2)
H001 A            LPLTYP    R               COLHDG('Lawyer Type')
H001 A                                      REFFLD(SSACCT)
H001 A            LPLWST    R               COLHDG('Lawyer Status')
H001 A                                      REFFLD(SSCOD1)
H001 A            LPLWRM    R               COLHDG('Remarks')
H001 A                                      REFFLD(SSDESC)
     A*****************************************************************
     A*
H001 A** PARAMETER TO DEFINE ALL REPOSSESOR DETAILS (LNOPAR)
H001 A*
H001 A            LPRPID    R               COLHDG('Repossessor ID')
H001 A                                      REFFLD(SSCODA)
H001 A            LPRPRF    R               COLHDG('Repossessor Ref. No.')
H001 A                                      REFFLD(SSIDNO)
H001 A            LPRPNM    R               COLHDG('Repossessor Name')
H001 A                                      REFFLD(SSNAML)
H001 A            LPRPST    R               COLHDG('Repossessor Status')
H001 A                                      REFFLD(SSCOD1)
H001 A            LPRRMK    R               COLHDG('Remarks')
H001 A                                      REFFLD(SSDESC)
     A*****************************************************************
     A*
H001 A** PARAMETER TO DEFINE ALL RUNNER DETAILS (LNQPAR)
H001 A*
H001 A            LPRNCD    R               COLHDG('Runner Code')
H001 A                                      REFFLD(SSCODA)
H001 A            LPRNRF    R               COLHDG('Runner Ref. No.')
H001 A                                      REFFLD(SSIDNO)
H001 A            LPRNNM    R               COLHDG('Runner Name')
H001 A                                      REFFLD(SSNAML)
H001 A            LPRNA1    R               COLHDG('Runner' 'Address Line 1')
H001 A                                      REFFLD(SSNAML)
H001 A            LPRNA2    R               COLHDG('Runner' 'Address Line 2')
H001 A                                      REFFLD(SSNAML)
H001 A            LPRNA3    R               COLHDG('Runner' 'Address Line 3')
H001 A                                      REFFLD(SSNAML)
H001 A            LPRNA4    R               COLHDG('Runner' 'Address Line 4')
H001 A                                      REFFLD(SSNAML)
H001 A            LPRNA5    R               COLHDG('Runner' 'Address Line 5')
H001 A                                      REFFLD(SSNAML)
H001 A            LPRNTL    R               COLHDG('Runner' 'Phone')
H001 A                                      REFFLD(SSTELE)
H001 A            LPRDT8    R               COLHDG('Date Of Appointment')
H001 A                                      REFFLD(SSDAT8)
H001 A            LPRNBR    R               COLHDG('Branch Served')
H001 A                                      REFFLD(SSBRAN)
SS12 A            LPACIF    R               COLHDG('Agent Customer' 'Number')
SS12 A                                      REFFLD(SSCIFN)
SS12 A            LPAPLN    R               COLHDG('Type of Amount')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LPAOFF    R               COLHDG('Officer Code')
SS12 A                                      REFFLD(SSCODA)
SS12 A            LPASTS    R               COLHDG('Agent Status')
SS12 A                                      REFFLD(SSCOD2)
H001 A            LPRNRK    R               COLHDG('Remarks')
H001 A                                      REFFLD(SSDESC)
     A*****************************************************************
     A*
H001 A** PARAMETER TO DEFINE REPOSSESOR RATING TABLE (LNUPAR)
H001 A*
H001 A            LPRACD    R               COLHDG('Rating Code')
H001 A                                      REFFLD(SSCODA)
H001 A            LPFRPC    R               COLHDG('From Rating' 'Percentage')
H001 A                                      REFFLD(SSPERD)
H001 A            LPTOPC    R               COLHDG('To Rating' 'Percentage')
H001 A                                      REFFLD(SSPERD)
H001 A            LPRDSC    R               COLHDG('Rating Description')
H001 A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPRLDS    R               COLHDG('Rating Code' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPRSDS    R               COLHDG('Rating Code' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
H001 A** PARAMETER TO DEFINE PROMOTION CODE TABLE (LNWPAR)
H001 A*
H001 A*           LPRCOD    R               COLHDG('Promotion Code')
H001 A*                                     REFFLD(SSCODA)
H001 A*           LPRDES    R               COLHDG('Promotion' 'Description')
H001 A*                                     REFFLD(SSDESM)
H001 A*           LPPROI    R               COLHDG('Promotion' 'Indicator(Y/N)')
H001 A*                                     REFFLD(SSCOD1)
     A***
H001 A** PARAMETER TO DEFINE HIBAH/CASH REWARD PARAMETER TABLE (LNRPAR)
H001 A*
H001 A            LPRTYP    R               COLHDG('Loan' 'Type')
H001 A                                      REFFLD(SSPROD)
H001 A            LPRCTY    R               COLHDG('Currency' 'Type')
H001 A                                      REFFLD(SSCURC)
H001 A            LPRGDY    R               COLHDG('Grace days' 'allowed')
H001 A                                      REFFLD(SSCOU3)
H001 A            LPRWCD    R               COLHDG('Based on' 'working or cal')
H001 A                                      REFFLD(SSCOD1)
H001 A****        LPRGUE    R               COLHDG('Grace until' 'end of month')
H001 A****                                  REFFLD(SSCOU1)
H001 A            LPRCRT    R               COLHDG('Rate' 'Applied-Cust')
H001 A                                      REFFLD(SSPERD)
H001 A            LPRIRT    R               COLHDG('Rate' 'Applied-Inst')
H001 A                                      REFFLD(SSPERD)
H001 A***?        LPRCAL    R               COLHDG('Always calc' 'Incentive')
H001 A***?                                  REFFLD(SSCOU1)
H001 A            LPRPUP    R               COLHDG('Incentive paid' 'upon' -
H001 A                                      'payment')
H001 A                                      REFFLD(SSCOD1)
H001 A            LPRCFQ    R               COLHDG('Payment' 'Frequency-Cust')
H001 A                                      REFFLD(SSCOU3)
H001 A            LPRCPC    R               COLHDG('Payment Code-Cust')
H001 A                                      REFFLD(SSCOD1)
H001 A            LPRIFQ    R               COLHDG('Payment' 'Frequency-Inst')
H001 A                                      REFFLD(SSCOU3)
H001 A            LPRIPC    R               COLHDG('Payment Code-Inst')
H001 A                                      REFFLD(SSCOD1)
H001 A            LPRMTD    R               COLHDG('Incentive Method')
H001 A                                      REFFLD(SSCOU1)
H001 A****        LPRADP    R               COLHDG('Allowed Drop')
H001 A****                                  REFFLD(SSCOU1)
H001 A*
     A*****************************************************************
     A*
     A* FEES PARAMETER FILE - LNXPAR
     A*
     A            LPXCDE    R               COLHDG('Fee Code')
     A                                      REFFLD(SSCOD2)
     A            LPXDSC    R               COLHDG('Fee Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPXLDS    R               COLHDG('Fee Code Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPXSDS    R               COLHDG('Fee Code Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
M006 A            LPXGST    R               COLHDG('Subject to' 'GST')
     A                                      REFFLD(SSCOD1)
     A*****************************************************************
     A*
     A* FEES PARAMETER FILE - LNFPAR
     A*
     A            LPFLNT    R               COLHDG('Loan Type')
     A*V001                                 REFFLD(SSCOD2)
V001 A                                      REFFLD(SSPROD)
     A            LPFCUR    R               COLHDG('Currency')
     A                                      REFFLD(SSCOD4)
R1011A            LPFCAM    R               COLHDG('Campaign Code')
R1011A                                      REFFLD(SSCODA)
     A            LPFCDE    R               COLHDG('Fee Code')
     A                                      REFFLD(SSCOD2)
R1018A            LPFSBU    R               COLHDG('Strategic' 'Business Unit')
R1018A                                      REFFLD(SSCOD4)
R1018A            LPFINV    R               COLHDG('Inovative')
R1018A                                      REFFLD(SSCOD1)
R1018A            LPFCUS    R               COLHDG('Customer Segment')
R1018A                                      REFFLD(SSCOD4)
M006 A            LPFBIL    R               COLHDG('Bill Fee')
M006 A                                      REFFLD(SSCOD1)
     A            LPFAMT    R               COLHDG('Fee Amount')
     A                                      REFFLD(SSAMT4)
M001 A            LPPAMT    R               COLHDG('% on Amount')
M001 A                                      REFFLD(SSAMT4)
M001 A            LPFIND    R               COLHDG('Fee cal' 'Indicator')
M001 A                                      REFFLD(SSCOD1)
M034 A            LPFEAF    R               COLHDG('Earn Additional' 'Day Fee')
M034 A                                      REFFLD(SSCOD1)
M034 A*AM02       LPFMEM    R               COLHDG('Memo posting of fee')
M034 A*AM02                                 REFFLD(SSCOD1)
M006 A            LPFYBS    R               COLHDG('Fee cal' 'Year Base')
M006 A                                      REFFLD(SSCOU1)
     A            LPFPCT    R               COLHDG('Fee Percentage')
     A                                      REFFLD(SSPERD)
R1044A            LPFSTS    R               COLHDG('Fee Charge Status')
R1044A                                      REFFLD(SSCOD1)
R1044A            LPFWVP    R               COLHDG('Fee Waive Percentage')
R1044A                                      REFFLD(SSPERD)
R1044A            LPFWVA    R               COLHDG('Fee Waive Amount')
R1044A                                      REFFLD(SSAMT4)
     A            LPFCHG    R               COLHDG('Charge Type')
     A                                      REFFLD(SSCOD2)
     A            LPFMCO    R               COLHDG('Charge to MO or OC')
     A                                      REFFLD(SSCOD1)
     A            LPFVAT    R               COLHDG('VAT Percentage')
     A                                      REFFLD(SSPERD)
     A            LPFVCH    R               COLHDG('Charge Type')
     A                                      REFFLD(SSCOD2)
     A            LPFVMO    R               COLHDG('Charge to MO or OC')
     A                                      REFFLD(SSCOD1)
     A            LPFSPT    R               COLHDG('Special Tax Percent')
     A                                      REFFLD(SSPERD)
     A            LPFSCH    R               COLHDG('Charge Type')
     A                                      REFFLD(SSCOD2)
     A            LPFSMO    R               COLHDG('Charge to MO or OC')
     A                                      REFFLD(SSCOD1)
     A            LPFTAX    R               COLHDG('Other Tax')
     A                                      REFFLD(SSPERD)
     A            LPFTCH    R               COLHDG('Charge Type')
     A                                      REFFLD(SSCOD2)
     A            LPFTMO    R               COLHDG('Charge to MO or OC')
     A                                      REFFLD(SSCOD1)
     A            LPFMD8    R               COLHDG('Maintenance Date')
     A                                      REFFLD(SSDAT8)
     A            LPFDU8    R               COLHDG('Due Date')
     A                                      REFFLD(SSDAT8)
     A            LPEXP8    R               COLHDG('Expiry Date')
     A                                      REFFLD(SSDAT8)
     A            LPFFRQ    R               COLHDG('Frequency')
     A                                      REFFLD(SSCOU3)
     A            LPFRDM    R               COLHDG('Day(D) or Month(M)')
     A                                      REFFLD(SSCOD1)
     A            LPFMIN    R               COLHDG('Minimum charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
     A            LPFMAX    R               COLHDG('Maximum charge')
     A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LPFDOB    R               COLHDG('Debit online/batch')
OS01 A                                      REFFLD(SSCOD1)
OS01 A            LPFETR    R               COLHDG('Excess Tiered Fee %')
OS01 A                                      REFFLD(SSPERD)
OS01 A            LPFTMN    R               COLHDG('Tiered' 'Minimum charge')
OS01 A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
OS01 A            LPFTMX    R               COLHDG('Tiered' 'Maximum charge')
OS01 A*OS01                                 REFFLD(SSAMT2)
OS01 A                                      REFFLD(SSAMT4)
SS12 A            L1XTX1    R               COLHDG('Other TAX' '% for Juristic')
SS12 A                                      REFFLD(SSPERD)
SS12 A            L1XJCH    R               COLHDG('Charges' 'with Charge Type')
SS12 A                                      REFFLD(SSCOD2)
SS12 A            L1XJMC    R               COLHDG('Charge to Misc/' 'Othchg')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            L1XWHM    R               COLHDG('Min. Amount' 'to Cal. W/H')
SS12 A                                      REFFLD(SSAMT4)
SS13 A            LPEVEN    R               COLHDG('Event Code')
SS13 A                                      REFFLD(SSCOD2)
K0007A            LPFSMC    R               COLHDG('Scheme Code')
K0007A                                      REFFLD(SSCODA)
     A*****************************************************************
     A*
     A*****************************************************************
     A*
     A* LNEPAR - Source of Fund Parameter
     A*
     A*R1002      LPEESF    R               COLHDG('Source' 'of' 'Fund')
     A*R1002                                REFFLD(SSCOD5)
     A*R1002      LPERAT    R               COLHDG('Profit' 'Rate')
     A*R1002                                REFFLD(SSPERD)
     A*R1002      LPEDSC    R               COLHDG('Description')
     A*R1002                                REFFLD(SSDESM)
     A*****************************************************************
     A*
     A* LNTPAR - Detail Type of Fund parameter
     A*
     A*R1002      LPTESF    R               COLHDG('Source' 'of' 'Fund')
     A*R1002                                REFFLD(SSCOD5)
     A*R1002      LPTCOD    R               COLHDG('Detail Type' 'of' 'Fund'  )
     A*R1002                                REFFLD(SSCOD3)
     A*R1002      LPTDSC    R               COLHDG('Description')
     A*R1002                                REFFLD(SSDESM)
     A*****************************************************************
     A*
     A* Scheme number parameter (LNCPAR)
     A*
     A            LPCCOD    R               COLHDG('Scheme number')
     A                                      REFFLD(SSCOD5)
     A            LPCDSC    R               COLHDG('Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPCLDS    R               COLHDG('Scheme Number Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPCSDS    R               COLHDG('Scheme Number Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
     A* Auto Code parameter (LNAPAR) - For bulk release & repayment
     A*
     A            LPAUTO    R               COLHDG('Auto Code')
     A                                      REFFLD(SSCOD3)
     A            LPADSC    R               COLHDG('Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPALDS    R               COLHDG('Auto Code Local' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPASDS    R               COLHDG('Auto Code Short' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
     A*****************************************************************
     A*
     A** COLLECTION STATUS CODE PARAMETER FILE - LNPARG
     A*
     A            LPGCOD    R               COLHDG('Collection' 'Status')
     A                                      REFFLD(SSCOD1)
     A            LPGDES    R               COLHDG('Collection' 'Description')
     A*R1003                                REFFLD(SSDESS)
R1003A                                      REFFLD(SSDESC)
R1003A            LPGLDS    R               COLHDG('Collection Status' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPGSDS    R               COLHDG('Collection Status' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     A            LPGLID    R               COLHDG('Collection' 'Identifier')
     A                                      REFFLD(SSCOD1)
     A*****************************************************************
     A*
     A** COLLECTION LETTER FILE - LNPARH
     A*
     A            LPHNUM    R               COLHDG('Letter' 'Number')
     A                                      REFFLD(SSCOU3)
     A            LPHLIN    R               COLHDG('Letter' 'Line')
     A                                      REFFLD(SSCOU3)
     A            LPHTXT    R               COLHDG('Letter' 'Text')
     A                                      REFFLD(SSMSG2)
     A*****************************************************************
     A*
     A** LOAN COLLECTION PARAMETER FILE - LNPARI
     A*
     A            LPICOL    R               COLHDG('Collect by' 'Officer/Type')
     A                                      REFFLD(SSCOD1)
     A            LPINAC    R               COLHDG('Include' 'Nonaccruals')
     A                                      REFFLD(SSCOD1)
     A            LPINAF    R               COLHDG('Nonaccr' 'Officer')
     A                                      REFFLD(SSOFFC)
     A            LPIPCO    R               COLHDG('Include Part' 'Charge offs')
     A                                      REFFLD(SSCOD1)
     A            LPIPCF    R               COLHDG('Part Chg Off' 'Officer')
     A                                      REFFLD(SSOFFC)
     A            LPICO     R               COLHDG('Include' 'Charge Offs')
     A                                      REFFLD(SSCOD1)
     A            LPICOF    R               COLHDG('Charge Off' 'Officer')
     A                                      REFFLD(SSOFFC)
     A            LPIMAN    R               COLHDG('Allow' 'Manual Add')
     A                                      REFFLD(SSCOD1)
     A            LPITRM    R               COLHDG('Expiration' 'Term')
     A                                      REFFLD(SSCOU1)
     A            LPICIF    R               COLHDG('Allow CIF' 'Changes')
     A                                      REFFLD(SSCOD1)
     A            LPIDFT    R               COLHDG('Default' 'Officer')
     A                                      REFFLD(SSOFFC)
     A            LPIOD     R               COLHDG('Include' 'ODP')
     A                                      REFFLD(SSCOD1)
     A            LPIDD     R               COLHDG('Include' 'DDA')
     A                                      REFFLD(SSCOD1)
     A*****************************************************************
     A*
     A** LOAN TYPE/OFFICER/COLLECTION OFFICER RELATIONSHIPS - LNPARJ
     A*
     A            LPJAPP    R               COLHDG('App' 'Code')
     A                                      REFFLD(SSCOD1)
     A            LPJTYP    R               COLHDG('Account' 'Type')
     A*V001                                 REFFLD(SSCOD2)
V001 A                                      REFFLD(SSCODA)
     A            LPJOFF    R               COLHDG('Account' 'Officer')
     A                                      REFFLD(SSOFFC)
     A            LPJTYX    R               COLHDG('Collection' 'Type')
     A                                      REFFLD(SSCOD1)
     A            LPJCOL    R               COLHDG('Collection' 'Officer')
     A                                      REFFLD(SSOFFC)
     A*****************************************************************
     A*
     A** INVESTOR NAME/ADDRESS PARAMETER FILE - LNPARE
     A*
     A*V001       LEINVN    R               COLHDG('Investor' 'Number')
     A*V001                                 REFFLD(SSCOU3)
     A*V001       LENAME    R               COLHDG('Investor' 'Name')
     A*V001                                 REFFLD(SSNAML)
     A*V001       LEADDR    R               COLHDG('Investor' 'Address')
     A*V001                                 REFFLD(SSNAML)
     A*V001       LECSZP    R               COLHDG('City,State,Zip')
     A*V001                                 REFFLD(SSNAML)
     A*V001       LEPHON    R               COLHDG('Investor' 'Phone')
     A*V001                                 REFFLD(SSTELE)
     A*V001       LEINRG    R               COLHDG('Interest' 'Regardless')
     A*V001                                 REFFLD(SSCOD1)
     A*****************************************************************
HLB  A* HDA Parameter - LNHHDA
     A            LNHSNO    R               COLHDG('Sequence' 'No.')
     A                                      REFFLD(SSCOU2)
     A            LNHDD     R               COLHDG('Disbursement' 'Desc')
     A                                      REFFLD(SSDESA)
     A            LNHPD     R               COLHDG('% of Disbursement')
     A                                      REFFLD(SSPERD)
     A*
H001 A* BNM/CGC PARAMETER
A035 A            CFACCD    R               COLHDG('Fac' 'Code')
A035 A                                      REFFLD(SSCLAS)
     A            CTYPE     R               COLHDG('Loan' 'Type')
     A                                      REFFLD(SSPROD)
     A            CCURTY    R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A            CATYPE    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            CBNIND    R               COLHDG('BNM/CGC' 'Indicator')
     A                                      REFFLD(SSACCT)
     A            CLMAMT    R               COLHDG('Limit' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            CRATE     R               COLHDG('Loan' 'interest rate')
     A                                      REFFLD(SSPERD)
     A            CVARI     R               COLHDG('Variance')
     A                                      REFFLD(SSPERD)
     A            CVCODE    R               COLHDG('Variance' 'Code')
     A                                      REFFLD(SSCOD1)
     A            CPSRT     R               REFFLD(SSCOD2)
     A                                      COLHDG('Prescribed Rate')
H001 A* NO. OF MIA TO INITIALISE SECURITY VALUE
     A*
     A            MTYPE     R               COLHDG('Loan' 'Type')
     A                                      REFFLD(SSPROD)
     A            MCURTY    R               COLHDG('Currency' 'Type')
     A                                      REFFLD(SSCURC)
     A            MMIA      R               COLHDG('No. of months' 'in arrears')
     A                                      REFFLD(SSCOU3)
 |   A* LNSPAR - AUTO-DEBIT FEE FOR COLLATERAL PARAMETER
 |   A            LNSTYP    R               REFFLD(SSCOD2)
 |   A                                      COLHDG('Collateral' 'Auto-Debit' -
 |   A                                             'Type')
 |   A            LNSSEQ    R               REFFLD(SSACCN)
 |   A                                      COLHDG('Auto-debit' 'Seq.No')
 |   A            LNSROT    R               REFFLD(SSCOD1)
 |   A                                      COLHDG('Auto-Debit' 'Roll Type')
 |   A            LNSADV    R               REFFLD(SSCOU3)
 |   A                                      COLHDG('Days To Perform' 'Advance' -
 |   A                                             'Auto-Debit')
A040 A            LNDROT    R               REFFLD(SSCOD1)
A040 A                                      COLHDG('Due Date' 'Roll Type')
 |   A            LNSGLR    R               REFFLD(SSACCN)
 |   A                                      COLHDG('Comm. GL Ref. No')
A033 A            LNCTYP    R               REFFLD(SSCOD2)
A033 A                                      COLHDG('Fee Charge Type')
A033 A            LNOTMC    R               REFFLD(SSCOD1)
A033 A                                      COLHDG('Fee Chrg' 'Oth/Misc')
A033 A            LNSVCT    R               REFFLD(SSCOD2)
A033 A                                      COLHDG('Service' 'Charge' 'Type')
A033 A            LNSVOM    R               REFFLD(SSCOD1)
A033 A                                      COLHDG('Service' 'Chrg To' 'O/M')
A033 A            LNSVCP    R               REFFLD(SSPERD)
A033 A                                      COLHDG('Service Charge(%)')
A033 A*OS01       LNSVCA    R               REFFLD(SSAMT3)
OS01 A            LNSVCA    R               REFFLD(SSAMT4)
A033 A                                      COLHDG('Service Charge(Amt)')
A033 A            LNSSGL    R               REFFLD(SSACCN)
A033 A                                      COLHDG('Serv.Chrg GL Ref. No')
A033 A            LNSIGL    R               REFFLD(SSACCN)
A033 A                                      COLHDG('Net to Ins.Co' -
A033 A                                      'GL Ref. No')
 |   A            LNSDSC    R               REFFLD(SSDESC)
 |   A                                      COLHDG('Description')
 |   A*A033       LNSENP    R               REFFLD(SSPERD)
 |   A*A033                                 COLHDG('Commission Earn(%)')
 |   A*A033       LNSENA    R               REFFLD(SSAMT2)
 |   A*A033                                 COLHDG('Commission Earn(Amt)')
 |   A            LNSPRY    R               REFFLD(SSCOU1)
 |   A                                      COLHDG('Auto-Debit' 'Priority')
 |   A*A033       LNSINC    R               REFFLD(SSCOU3)
 |   A*A033                                 COLHDG('Insurance Co.' 'Code')
 |   A*A033       LNSPKG    R               REFFLD(SSCODA)
 |   A*A033                                 COLHDG('Ins. Package' 'Code')
     A*
     A** RATE TYPE PARAMETER
A015 A            LZCODE    R               COLHDG('RATE' 'TYPE')
A015 A*                                     REFFLD(SSCOD3)
M001 A                                      REFFLD(SSCOD4)
A015 A            LZDESC    R               COLHDG('RATE' 'TYPE' 'DESC')
A015 A                                      REFFLD(SSDESC)
R1003A            LZDLDS    R               COLHDG('Rate Type Local ' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LZDSDS    R               COLHDG('Rate Type Short ' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
      *
A017 A* MASTER PACKAGING PARAMETER - LNMPCK
A017 A            MKRPAC    R               COLHDG('Package Code.')
A017 A                                      REFFLD(SSCOD3)
A017 A            MKPDES    R               COLHDG('Package Descroption')
A017 A*R1003                                REFFLD(SSTELE)
R1003A                                      REFFLD(SSDESC)
R1003A            MKPLDS    R               COLHDG('Package Code Local ' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDESC)
R1003A            MKPSDS    R               COLHDG('Package Code Short ' -
R1003A                                      'Description')
R1003A                                      REFFLD(SSDES2)
A017 A            MKPEF8    R               COLHDG('Package' 'Effective Date 6')
A017 A                                      REFFLD(SSDAT8)
A017 A            MKPEX8    R               COLHDG('Package' 'Expiry Date 6')
A017 A                                      REFFLD(SSDAT8)
A017 A            MKRIND    R               COLHDG('Rate Indicator')
A017 A                                      REFFLD(SSCOD1)
A017 A            MKEIRF    R               COLHDG('Effective' 'Int. Rate From')
A017 A                                      REFFLD(SSCOD2)
A017 A            MKTERM    R               COLHDG('Term')
A017 A                                      REFFLD(SSTU05)
A017 A            MKTCOD    R               COLHDG('Term' 'Code')
A017 A                                      REFFLD(SSCOD1)
      *
A018 A* ALTERNATE RATE SCHEDULE PACKAGING PARAMETER - LNALTP
A018 A            APRPAC    R               COLHDG('Package Code.')
A018 A                                      REFFLD(SSCOD3)
A018 A            APPSEQ    R               COLHDG('Package Sequence No.')
A018 A                                      REFFLD(SSCOU3)
A018 A            APIRTY    R               COLHDG('Interest Rate Type.')
A018 A                                      REFFLD(SSSTA3)
A018 A            APIRTE    R               COLHDG('Interest' 'Rate')
A018 A                                      REFFLD(SSPERD)
A018 A            APMRNO    R               COLHDG('Master Rate No.')
A018 A                                      REFFLD(SSTERM)
A018 A            APVAR     R               COLHDG('Variance')
A018 A                                      REFFLD(SSPERD)
A018 A            APVARC    R               COLHDG('Variance Code')
A018 A                                      REFFLD(SSCOD1)
A018 A            APREF8    R               COLHDG('Rate' 'Effective Date 6')
A018 A                                      REFFLD(SSDAT8)
A018 A            APREX8    R               COLHDG('Rate' 'Expiry Date 6')
A018 A                                      REFFLD(SSDAT8)
A018 A            APPFLR    R               COLHDG('Rate Floor')
A018 A                                      REFFLD(SSPERD)
A018 A            APPCEL    R               COLHDG('Rate Ceiling')
A018 A                                      REFFLD(SSPERD)
A018 A            APTERM    R               COLHDG('Term')
A018 A                                      REFFLD(SSTU05)
A018 A            APTCOD    R               COLHDG('Term' 'Code')
A018 A                                      REFFLD(SSCOD1)
M002 A* Approval Level Parameter - LNPRPC
M002 A            LAAPL     R               COLHDG('Approval Level')
M002 A                                      REFFLD(SSCOD2)
M002 A            LAADSC    R               COLHDG('Approval Lvl' 'Description')
M002 A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LAALDS    R               COLHDG('Approval Level ' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LAASDS    R               COLHDG('Approval Level ' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     *************************************************
CI03 A** LNPRMP - Mode of Payment's GL Account
     *************************************************
     A            LPMMOD    R               COLHDG('Mode of' 'Payment')
     A                                      REFFLD(SSCOD4)
     A            LPMDDS    R               COLHDG('Mode of' 'Payment Desc')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPMLDS    R               COLHDG('Mode of Payment ' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPMSDS    R               COLHDG('Mode of Payment ' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     A            LPMGLN    R               COLHDG('Mode of' 'Payment GL A/C')
     A                                      REFFLD(SSACCN)
     *************************************************
CI03 A** LNPRMQ - Transacting Party Parameter
     *************************************************
     A            LPMTPY    R               COLHDG('Transacting' 'Party')
     A                                      REFFLD(SSDESS)
     A            LPMTDS    R               COLHDG('Transacting' 'Party Desc')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPMTLD    R               COLHDG('Transacting Party ' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPMTSD    R               COLHDG('Transacting Party ' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     A            LPMTGL    R               COLHDG('Transacting' 'Party GL A/C')
     A                                      REFFLD(SSACCN)
CI17 A            LPMTCC    R               COLHDG('Cost' 'Center')
CI17 A                                      REFFLD(SSCOU5)
CI17 A*R1031      LPMTPC    R               COLHDG('Product' 'Code')
R1031A            LPMTPC    R               COLHDG('Category' 'Code')
CI17 A                                      REFFLD(SSCOU5)
     *************************************************
CI11 ** LNPRML    - Lender Parameter
     *************************************************
     A            LPLCOD    R               COLHDG('Lender' 'Code')
     A*R1020                                REFFLD(SSCOU3)
R1020A                                      REFFLD(SSTLLL)
     A            LPLCIF    R               COLHDG('Lender' 'CIF Number')
     A                                      REFFLD(SSCIFN)
     A            LPLSNM    R               COLHDG('Lender' 'Short Name')
     A                                      REFFLD(SSNAMS)
CS001A            LPLMLP    R               COLHDG('Main Account' 'Loan Type')
CS001A                                      REFFLD(SSPROD)
CS001A            LPLTLP    R               COLHDG('Tranch Account' 'Loan Type')
CS001A                                      REFFLD(SSPROD)
M032 A            LPLBGL    R               COLHDG('Bank as Lender &' 'Post -
M032 A                                      GL')
M032 A                                      REFFLD(SSCOD1)
M032 A            LPFRTB    R               COLHDG('Fronting Bank')
M032 A                                      REFFLD(SSCOD1)
     *************************************************
CS04 ** LNPRMT    - Syndication Intermediary/Remitting Bank
     *************************************************
     A            LPRIRB    R               COLHDG('Intermediary' '/Remitting -
     A                                      Bank')
     A                                      REFFLD(SSDESS)
     A            LPRIDS    R               COLHDG('Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPRILD    R               COLHDG('Intermediary' '/Remitting -
R1003A                                      Bank' 'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPRISD    R               COLHDG('Intermediary' '/Remitting -
R1003A                                      Bank' 'Short Description')
R1003A                                      REFFLD(SSDES2)
     *************************************************
M007 ** Tiered Penalty Interest Parameter File - LNPR6T
M007 *************************************************
M007 A            LT6TYP    R               COLHDG('Penalty Int' 'Type')
M007 A                                      REFFLD(SSCOU3)
M007 A            LT6SEQ    R               COLHDG('Sequence')
M007 A                                      REFFLD(SSCOU3)
M007 A            LT6DAY    R               COLHDG('Overdue' 'Days')
M007 A                                      REFFLD(SSCOU3)
M007 A            LT6MON    R               COLHDG('Overdue' 'Month')
M007 A                                      REFFLD(SSCOU3)
M007 A            LT6PCT    R               COLHDG('Percent of' 'Payment')
M007 A                                      REFFLD(SSPERD)
M007 *************************************************
M008 A* LNPARO - Classification Reason Code
     A            LCCODE    R               COLHDG('Classification' 'Code')
     A*R1048                                REFFLD(SSCOD4)
R1048A                                      REFFLD(SSCOD6)
     A            LCDESC    R               COLHDG('Classification' 'Desc')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LCDLDS    R               COLHDG('Classification' 'Code -
R1003A                                      Local' ' Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LCDSDS    R               COLHDG('Classification' 'Code -
R1003A                                      Short' ' Description')
R1003A                                      REFFLD(SSDES2)
     *************************************************
M013 ** LNPRMR    - Lender Rate Type Parameter
     *************************************************
     A*R1011      LRRTYP    R               COLHDG('Lender Rate' 'Type')
R1011A            LRRTYP    R               COLHDG('Rate' 'Type')
     A                                      REFFLD(SSCOD5)
     A            LRRDES    R               COLHDG('Description')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LRRLDS    R               COLHDG('Rate Type ' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LRRSDS    R               COLHDG('Rate Type ' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
M011 A*****************************************************************
M011 ** LNPRMS -  SYNDICATION TYPE PARAMETER
M011 ******************************************************************
M011 A            LPSTYP    R               COLHDG('Syndicated' 'Type')
M011 A                                      REFFLD(SSCOD2)
M011 A            LPSDES    R               COLHDG('Description')
M011 A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LCSTLD    R               COLHDG('Syndicated' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPSTSD    R               COLHDG('Syndicated' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     *************************************************
M011 ** CREDIT RATING PARAMETER - (LNZPAR)
     *************************************************
M011 A*           LZRCOD    R               COLHDG('Credit Rating Code')
M011 A*                                     REFFLD(SSCOD6)
M011 A*           LZRDSC    R               COLHDG('Credit Rating''Desc')
M011 A*                                     REFFLD(SSDESM)
     ** Customer Hotline Contact - LNPARM
M030 A            LMBKN     R               COLHDG('Bank Number')
M030 A                                      REFFLD(SSBANK)
M025 A            LMRPID    R               COLHDG('Report ID')
M025 A                                      REFFLD(SSCODA)
M025 A            LMNAME    R               COLHDG('Hotline' 'Centre Name')
M025 A                                      REFFLD(SSNAML)
M025 A            LMADD1    R               COLHDG('Hotline' 'Address 1')
M025 A                                      REFFLD(SSDESM)
M025 A            LMADD2    R               COLHDG('Hotline' 'Address 2')
M025 A                                      REFFLD(SSDESM)
M025 A            LMADD3    R               COLHDG('Hotline' 'Address 3')
M025 A                                      REFFLD(SSDESM)
M025 A            LMTELN    R               COLHDG('Hotline' 'Tel No')
M025 A                                      REFFLD(SSDES1)
M025 A            LMEXT1    R               COLHDG('Hotline' 'Extn No. 1')
M025 A                                      REFFLD(SSCOD5)
M025 A            LMEXT2    R               COLHDG('Hotline' 'Extn No. 2')
M025 A                                      REFFLD(SSCOD5)
M025 A            LMCNP1    R               COLHDG('Hotline Contact' 'Person 1')
M025 A                                      REFFLD(SSACGC)
M025 A            LMCNP2    R               COLHDG('Hotline Contact' 'Person 2')
M025 A                                      REFFLD(SSACGC)
M025 A            LMFAXN    R               COLHDG('Hotline' 'Fax No.')
M025 A                                      REFFLD(SSDES1)
M034 *************************************************
     ** BANK GUARANTEE TYPE                    - LNPRBG
     *************************************************
     A            LBBGTP    R               COLHDG('Bank Guarantee' 'type')
     A                                      REFFLD(SSCOD2)
     A            LBBGDS    R               COLHDG('Bank Guarantee' 'desc')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LBBGLD    R               COLHDG('Bank Guarantee ' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LBBGSD    R               COLHDG('Bank Guarantee ' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     A            LBBGCF    R               COLHDG('Conversion Factor')
     A                                      REFFLD(SSPERD)
     *************************************************
AM01 ** Repayment source code parameter        - LNPRRS
     *************************************************
     A*           LRSCOD    R               COLHDG('Repayment Source' 'Code')
     A*                                     REFFLD(SSCOD2)
     A*           LRSDSC    R               COLHDG('Repayment Source' 'Desc')
     A*                                     REFFLD(SSDESM)
     *************************************************
AM01 ** Archieve Reason Code Parameter                - LNPRAR
     *************************************************
     A            LARSTS    R               COLHDG('Archive Reason Code')
     A                                      REFFLD(SSCOD2)
     A            LARRSC    R               COLHDG('Archive Reason Desc')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LARRLD    R               COLHDG('Archive Reason' 'Code ' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LARRSD    R               COLHDG('Archive Reason' 'Code ' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     *************************************************
AM03 ** LNPRRM    - Remiting Bank Parameter
     *************************************************
     A            LPKCUR    R               COLHDG('Currency Type')
     A                                      REFFLD(SSCURC)
     A            LPKBNN    R               COLHDG('Bank Name')
     A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LPKLDS    R               COLHDG('Bank Name ' -
R1003A                                      'Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPKSDS    R               COLHDG('Bank Name ' -
R1003A                                      'Short Description')
R1003A                                      REFFLD(SSDES2)
     A            LPKACN    R               COLHDG('Account No')
     A                                      REFFLD(SSDESS)
     A            LPKAD1    R               COLHDG('Address Line 1')
     A                                      REFFLD(SSDESM)
     A            LPKAD2    R               COLHDG('Address Line 2')
     A                                      REFFLD(SSDESM)
     A            LPKCOT    R               COLHDG('Cut Off Time')
     A                                      REFFLD(SSTIM6)
     *************************************************
     ** LNPRTC - CO Priority batch Number defintion
     *************************************************
     A            LPCNUM    R               COLHDG('CO Priority' 'Batch Number')
     A                                      REFFLD(SSCOD1)
     A            LPCNDS    R               COLHDG('Description')
     A                                      REFFLD(SSDESC)
R1003A            LPCNLD    R               COLHDG('Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPCNSD    R               COLHDG('Short Description')
R1003A                                      REFFLD(SSDES2)
OS04 A            LPCCHG    R               COLHDG('Bank Charges income')
OS04 A                                      REFFLD(SSAMT4)
OS04 A            LPCGLA    R               COLHDG('GL Account No')
OS04 A                                      REFFLD(SSACGL)
OS05 A            LPCMOC    R               COLHDG('Misc/Oth' 'Charge')
OS05 A                                      REFFLD(SSCOD1)
OS05 A            LPCMOT    R               COLHDG('Misc/Oth' 'Charge Type')
OS05 A                                      REFFLD(SSCOD2)
OS06 *************************************************
OS06 ** LNPRTD - Location Parameter
OS06 *************************************************
OS06 A            LPLOCD    R               COLHDG('Location Code')
OS06 A                                      REFFLD(SSCOD3)
OS06 A            LPLODS    R               COLHDG('Description')
OS06 A                                      REFFLD(SSDESC)
R1003A            LPLCLD    R               COLHDG('Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LPLCSD    R               COLHDG('Short Description')
R1003A                                      REFFLD(SSDES2)
OS06 A            LPLOGL    R               COLHDG('GL Account No')
OS06 A                                      REFFLD(SSACGL)
     A*****************************************************************
     A* LNPRTS - CO Priority Batch Number Status
     A*****************************************************************
     A            LPCDT8    R               COLHDG('Date 6')
     A                                      REFFLD(SSDAT8)
     A            LPCSTS    R               COLHDG('Batch Status')
     A                                      REFFLD(SSCOD1)
     A*****************************************************************
SS01 A* HP Salesman Code Parameter (LNPSAL)
SS01 A            LMSMCG    R               COLHDG('Salesman code')
SS01 A*R1012                                REFFLD(SSCODB)
R1012A                                      REFFLD(SSCODA)
SS01 A            LMSTSD    R               COLHDG('Salesman Status')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            LMSSD8    R               COLHDG('Status Date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A            LMSMND    R               COLHDG('Salesman Name')
SS01 A                                      REFFLD(SSNAML)
SS01 A            LMSCIF    R               COLHDG('Salesman CIF No')
SS01 A                                      REFFLD(SSCIFN)
SS01 A            LMSASQ    R               COLHDG('Salesman Address' 'Seq #')
SS01 A                                      REFFLD(SSCOU5)
SS01 A            LMSDLC    R               COLHDG('Dealer code')
SS01 A*R1012                                REFFLD(SSCOUB)
R1012A                                      REFFLD(SSCODA)
SS01 A            LMSMID    R               COLHDG('ID Number')
SS01 A                                      REFFLD(SSIDNO)
SS01 A            LMSIDC    R               COLHDG('ID Type')
SS01 A                                      REFFLD(SSIDNT)
SS01 A            LMSAD1    R               COLHDG('Salesman Address #1')
SS01 A                                      REFFLD(SSDESM)
SS01 A            LMSAD2    R               COLHDG('Salesman Address #2')
SS01 A                                      REFFLD(SSDESM)
SS01 A            LMSAD3    R               COLHDG('Salesman Address #3')
SS01 A                                      REFFLD(SSDESM)
SS01 A            LMSAD4    R               COLHDG('Salesman Address #4')
SS01 A                                      REFFLD(SSDESM)
SS01 A            LMSCN1    R               COLHDG('Salesman Contact #1')
SS01 A                                      REFFLD(SSTELE)
SS01 A            LMSCN2    R               COLHDG('Salesman Contact #2')
SS01 A                                      REFFLD(SSTELE)
SS01 A            LMSCN3    R               COLHDG('Salesman Contact #3')
SS01 A                                      REFFLD(SSTELE)
SS01 A            LMSCN4    R               COLHDG('Salesman Contact #4')
SS01 A                                      REFFLD(SSTELE)
SS01 A            LMSEID    R               COLHDG('Salesman Email-ID')
SS01 A                                      REFFLD(SSDES1)
SS01 A            LMSFAX    R               COLHDG('Comm Invoice No')
SS01 A                                      REFFLD(SSDESS)
SS01 A            LMSCRT    R               COLHDG('Salesman Commission' 'Rate')
SS01 A                                      REFFLD(SSPERD)
SS01 A            LMGSTN    R               COLHDG('GST Registered' 'Number')
SS01 A                                      REFFLD(SSCODF)
SS01 A            LMCOMF    R               COLHDG('Commission Flag')
SS01 A                                      REFFLD(SSYON )
SS01 A            LMMTDA    R               COLHDG('MTD Commission Amt')
SS01 A                                      REFFLD(SSAMT4)
SS01 A            LMYTDA    R               COLHDG('YTD Commission Amt')
SS01 A                                      REFFLD(SSAMT4)
SS01 A            LMLTDA    R               COLHDG('LTD Commission Amt')
SS01 A                                      REFFLD(SSAMT4)
SS01 A            LMMTDP    R               COLHDG('MTD Commission Paid')
SS01 A                                      REFFLD(SSAMT4)
SS01 A            LMYTDP    R               COLHDG('YTD Commission Paid')
SS01 A                                      REFFLD(SSAMT4)
SS01 A            LMLTDP    R               COLHDG('LTD Commission Paid')
SS01 A                                      REFFLD(SSAMT4)
SS01 A            LMRMK1    R               COLHDG('Salesman Remark 1')
SS01 A                                      REFFLD(SSDESC)
SS01 A            LMRMK2    R               COLHDG('Salesman Remark 2')
SS01 A                                      REFFLD(SSDESC)
SS01 A* Commission Scheme Code Parameter (LNCOMH)
SS01 A            LCHSC     R               COLHDG('Comm Scheme Code')
SS01 A                                      REFFLD(SSCOD5)
SS01 A            LCHDES    R               COLHDG('Description')
SS01 A                                      REFFLD(SSDESM)
SS01 A            LCHCR8    R               COLHDG('Record creation date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A            LCHED8    R               COLHDG('Expiry date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A            LCDEDR    R               COLHDG('Subj to Dealer Comm' +
SS01 A                                               'Amortization')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            LCDESD    R               COLHDG('Subj to Sub-Dealer' +
SS01 A                                               'Comm Amortization')
SS01 A                                      REFFLD(SSCOD1)
SS01 A            LCDESM    R               COLHDG('Subj to Salesman' +
SS01 A                                               'Comm Amortization')
SS01 A                                      REFFLD(SSCOD1)
SS12 A            LCBCHG    R               COLHDG('Dealer Comm. VAT' +
SS12 A                                               'Charge Type')
SS12 A                                      REFFLD(SSCOD2)
SS12 A            LCBMCO    R               COLHDG('Dealer Comm. VAT' +
SS12 A                                               'Charge to MC/OC')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LCBCH1    R               COLHDG('S.Dealer Comm. VAT' +
SS12 A                                               'Charge Type')
SS12 A                                      REFFLD(SSCOD2)
SS12 A            LCBMC1    R               COLHDG('S.Dealer Comm. VAT' +
SS12 A                                               'Charge to MC/OC')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LCBCH2    R               COLHDG('Salesman Comm. VAT' +
SS12 A                                               'Charge Type')
SS12 A                                      REFFLD(SSCOD2)
SS12 A            LCBMC2    R               COLHDG('Salesman Comm. VAT' +
SS12 A                                               'Charge to MC/OC')
SS12 A                                      REFFLD(SSCOD1)
SS01 A            LCHLM8    R               COLHDG('Last Maintenance' 'Date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A* Loan Commission Scheme - Tier Rate Parameter (LNCOMD)
SS01 A            LCDSC     R               COLHDG('Comm Scheme Code')
SS01 A                                      REFFLD(SSCOD5)
SS01 A            LCDTRM    R               COLHDG('Loan Tenor in months')
SS01 A                                      REFFLD(SSCOU5)
SS01 A            LCDDLR    R               COLHDG('Dealer Rate')
SS01 A                                      REFFLD(SSPERD)
SS01 A            LCDDFA    R               COLHDG('Dealer Fixed Amt')
SS01 A                                      REFFLD(SSAMT4)
SS01 A            LCDSDR    R               COLHDG('Sub-Dealer Rate')
SS01 A                                      REFFLD(SSPERD)
SS01 A            LCDSDF    R               COLHDG('Sub-Dealer Fixed Amt')
SS01 A                                      REFFLD(SSAMT4)
SS01 A            LCDSMR    R               COLHDG('Salesman Rate')
SS01 A                                      REFFLD(SSPERD)
SS01 A            LCDSFA    R               COLHDG('Salesman Fixed Amt')
SS01 A                                      REFFLD(SSAMT4)
SS12 A            LCCDES    R               COLHDG('Commission Desc.')
SS12 A                                      REFFLD(SSDESM)
SS01 A            LCDCD8    R               COLHDG('Creation Date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A            LCDLM8    R               COLHDG('Last Maintenance' 'Date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A* Dealer & Commission Scheme Relationship Parameter (LNDCOM)
SS01 A            LDCDC     R               COLHDG('Dealer Code')
SS01 A*R1012                                REFFLD(SSCOUB)
R1012A                                      REFFLD(SSCODA)
SS01 A            LDCCC     R               COLHDG('Commission Scheme' 'Code')
SS01 A                                      REFFLD(SSCOD5)
SS01 A            LDCCD8    R               COLHDG('Creation Date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A            LDCLM8    R               COLHDG('Last Maintenance' 'Date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A* HP E-Filling Loan Group Parameter (LNEFIL)
SS01 A            LECODE    R               COLHDG('E-Filling Grp Code')
SS01 A                                      REFFLD(SSCOD2)
SS01 A            LELGRP    R               COLHDG('Loan Group')
SS01 A                                      REFFLD(SSCOU3)
     A*****************************************************************
     A** LOAN DEALER PARAMETER FILE - LNDEAL
     A            LDLNUM    R               COLHDG('Dealer' 'Number')
H001 A*R1012                                REFFLD(SSCOUB)
R1012A                                      REFFLD(SSCODA)
     A            LDNAME    R               COLHDG('Dealer' 'Name')
     A                                      REFFLD(SSNAML)
     A            LDSNM     R               COLHDG('Dealer Short' 'Name')
     A                                      REFFLD(SSNAMS)
     A            LDFSNM    R               REFFLD(SSNAMS)
     A                                      COLHDG('Formatted' 'short name')
     A            LDCIFN    R               COLHDG('Dealer' 'CIF Number')
     A                                      REFFLD(SSCIFN)
     A            LDADDR    R               COLHDG('Dealer' 'Address Line 1')
     A                                      REFFLD(SSNAML)
     A            LDCTST    R               COLHDG('Dealer' 'Address Line 2')
     A                                      REFFLD(SSNAML)
     A            LDCOUN    R               COLHDG('Dealer' 'Address Line 3')
     A                                      REFFLD(SSNAML)
     A            LDFONE    R               COLHDG('Dealer' 'Phone')
     A                                      REFFLD(SSTELE)
     A            LDFON2    R               COLHDG('Dealer' 'Phone 2')
     A                                      REFFLD(SSTELE)
     A*R1001      LDLIMT    R               COLHDG('Dealer' 'limit')
R1001A            LDDLMT    R               COLHDG('Dealer' 'limit')
     A                                      REFFLD(SSAMT4)
     A            LDRAMT    R               COLHDG('Dealer' 'Reserve' 'Amount')
     A                                      REFFLD(SSAMT4)
     A            LDUAMT    R               COLHDG('Dealer' 'Amount' 'Utilised')
     A                                      REFFLD(SSAMT4)
     A            LDTYPE    R               COLHDG('Dealer' 'Plan')
     A                                      REFFLD(SSCOD1)
     A            LDGRUP    R               COLHDG('Dealer' 'group')
H001 A*                                     REFFLD(SSCOU3)
H001 A                                      REFFLD(SSCODA)
     A            LDSCHD    R               COLHDG('Schedule' 'Non-Schedule')
     A                                      REFFLD(SSCOD1)
     A            LDORAT    R               COLHDG('Overdue' 'Interest Rate')
     A                                      REFFLD(SSPERD)
     A            LDOFFR    R               COLHDG('Officer' 'Code')
     A                                      REFFLD(SSOFFC)
     A            LDEXP8    R               COLHDG('Dealer' 'Expiry Date')
     A                                      REFFLD(SSDAT8)
     A            LDREVL    R               COLHDG('Revolving' 'Non-Revolving')
     A                                      REFFLD(SSCOD1)
     A            LDACCP    R               COLHDG('Dealer Accrual' 'percent')
     A                                      REFFLD(SSPERD)
     A            LDSTAT    R               COLHDG('Dealer' 'status')
     A                                      REFFLD(SSCOD2)
A011 A            LDRVD8    R               COLHDG('Dealer Review Date')
A011 A                                      REFFLD(SSDAT8)
H001 A            LDRDT8    R               COLHDG('Date Recruited')
H001 A                                      REFFLD(SSDAT8)
H001 A            LDMIDY    R               COLHDG('Min Int Days')
H001 A                                      REFFLD(SSCOU3)
H001 A            LDSUBD    R               COLHDG('Int Subsidy' 'Days')
H001 A                                      REFFLD(SSCOU3)
H001 A            LDBRSV    R               COLHDG('Branch' 'Served')
H001 A                                      REFFLD(SSBRAN)
H001 A            LDPGRP    R               COLHDG('Product' 'Group')
H001 A                                      REFFLD(SSCOD2)
H001 A            LDGVAL    R               COLHDG('Gross Development' 'Value')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDGCOS    R               COLHDG('Gross Development' 'Cost')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDSECV    R               COLHDG('Security' 'Value')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDUFBR    R               COLHDG('Undertaking Limit' ' - FBR')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDUFBT    R               COLHDG('Undertaking Limit' ' - FBT')
H001 A                                      REFFLD(SSAMT4)
H001 A            LDRCOD    R               COLHDG('Recond')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDUSED    R               COLHDG('Used')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDNEW     R               COLHDG('New')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDNNAT    R               COLHDG('New National')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDSTA2    R               COLHDG('Dealer' 'Status')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDSTA8    R               COLHDG('Dealer' 'Status Date')
H001 A                                      REFFLD(SSDAT8)
H001 A            LDRSCH    R               COLHDG('Rescheduled' 'Ind')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDDRAT    R               COLHDG('Delinquency' 'Rate')
H001 A                                      REFFLD(SSPERD)
H001 A            LDFSMB    R               COLHDG('FIS' 'Member' '(Y/N)')
H001 A                                      REFFLD(SSCOD1)
H001 A            LDFSDC    R               COLHDG('FIS' 'Dealer' 'Code')
H001 A                                      REFFLD(SSCODA)
H001 A            LDREMK    R               COLHDG('Remarks')
H001 A                                      REFFLD(SSDESC)
M006 A            LDCART    R               COLHDG('CAR' 'Type')
M006 A                                      REFFLD(SSCOD1)
SS07 A            LDBKSV    R               COLHDG('Bank' 'Served')
SS07 A                                      REFFLD(SSBANK)
SS07 A            LDDRGL    R               COLHDG('Settlement' 'Debit GL')
SS07 A                                      REFFLD(SSACGL)
SS07 A            LDCRGL    R               COLHDG('Settlement' 'Credit GL')
SS07 A                                      REFFLD(SSACGL)
SS07 A            LDSCYC    R               COLHDG('Settlement' 'Cycle')
SS07 A                                      REFFLD(SSTERM)
SS07 A            LDSBNK    R               COLHDG('Settlement' 'Bank')
SS07 A                                      REFFLD(SSNAML)
SS07 A            LDSBAC    R               COLHDG('Settlement' 'Bank Account')
SS07 A                                      REFFLD(SSNAMS)
SS07 A            LDMTDA    R               COLHDG('Month to Date' 'Approved')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDMTDR    R               COLHDG('Month to Date' 'Rejected')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDMTDC    R               COLHDG('Month to Date' 'Cancelled')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDYTDA    R               COLHDG('Year to Date' 'Approved')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDYTDR    R               COLHDG('Year to Date' 'Rejected')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDYTDC    R               COLHDG('Year to Date' 'Cancelled')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDLTDA    R               COLHDG('Life to Date' 'Approved')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDLTDR    R               COLHDG('Life to Date' 'Rejected')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDLTDC    R               COLHDG('Life to Date' 'Cancelled')
SS07 A                                      REFFLD(SSAMT4)
SS07 A            LDPSTL    R               COLHDG('Total Past Due' 'Loan')
SS07 A                                      REFFLD(SSAMT4)
SS12 A            LDDTYP    R               COLHDG('Dealer Type')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDMDLR    R               COLHDG('Main Dealer Number')
SS12 A*R1012                                REFFLD(SSCOUB)
R1012A                                      REFFLD(SSCODA)
SS12 A            LDADRS    R               COLHDG('Dealer Address Seq #')
SS12 A                                      REFFLD(SSCOU5)
SS12 A            LDINN1    R               COLHDG('Insurance Co. No 1')
SS12 A                                      REFFLD(SSCOU3)
SS12 A            LDTPC1    R               COLHDG('Type of Coverage ' +
SS12 A                                                'Co Ins# 1')
SS12 A                                      REFFLD(SSDESS)
SS12 A            LDPOL1    R               COLHDG('Policy No Co Ins# 1#')
SS12 A                                      REFFLD(SSDESS)
SS12 A            LDC1SI    R               COLHDG('Amount Insured ' +
SS12 A                                                'Co Ins# 1')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDC1D8    R               COLHDG('Ins Exp date' 'Co ins# 1')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDINN2    R               COLHDG('Insurance Co. No 2 #')
SS12 A                                      REFFLD(SSCOU3)
SS12 A            LDTPC2    R               COLHDG('Type of Coverage ' +
SS12 A                                                'Co Ins# 2')
SS12 A                                      REFFLD(SSDESS)
SS12 A            LDPOL2    R               COLHDG('Policy No Co Ins# 2#')
SS12 A                                      REFFLD(SSDESS)
SS12 A            LDC2SI    R               COLHDG('Amount Insured' 'Co ins# 2')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDC2D8    R               COLHDG('Ins Exp date' 'Co ins# 2')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDOSPR    R               COLHDG('O/S Pure' 'Principal Amt')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDOSBL    R               COLHDG('Outstanding Balance')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDCBAL    R               COLHDG('O/S Current Balance')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDACRI    R               COLHDG('O/S Accrue Interest')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDLCD7    R               COLHDG('O/S Late Charges')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDOCD7    R               COLHDG('O/S Other Charges')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDMCD7    R               COLHDG('O/S Misc Charges')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDMEXR    R               COLHDG('Max Excess ' +
SS12 A                                                'Credit Limit in %')
SS12 A                                      REFFLD(SSPERD)
SS12 A            LDMCRL    R               COLHDG('Max Excess' 'Credit Limit')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDGSTN    R               COLHDG('Dealer GST' 'Reg No')
SS12 A                                      REFFLD(SSCODF)
SS12 A            LDPINS    R               COLHDG('Print Ins' 'Letter Ind')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDCOMF    R               COLHDG('Commission Flag')
SS12 A                                      REFFLD(SSCOD1)
SS12 A            LDDLD8    R               COLHDG('Dealer Limit' 'Eff date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDLEX8    R               COLHDG('Last Excess date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDLFM8    R               COLHDG('Last Maintenance' 'Date')
SS12 A                                      REFFLD(SSDAT8)
SS12 A            LDMCOM    R               COLHDG('MTD -Commission Amts')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDYCOM    R               COLHDG('YTD -Commission Amts')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDLCOM    R               COLHDG('LTD -Commission Amts')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDMTDX    R               COLHDG('MTD -Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDYTDX    R               COLHDG('YTD -Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDLTDX    R               COLHDG('LTD -Commission Paid')
SS12 A                                      REFFLD(SSAMT4)
SS12 A            LDCDPY    R               COLHDG('Commission Due' '& Payable')
SS12 A                                      REFFLD(SSAMT4)
     A** Pricing Package Parameter - Header - LNPRPP
SS04 A            CSPCOD    R               COLHDG('Campaign' 'Code')
SS04 A*R1004                                REFFLD(SSCOD3)
R1004A                                      REFFLD(SSCODA)
SS04 A            CSPDSC    R               COLHDG('Campaign Description')
SS04 A*R1004                                REFFLD(SSDESM)
R1004A                                      REFFLD(SSDESC)
R1004A            CSPLDS    R               COLHDG('Campaign Local' -
R1004A                                      'Description')
R1004A                                      REFFLD(SSDESC)
R1004A            CSPSDS    R               COLHDG('Campaign Short' -
R1004A                                      'Description')
R1004A                                      REFFLD(SSDES2)
R1003A*R1004      LSPLDS    R               COLHDG('Local Description')
R1003A*R1004                                REFFLD(SSDESC)
R1003A*R1004      LSPSDS    R               COLHDG('Short Description')
R1003A*R1004                                REFFLD(SSDES2)
SS04 A*R1004      LSPRAT    R               COLHDG('Aggregate Rate')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSPFRQ    R               COLHDG('Aggregate Freq')
SS04 A*R1004                                REFFLD(SSCOU3)
SS04 A*R1004      LSPFCD    R               COLHDG('Aggregate Freq Code')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSLOTR    R               COLHDG('Term from L/O Date')
SS04 A*R1004                                REFFLD(SSTERM)
SS04 A*R1004      LSLOTC    R               COLHDG('Term Code from' 'L/O Date')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSRIND    R               COLHDG('Effective Rate' 'Indicator')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSEXD8    R               COLHDG('Expire Date 6')
SS04 A*R1004                                REFFLD(SSDAT8)
SS04 A*R1004      LSILON    R               COLHDG('Subj Int' 'In Lieu of ntc')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSPTRM    R               COLHDG('Partial Prepymt' 'Ntc term')
SS04 A*R1004                                REFFLD(SSCOU3)
SS04 A*R1004      LSPTCD    R               COLHDG('Partial Ppymt' 'Ntc trm cd')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSETRM    R               COLHDG('Early Settle' 'Ntc Term')
SS04 A*R1004                                REFFLD(SSCOU3)
SS04 A*R1004      LSETCD    R               COLHDG('Early Settle' 'Ntc trm Cd')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSPREP    R               COLHDG('Subject to' 'Prepymt Fees')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSPPP1    R               COLHDG('PP - Fixed Amount')
SS04 A*R1004                                REFFLD(SSAMT4)
SS04 A*R1004      LSPPP2    R               COLHDG('PP - % Amount repaid')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSPPP3    R               COLHDG('PP-% Original' 'Commitment')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSPPP4    R               COLHDG('PP-% Based on' 'Unexp Dur')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSESP1    R               COLHDG('ES - Fixed Amount')
SS04 A*R1004                                REFFLD(SSAMT4)
SS04 A*R1004      LSESP2    R               COLHDG('ES - % Amount Repaid')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSESP3    R               COLHDG('ES-% Original' 'Commitment')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSESP4    R               COLHDG('ES-% Based on' 'Unexp Dur')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSPWXM    R               COLHDG('Calc Prepymt' 'if Partial-
SS04 A*R1004                                Prepymt' 'within XXX momths')
SS04 A*R1004                                REFFLD(SSCOU3)
SS04 A*R1004      LSPIND    R               COLHDG('Commencement' 'of Prepaymen-
SS04 A*R1004                                t' 'Indicator')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSEWXM    R               COLHDG('Calc Prepymt' 'if E/Sett-
SS04 A*R1004                                within' 'XXX months')
SS04 A*R1004                                REFFLD(SSCOU3)
SS04 A*R1004      LSEIND    R               COLHDG('Commencement' 'of E/Sett-
SS04 A*R1004                                Indicator')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSCANC    R               COLHDG('Subj to' 'Cancellation Fee')
SS04 A*R1004                                REFFLD(SSCOD1)
SS04 A*R1004      LSCAN1    R               COLHDG('% on unutilized' 'when -
SS04 A*R1004                                schedule' 'expired')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSCAN2    R               COLHDG('% on unutilized' 'upon -
SS04 A*R1004                                payoff')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSCAN3    R               COLHDG('% on unexpired' 'duration -
SS04 A*R1004                                upon payoff')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSCAN4    R               COLHDG('% on unutilized' 'when -
SS04 A*R1004                                available' 'expired')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSCAN5    R               COLHDG('% on unexpired' 'duration -
SS04 A*R1004                                when' 'available expired')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSCRTN    R               COLHDG('Commitment Fee' 'Rate No.')
SS04 A*R1004                                REFFLD(SSRATE)
SS04 A*R1004      LSCOMR    R               COLHDG('Commitment Fee Rate')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSPCLA    R               COLHDG('Minimum usage' 'limit' -
SS04 A*R1004                                '(% of commitment)')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSPCUD    R               COLHDG('% of total undrawn')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSUDR1    R               COLHDG('Undrawn Lmt' 'Excess Rate')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSUDR2    R               COLHDG('Undrawn Rt if' 'above lmt')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSFPR9    R               COLHDG('E/S - % on Interest' 'Reba-
SS04 A*R1004                                te Clawback')
SS04 A*R1004                                REFFLD(SSPERD)
SS04 A*R1004      LSRCFL    R               COLHDG('Calc Rebate' 'Clawback if-
SS04 A*R1004                                PO within')
SS04 A*R1004                                REFFLD(SSCOU3)
SS05 A*R1004      LSPDS1    R               COLHDG('Description 1')
SS05 A*R1004                                REFFLD(SSDESM)
SS05 A*R1004      LSPDS2    R               COLHDG('Description 2')
SS05 A*R1004                                REFFLD(SSDESM)
SS05 A*R1004      LSPDS3    R               COLHDG('Description 3')
SS05 A*R1004                                REFFLD(SSDESM)
R1004A            CSEFF8    R               COLHDG('Effective Date')
R1004A                                      REFFLD(SSDAT8)
R1004A            CSEXD8    R               COLHDG('Expiry Date')
R1004A                                      REFFLD(SSDAT8)
R1004A*R1033      LSMTRM    R               COLHDG('Maximum Term')
R1004A*R1033                                REFFLD(SSTERM)
R1004A*R1033      LSMTCD    R               COLHDG('Maximum Term Code')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSMITR    R               COLHDG('Minimum Term')
R1004A*R1033                                REFFLD(SSTERM)
R1004A*R1033      LSMITC    R               COLHDG('Minimum Term Code')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSMXAL    R               COLHDG('Maximum Approved' -
R1004A*R1033                                'Limit')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSMIAL    R               COLHDG('Minimum Approved' -
R1004A*R1033                                'Limit')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSMDBD    R               COLHDG('Maximum Days to' -
R1004A*R1033                                'BackDate')
R1004A*R1033                                REFFLD(SSCOU3)
R1004A*R1033      LSMAGE    R               COLHDG('Minimum Age Limit')
R1004A*R1033                                REFFLD(SSCOU3)
R1004A*R1033      LSDWSS    R               COLHDG('Drawdown Schedule')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSRTBA    R               COLHDG('Rate Tiered by' -
R1004A*R1033                                'Amount')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSROLL    R               COLHDG('Rollover Method')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSRMTD    R               COLHDG('Rollover Balance' -
R1004A*R1033                                'Method')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSINOR    R               COLHDG('Inverse Order' -
R1004A*R1033                                'Method')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSALTS    R               COLHDG('Alternate Payment' -
R1004A*R1033                                'Schedule')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSALTR    R               COLHDG('Alternate Rate')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSALOW    R               COLHDG('Allow Payment' -
R1004A*R1033                                'Card Generation')
R1004A*R1033                                REFFLD(SSCOD1)
R1017A*R1033      LSMULT    R               COLHDG('Multi Tier')
R1033A            CSMULT    R               COLHDG('Multi Tier')
R1017A                                      REFFLD(SSCOD1)
R1004A*R1033      LSRDAW    R               COLHDG('Redraw')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSAUDB    R               COLHDG('Auto Debit')
R1004A*R1033                                REFFLD(SSCOD1)
R1042A            CSUBSI    R               REFFLD(SSCOD1)
R1042A                                      COLHDG('Subsidized by' '3rd party')
R1027A            CSSLDC    R               COLHDG('Salary Deduction' 'Scheme')
R1027A                                      REFFLD(SSCOD1)
R1027A            CSEMPC    R               COLHDG('Employer Code')
R1027A                                      REFFLD(SSCODA)
R1004A*R1033      LSRATN    R               COLHDG('Rate Number')
R1004A*R1033                                REFFLD(SSRATE)
R1004A*R1033      LSRVAR    R               COLHDG('Rate Variance')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSVARC    R               COLHDG('Rate Variance Code')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSRATE    R               COLHDG('Rate')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSRATF    R               COLHDG('Rate Floor')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSRATC    R               COLHDG('Rate Ceiling')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSCOMF    R               COLHDG('Commitment Fee' +
R1004A*R1033                                       'Calculation Base On')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSAGRL    R               COLHDG('Subject To' +
R1004A*R1033                                       'Aggregrate Limit')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSCRTN    R               COLHDG('Commitment Fee' +
R1004A*R1033                                        'Rate Number')
R1004A*R1033                                REFFLD(SSRATE)
R1004A*R1033      LSCRAT    R               COLHDG('Commitment Fee Rate')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSCYBS    R               COLHDG('Commitment Fee' +
R1004A*R1033                                       'Year Base')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSAUFD    R               COLHDG('Auto Set 1st' +
R1004A*R1033                                       'Payment Due Date')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSDDBF    R               COLHDG('Disburse On' +
R1004A*R1033                                       'Or Before Day')
R1004A*R1033                                REFFLD(SSCOU2)
R1004A*R1033      LSDDBD    R               COLHDG('Disburse On' +
R1004A*R1033                                       'Or Before Due Day')
R1004A*R1033                                REFFLD(SSCOU2)
R1004A*R1033      LSPYFQ    R               COLHDG('Payment Frequency')
R1004A*R1033                                REFFLD(SSTERM)
R1004A*R1033      LSPYFC    R               COLHDG('Payment' +
R1004A*R1033                                       'Frequency Code')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSPELA    R               COLHDG('Percentage Of' +
R1004A*R1033                                       'Loan Amount')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSPETL    R               COLHDG('Percentage Of' +
R1004A*R1033                                       'Total Undrawn')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSUDER    R               COLHDG('Undrawn Limit' +
R1004A*R1033                                       'Excess Rate')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSUDAL    R               COLHDG('Undrawn Limit' +
R1004A*R1033                                       'If Above Limit')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSCANC    R               COLHDG('Subject To' +
R1004A*R1033                                       'Cancellation Fee')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSCHTO    R               COLHDG('Cancellation' +
R1004A*R1033                                       'Charge Code')
R1004A*R1033                                REFFLD(SSCOD2)
R1004A*R1033      LSCHGT    R               COLHDG('Cancellation' +
R1004A*R1033                                       'Charge Type')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSDRWU    R               COLHDG('Unutilised Amount' +
R1004A*R1033                                       'When Drawdown ' +
R1004A*R1033                                       'Schedule Expired')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSEARU    R               COLHDG('Unutilised' +
R1004A*R1033                                       'Amount During' +
R1004A*R1033                                       'Early Settlement')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSEARD    R               COLHDG('Unexpired' +
R1004A*R1033                                       'Duration During' +
R1004A*R1033                                       'Early Settlement')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSEAPE    R               COLHDG('Unutilised When' +
R1004A*R1033                                       'Avail Period Expires' +
R1004A*R1033                                       ' Early Settlement')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSEADE    R               COLHDG('Unexpired Duration' +
R1004A*R1033                                       'When Availability' +
R1004A*R1033                                       'Periods Expires')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSSPRP    R               COLHDG('Subject To' +
R1004A*R1033                                       'Prepayment Penalty')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSSIIL    R               COLHDG('Subject To Interest' +
R1004A*R1033                                       'In Lieu If Notice')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSPCGI    R               COLHDG('Penalty Charge' +
R1004A*R1033                                       'To Interest')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSPCGC    R               COLHDG('Penalty Charge Code')
R1004A*R1033                                REFFLD(SSCOD2)
R1004A*R1033      LSPCHT    R               COLHDG('Penalty Charge Type')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSPGRN    R               COLHDG('Grace Day For' +
R1004A*R1033                                       'Interest In Lieu' +
R1004A*R1033                                       ' Of Notice')
R1004A*R1033                                REFFLD(SSTTTN)
R1004A*R1033      LSPNTR    R               COLHDG('Notice Term CAP')
R1004A*R1033                                REFFLD(SSTERM)
R1004A*R1033      LSPNTC    R               COLHDG('Notice Term Code CAP')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSPETR    R               COLHDG('Notice Term Early')
R1004A*R1033                                REFFLD(SSTERM)
R1004A*R1033      LSPETC    R               COLHDG('NOTICE TERM ' +
R1004A*R1033                                       'Code EARLY')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSPRFE    R               COLHDG('Subject To' +
R1004A*R1033                                       'Prepayment Fee')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSTIER    R               COLHDG('Tiered Prepayment')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSFCGC    R               COLHDG('Prep Fee Charge Code')
R1004A*R1033                                REFFLD(SSCOD2)
R1004A*R1033      LSFCHT    R               COLHDG('Prep Fee Charge Type')
R1004A*R1033                                REFFLD(SSCOD1)
R1017A*R1033      LSFCAL    R               COLHDG('Allow if within' -
R1017A*R1033                                'Lock In Period' '- Prp. Fee')
R1017A*R1033                                REFFLD(SSCOD1)
R1017A*R1033      LSFCWV    R               COLHDG('Allow Waiver' '- Prp. Fee')
R1017A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSFNUM    R               COLHDG('No. Of Times From' +
R1004A*R1033                                'Installment Amount' +
R1004A*R1033                                'Consider Prepayment')
R1004A*R1033                                REFFLD(SSCOU3)
R1026A*R1033      LSFNPM    R               COLHDG('No. Of Inst Made' +
R1026A*R1033                                'before Prepaid')
R1004A*R1033                                REFFLD(SSCOU3)
R1004A*R1033      LSFCHL    R               COLHDG('Whichever' +
R1004A*R1033                                'Higher/Lower CAP')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSFCFA    R               COLHDG('FIXED AMOUNT CAP')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSFCST    R               COLHDG('% Of Amount' +
R1004A*R1033                                'Prepaid/Settled CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFCLA    R               COLHDG('% OF LOAN AMOUNT CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFCCB    R               COLHDG('% OF CURRENT' +
R1004A*R1033                                'Balance CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFCUD    R               COLHDG('% Based On' +
R1004A*R1033                                'Unexpired Duration' +
R1004A*R1033                                'CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFCRU    R               COLHDG('% Remaining' +
R1004A*R1033                                'Unearned Interest '  +
R1004A*R1033                                'CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFCNF    R               COLHDG('Minimum Fee' +
R1004A*R1033                                'Amount Charge ' +
R1004A*R1033                                'CAP')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSFCMF    R               COLHDG('Maximum Fee' +
R1004A*R1033                                'Amount Charge ' +
R1004A*R1033                                'CAP')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSFCMH    R               COLHDG('Charge If' +
R1004A*R1033                                'Prepaid Within X'  +
R1004A*R1033                                'Month CAP')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSFCMI    R               COLHDG('Commencement' +
R1004A*R1033                                'Indicator CAP')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSFEHL    R               COLHDG('WHichever' +
R1004A*R1033                                'Higher/Lower'  +
R1004A*R1033                                'Early')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSFEFA    R               COLHDG('Fixed Amount Early')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSFEST    R               COLHDG('% Of Amount' +
R1004A*R1033                                'Prepaid Or Settled' +
R1004A*R1033                                'Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFELA    R               COLHDG('% Of Loan Am' +
R1004A*R1033                                'ount Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFECB    R               COLHDG('% Of Current' +
R1004A*R1033                                'Balance Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFEUD    R               COLHDG('% Based On' +
R1004A*R1033                                'Unexpired Duration' +
R1004A*R1033                                'Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFERU    R               COLHDG('% Remaining' +
R1004A*R1033                                'Unearned Interest' +
R1004A*R1033                                'Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSFENF    R               COLHDG('Minimum Fee' +
R1004A*R1033                                'Amount Charge Early')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSFEMF    R               COLHDG('Maximum Fee' +
R1004A*R1033                                'Amount Charge Early')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSFEMH    R               COLHDG('Charge If Pr' +
R1004A*R1033                                'epaid Within X Month' +
R1004A*R1033                                'Early')
R1004A*R1033                                REFFLD(SSAMT4)
R1017A*R1033      LSFESL    R               COLHDG('Allow if within' -
R1017A*R1033                                'Lock In Period' '- E. Settlm')
R1017A*R1033                                REFFLD(SSCOD1)
R1017A*R1033      LSFEWV    R               COLHDG('Allow Waiver' '- E. Settlm')
R1017A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSFEMI    R               COLHDG('Commencement' +
R1004A*R1033                                'Indicator Early')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSFLOS    R               COLHDG('Subject To' +
R1004A*R1033                                'Funding Loss')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSLCGC    R               COLHDG('Funding Loss' +
R1004A*R1033                                'Charge Code')
R1004A*R1033                                REFFLD(SSCOD2)
R1004A*R1033      LSLCHT    R               COLHDG('Funding Loss' +
R1004A*R1033                                'Charge Type')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSLCHL    R               COLHDG('Whichever' +
R1004A*R1033                                'Higher/Lower CAP')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSLCFA    R               COLHDG('Fixed Amount' +
R1004A*R1033                                'CAP')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSLCST    R               COLHDG('% Of Amount' +
R1004A*R1033                                'Prepaid Or' 'Settled CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLCLA    R               COLHDG('% Of Loan' +
R1004A*R1033                                'Amount CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLCCB    R               COLHDG('% Of Current' +
R1004A*R1033                                'Balance CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLCUD    R               COLHDG('% Based On' +
R1004A*R1033                                'Unexpired' 'Duration CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLCRU    R               COLHDG('% Remaining' +
R1004A*R1033                                'Unearned' 'Interest CAP')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLCNF    R               COLHDG('Minimum Fee' +
R1004A*R1033                                'Amount Charge CAP')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSLCMF    R               COLHDG('Maximum Fee' +
R1004A*R1033                                'Amount Charge CAP')
R1004A*R1033                                REFFLD(SSAMT4)
R1017A*R1033      LSLCSL    R               COLHDG('Allow if within' -
R1017A*R1033                                'Lock In Period' '- F. Loss')
R1017A*R1033                                REFFLD(SSCOD1)
R1017A*R1033      LSLCWV    R               COLHDG('Allow Waiver' '- F. Loss')
R1017A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSLEHL    R               COLHDG('Whichever' +
R1004A*R1033                                'Higher/Lower Early')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSLEFA    R               COLHDG('Fixed Amount' +
R1004A*R1033                                'Early')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSLEST    R               COLHDG('% Of Amount' +
R1004A*R1033                                'Prepaid Or Settled' +
R1004A*R1033                                'Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLELA    R               COLHDG('% Of Loan' +
R1004A*R1033                                'Amount Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLECB    R               COLHDG('% Of Current' +
R1004A*R1033                                'Balance Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLEUD    R               COLHDG('% Based On' +
R1004A*R1033                                'Unexpired Duration' +
R1004A*R1033                                'Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLERU    R               COLHDG('% Remaining' +
R1004A*R1033                                'Unearned Interest' +
R1004A*R1033                                'Early')
R1004A*R1033                                REFFLD(SSPERD)
R1004A*R1033      LSLENF    R               COLHDG('Minimum Fee' +
R1004A*R1033                                'Amount Charge Early')
R1004A*R1033                                REFFLD(SSAMT4)
R1004A*R1033      LSLEMF    R               COLHDG('Maximum Fee' +
R1004A*R1033                                'Amount Charge Early')
R1004A*R1033                                REFFLD(SSAMT4)
R1017A*R1033      LSLESL    R               COLHDG('Allow if within' -
R1017A*R1033                                'Lock In Period' '- S.F. Loss')
R1017A*R1033                                REFFLD(SSCOD1)
R1017A*R1033      LSLEWV    R               COLHDG('Allow Waiver' '- S.F. Loss')
R1017A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSAGHP    R               COLHDG('Auto Gen HPA' +
R1004A*R1033                                'Form A/B/G')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSCSDP    R               COLHDG('Dealer Commission' +
R1004A*R1033                                'Amortized Period')
R1004A*R1033                                REFFLD(SSTERM)
R1004A*R1033      LSCSDC    R               COLHDG('Dealer Commission' +
R1004A*R1033                                'Amortized' +
R1004A*R1033                                'Period Code')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSCSSP    R               COLHDG('Sub Dealer' +
R1004A*R1033                                'Commission ' +
R1004A*R1033                                'Amortized Period')
R1004A*R1033                                REFFLD(SSTERM)
R1004A*R1033      LSCSSC    R               COLHDG('Sub Dealer' +
R1004A*R1033                                'Commission Amortized' +
R1004A*R1033                                'Period Code')
R1004A*R1033                                REFFLD(SSCOD1)
R1004A*R1033      LSCSLP    R               COLHDG('Salesman' +
R1004A*R1033                                'Commission' +
R1004A*R1033                                'Amortized Period')
R1004A*R1033                                REFFLD(SSTERM)
R1004A*R1033      LSCSLC    R               COLHDG('Salesman' +
R1004A*R1033                                'Commission Amortized' +
R1004A*R1033                                'Period Code')
R1004A*R1033                                REFFLD(SSCOD1)
R1009A            CSUSRP    R               COLHDG('Use Relationship' +
R1009A                                      'Pricing')
R1009A                                      REFFLD(SSCOD1)
R1009A            CSSRPF    R               COLHDG('Use Standard Rate' +
R1009A                                      'Permanently if' 'Breached')
R1009A                                      REFFLD(SSCOD1)
R1038A            CSRIND    R               COLHDG('Effective Rate' 'Indicator')
R1038A                                      REFFLD(SSCOD1)
R1009A            CSPDRP    R               COLHDG('Not Overdue' +
R1009A                                      'More than Term')
R1009A                                      REFFLD(SSCOU3)
R1009A            CSPCRP    R               COLHDG('Not Overdue' +
R1009A                                      'More than Term Code')
R1009A                                      REFFLD(SSCOD1)
R1009A            CSANRP    R               COLHDG('Related Account Not' +
R1009A                                      'Overdue' 'More Than Term')
R1009A                                      REFFLD(SSCOU3)
R1009A            CSACRP    R               COLHDG('Related Account Not' +
R1009A                                      'Overdue More' 'Than Term Code')
R1009A                                      REFFLD(SSCOD1)
R1009A            CSDNRP    R               COLHDG('Not Overdue Since' +
R1009A                                      '1st Disbursement' 'Term')
R1009A                                      REFFLD(SSCOU3)
R1009A            CSDCRP    R               COLHDG('Not Overdue Since' +
R1009A                                      '1st Disbursement' +
R1009A                                      'Term Code')
R1009A                                      REFFLD(SSCOD1)
R1009A            CSPLRP    R               COLHDG('Account not NPL')
R1009A                                      REFFLD(SSCOD1)
R1009A            CSMTRP    R               COLHDG('Not Overdue' +
R1009A                                      'More Than - Times')
R1009A                                      REFFLD(SSCOU3)
R1009A            CSMNRP    R               COLHDG('Not Overdue' +
R1009A                                      'More Than - Term')
R1009A                                      REFFLD(SSCOU3)
R1009A            CSMCRP    R               COLHDG('Not Overdue' +
R1009A                                      'More Than' ' - Term Code')
R1009A                                      REFFLD(SSCOD1)
R1009A            CSMMRP    R               COLHDG('Not Overdue' +
R1009A                                      'More Than - Months')
R1009A                                      REFFLD(SSCOU3)

SS04 ** PRICING PACKAGE PARAMETER - DETAIL - LNPRPQ
SS04 A            LDPCOD    R               COLHDG('Campaign/Package' 'Code')
SS04 A*R1015                                REFFLD(SSCOD3)
R1015A                                      REFFLD(SSCODA)
SS04 A            LDPSEQ    R               COLHDG('Sequence' 'Number')
SS04 A                                      REFFLD(SSCOU3)
R1017A            LDPPSQ    R               COLHDG('Posting' 'Seq')
R1017A                                      REFFLD(SSCOU3)
R1017A            LDLIMT    R               COLHDG('Limit')
R1017A                                      REFFLD(SSAMT4)
SS04 A            LDTERM    R               COLHDG('Term')
SS04 A                                      REFFLD(SSCOU5)
SS04 A            LDTMCD    R               COLHDG('Term Code')
SS04 A                                      REFFLD(SSCOD1)
SS04 A            LDRATE    R               COLHDG('Rate')
SS04 A                                      REFFLD(SSPERD)
SS04 A            LDRATN    R               COLHDG('Rate Number')
SS04 A                                      REFFLD(SSRATE)
SS04 A            LDVARI    R               COLHDG('Rate Variance')
SS04 A                                      REFFLD(SSPERD)
SS04 A            LDVCD     R               COLHDG('Rate Variance Code')
SS04 A                                      REFFLD(SSCOD1)
SS04 A            LDFLOR    R               COLHDG('Rate Floor')
SS04 A                                      REFFLD(SSPERD)
SS04 A            LDCEIL    R               COLHDG('Rate Ceiling')
SS04 A                                      REFFLD(SSPERD)
SS04 A            LDRTRM    R               COLHDG('Rate' 'Review Term')
SS04 A                                      REFFLD(SSTERM)
SS04 A            LDRCD     R               COLHDG('Rate Review' 'Term Code')
SS04 A                                      REFFLD(SSCOD1)
R1017A            LDFDRT    R               COLHDG('Tied to' 'Deposit A/C')
R1017A                                      REFFLD(SSCOD1)
R1017A            LDNPMT    R               COLHDG('New Paym Amt')
R1017A                                      REFFLD(SSAMT4)
R1017A            LDNORG    R               COLHDG('New Original Amt')
R1017A                                      REFFLD(SSAMT4)
R1017A            LDYBSE    R               COLHDG('Year base')
R1017A                                      REFFLD(SSCOU1)
R1017A            LDRSTM    R               COLHDG('Rest Method')
R1017A                                      REFFLD(SSCOD1)
R1017A            LDPMCD    R               COLHDG('Upd When' 'Pmtcod Auto Chg')
R1017A                                      REFFLD(SSCOD1)
R1017A            LDGPPI    R               COLHDG('GPP Indicator')
R1017A                                      REFFLD(SSCOD1)
SS04 ** LOAN TYPE - PRICING PACKAGE PARAMETER - LNPRPR
SS04 A            LLPTYP    R               COLHDG('Loan Type')
SS04 A                                      REFFLD(SSPROD)
SS04 A            LLPCUR    R               COLHDG('Currency')
SS04 A                                      REFFLD(SSCURC)
SS04 A            LLPCOD    R               COLHDG('Campaign Code')
SS04 A                                      REFFLD(SSCODA)
SS06 ** COOPERATIVE REGISTRATION TYPE
SS06 A            LPPTYP    R               COLHDG('Coorperative' -
SS06 A                                      'Registration Type')
SS06 A                                      REFFLD(SSCOU4)
SS06 A            LPPDES    R               COLHDG('Coorperative' -
SS06 A                                      'Registration Name')
SS06 A*R1015                                REFFLD(SSNAML)
R1015A                                      REFFLD(SSDESC)
SS06 A            LPPCLD    R               COLHDG('Coorperative' -
SS06 A                                      'Registration Name' 'Local')
SS06 A                                      REFFLD(SSDESC)
SS06 A            LPPCSD    R               COLHDG('Coorperative' -
SS06 A                                      'Registration Name' 'Short')
SS06 A                                      REFFLD(SSDES2)
SS09 A*****************************************************************
SS09 A* LNSUPC - SUPPORTING CONTRACT FILE
SS09 A*****************************************************************
SS09 A            SPCTYP    R               COLHDG('PRODUCT TYPE')
SS09 A                                      REFFLD(SSCODA)
SS09 A            SPCURR    R               COLHDG('CURRENCY TYPE')
SS09 A                                      REFFLD(SSCOD4)
SS09 A            SPCEPT    R               COLHDG('CONCEPT CODE')
SS09 A                                      REFFLD(SSCOD2)
SS09 A*****************************************************************
SS09 A* LNPRTP - TDR DEFAULT PAYMENT CODE PARAMETER
SS09 A*****************************************************************
SS09 A            TDRPCD    R               COLHDG('TDR Payment Type')
SS09 A                                      REFFLD(SSCOU2)
SS09 A            TDRFTR    R               COLHDG('Fixed Transaction')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            TDRATR    R               COLHDG('Advance Transaction')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            TDRDTR    R               COLHDG('Grace Transaction')
SS09 A                                      REFFLD(SSCOU3)
SS09 A            TDRPRN    R               COLHDG('Validate Principal')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            TDRINT    R               COLHDG('Validate Interest ')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            TDRMIN    R               COLHDG('Validate Moratorium' -
SS09 A                                      'Interest')
SS09 A                                      REFFLD(SSCOD1)
SS09 A            TDRRIN    R               COLHDG('Validate' 'Restructured' -
SS09 A                                      'Interest')
SS09 A                                      REFFLD(SSCOD1)
SS10 A*****************************************************************
SS10 A* LNPAMO - OD Excess Charges
SS10 A*****************************************************************
SS10 A**          CTYPE     R               COLHDG('Loan' 'Type')
SS10 A**                                    REFFLD(SSPROD)
SS10 A**          CCURTY    R               COLHDG('Currency' 'Type')
SS10 A**                                    REFFLD(SSCURC)
SS10 A            CAMTTO    R               COLHDG('OD Excess to')
SS10 A                                      REFFLD(SSAMT4)
SS10 A            CAMTFR    R               COLHDG('OD Excess from')
SS10 A                                      REFFLD(SSAMT4)
SS10 A            CHGAMT    R               COLHDG('Fee Amount Charge')
SS10 A                                      REFFLD(SSAMT4)
SS10 A            CHGPCT    R               COLHDG('Fee Percentage' 'Charge')
SS10 A                                      REFFLD(SSPERD)
SS10 A            CHGIND    R               COLHDG('Charges Indicator')
SS10 A                                      REFFLD(SSCOD1)
SS10 A            CHGCHG    R               COLHDG('Charge to' 'Charge Type')
SS10 A                                      REFFLD(SSCOD2)
SS10 A            CHGMCO    R               COLHDG('Charge to MO or OC')
SS10 A                                      REFFLD(SSCOD1)
SS14 A*****************************************************************
SS14 A* LNPDBD - Disbursement Deduction Parameter File
SS14 A*****************************************************************
SS14 A            PBTYPE    R               COLHDG('Loan' 'Type')
SS14 A                                      REFFLD(SSPROD)
SS14 A            PBDCUR    R               COLHDG('Currency' 'Type')
SS14 A                                      REFFLD(SSCURC)
SS14 A            PBDIND    R               COLHDG('Deduction' 'Indicator')
SS14 A                                      REFFLD(SSCOD1)
SS14 A            PBDAMT    R               COLHDG('Deduction' 'Amount')
SS14 A                                      REFFLD(SSAMT4)
SS14 A            PBDCCD    R               COLHDG('Charge to' 'Misc/Othchg')
SS14 A                                      REFFLD(SSCOD1)
SS14 A            PBDCTP    R               COLHDG('Charge Type')
SS14 A                                      REFFLD(SSCOD2)
SS14 A            PBDCSA    R               COLHDG('CA/SA Account')
SS14 A                                      REFFLD(SSACCN)
SS14 A            PBDCST    R               COLHDG('CA/SA Type')
SS14 A                                      REFFLD(SSACCT)
SS15 A*****************************************************************
SS15 A* LNPARS - TDR Category Parameter File
SS15 A*****************************************************************
SS15 A*
SS15 A*R1002      LPSCAT    R               COLHDG('TDR Category Code')
SS15 A*R1002                                REFFLD(SSCOD3)
SS15 A*R1002      LPSCDE    R               COLHDG('TDR Reason Code')
SS15 A*R1002                                REFFLD(SSCOD3)
SS15 A*R1002      LPSDSC    R               COLHDG('Description')
SS15 A*R1002                                REFFLD(SSDESS)
R1001A*****************************************************************
R1001A* LNPARP - Loan Write Off Reason Parameter
R1001A*****************************************************************
R1001A*
R1001A            PWORES    R               COLHDG('Write off' 'Reason Code')
R1001A                                      REFFLD(SSCOD3)
R1001A            PWODES    R               COLHDG('Write Off' 'Description')
R1001A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            PWOLDS    R               COLHDG('Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            PWOSDS    R               COLHDG('Short Description')
R1003A                                      REFFLD(SSDES2)
R1001A*****************************************************************
R1001A* LNTPUR - Loan Transaction Purpose Code Parameter
R1001A*****************************************************************
R1001A*
R1001A            LTTRN     R               COLHDG('Transaction' 'Type')
R1001A                                      REFFLD(SSCOD2)
R1001A            LTTPUR    R               COLHDG('Purpose Code')
R1001A                                      REFFLD(SSCOD2)
R1001A            LTTDES    R               COLHDG('Purpose Description')
R1001A*R1003                                REFFLD(SSDESM)
R1003A                                      REFFLD(SSDESC)
R1003A            LTTLDS    R               COLHDG('Local Description')
R1003A                                      REFFLD(SSDESC)
R1003A            LTTSDS    R               COLHDG('Short Description')
R1003A                                      REFFLD(SSDES2)
R1001A*****************************************************************
R1001A* LNCRAT - Maximum/Minimum Rate Parameter
R1001A*****************************************************************
R1001A*
R1001A            LCSBU     R               COLHDG('Strategic' 'Business Unit')
R1001A*R1035                                REFFLD(SSCODA)
R1035A                                      REFFLD(SSCOD4)
R1001A            LCLNTY    R               COLHDG('Loan Group')
R1001A                                      REFFLD(SSCOU3)
R1001A            LCUNSC    R               COLHDG('Secured/Unsecured')
R1001A                                      REFFLD(SSCOD1)
R1030A            LCCURT    R               COLHDG('Currency Type')
R1030A                                      REFFLD(SSCURC)
R1001A            LCMRAT    R               COLHDG('Interest' 'Rate(Maximum')
R1001A                                      REFFLD(SSPERD)
R1001A            LCMRTN    R               COLHDG('Rate' 'Number(Maximum)')
R1001A                                      REFFLD(SSCOU5)
R1001A            LCMVAR    R               COLHDG('Rate' 'Variance(Maximum)')
R1001A                                      REFFLD(SSPERD)
R1001A            LCMVRC    R               COLHDG('Variance' 'Code(Maximum)')
R1001A                                      REFFLD(SSCOD1)
R1001A            LCNRAT    R               COLHDG('Interest' 'Rate(Minimum)')
R1001A                                      REFFLD(SSPERD)
R1001A            LCNRTN    R               COLHDG('Rate' 'Number(Minimum)')
R1001A                                      REFFLD(SSCOU5)
R1001A            LCNVAR    R               COLHDG('Rate' 'Variance(Minimum)')
R1001A                                      REFFLD(SSPERD)
R1001A            LCNVRC    R               COLHDG('Variance' 'Code(Minimum)')
R1001A                                      REFFLD(SSCOD1)
R1001A            LCMDRT    R               COLHDG('Def. Int' 'Rate(Maximum)')
R1001A                                      REFFLD(SSPERD)
R1001A            LCMDRN    R               COLHDG('Def.Rate' 'Number(Maximum)')
R1001A                                      REFFLD(SSCOU5)
R1001A            LCMDVR    R               COLHDG('Def.Rate' 'Var.(Maximum)')
R1001A                                      REFFLD(SSPERD)
R1001A            LCMDVC    R               COLHDG('Def. Var.' 'Code(Maximum)')
R1001A                                      REFFLD(SSCOD1)
R1001A            LCNDRT    R               COLHDG('Def. Int' 'Rate(Minimum)')
R1001A                                      REFFLD(SSPERD)
R1001A            LCNDRN    R               COLHDG('Def.Rate' 'Number(Minimum)')
R1001A                                      REFFLD(SSCOU5)
R1001A            LCNDVR    R               COLHDG('Def.Rate' 'Var.(Minimum)')
R1001A                                      REFFLD(SSPERD)
R1001A            LCNDVC    R               COLHDG('Def. Var.' 'Code(Minimum)')
R1001A                                      REFFLD(SSCOD1)
R1001A            LCNEF8    R               COLHDG('Effective Date')
R1001A                                      REFFLD(SSDAT8)
R1001A*****************************************************************
R1001A* LNCHIS - Maximum/Minimum Rate History Parameter
R1001A*****************************************************************
R1001A            LHSBU     R               COLHDG('Strategic' 'Business Unit')
R1001A*R1035                                REFFLD(SSCODA)
R1035A                                      REFFLD(SSCOD4)
R1001A            LHLTY     R               COLHDG('Loan Group')
R1001A                                      REFFLD(SSCOU3)
R1001A            LHUNS     R               COLHDG('Secured/Unsecured')
R1001A                                      REFFLD(SSCOD1)
R1030A            LHCURT    R               COLHDG('Currency Type')
R1030A                                      REFFLD(SSCURC)
R1001A            LHCDT8    R               COLHDG('Maintenance Date')
R1001A                                      REFFLD(SSDAT8)
R1001A            LMOINT    R               COLHDG('Old Int' 'Rate(Max)')
R1001A                                      REFFLD(SSPERD)
R1001A            LMNINT    R               COLHDG('New Int' 'Rate(Max)')
R1001A                                      REFFLD(SSPERD)
R1001A            LMODIN    R               COLHDG('Old Def. Int' 'Rate(Max)')
R1001A                                      REFFLD(SSPERD)
R1001A            LMNDIN    R               COLHDG('New Def. Int' 'Rate(Max)')
R1001A                                      REFFLD(SSPERD)
R1001A            LNOINT    R               COLHDG('Old Int' 'Rate(Min)')
R1001A                                      REFFLD(SSPERD)
R1001A            LNNINT    R               COLHDG('New Int' 'Rate(Min)')
R1001A                                      REFFLD(SSPERD)
R1001A            LNODIN    R               COLHDG('Old Def. Int' 'Rate(Min)')
R1001A                                      REFFLD(SSPERD)
R1001A            LNNDIN    R               COLHDG('New Def. Int' 'Rate(Min)')
R1001A                                      REFFLD(SSPERD)
R1001A*****************************************************************
R1001A* LNTSBU - Loan Strategic Business Unit Parameter
R1001A*****************************************************************
R1001A*
R1001A*R1033      STYPE     R               COLHDG('Loan' 'Type')
R1001A*R1033                                REFFLD(SSPROD)
R1001A*R1033      SCURTY    R               COLHDG('Currency Code')
R1001A*R1033                                REFFLD(SSCURC)
R1001A            SSBUCD    R               COLHDG('Strategic' 'Business Unit')
R1001A                                      REFFLD(SSCOD4)
R1001A*R1039      SSBUDS    R               COLHDG('Strategic' 'Buss Unit Desc')
R1003A*R1039                                REFFLD(SSDESC)
R1003A*R1039      SSBULS    R               COLHDG('Local Description')
R1003A*R1039                                REFFLD(SSDESC)
R1003A*R1039      SSBUSS    R               COLHDG('Short Description')
R1003A*R1039                                REFFLD(SSDES2)
R1001A*R1033      SLNGRP    R               COLHDG('Gen Ledger' 'Group Code')
R1001A*R1033                                REFFLD(SSCOU5)
R1001A*R1033      SP2PRD    R               COLHDG('Gen Ledger' 'Product Code')
R1001A*R1033                                REFFLD(SSCOU5)
R1001A*R1033      SGBOOK    R               COLHDG('Gen Ledger Book')
R1001A*R1033                                REFFLD(SSCOD5)
R1001A*R1033      SPMTCD    R               COLHDG('Payment Code')
R1001A*R1033                                REFFLD(SSCOU1)
R1001A*R1033      SFREQ     R               COLHDG('Payment Freq')
R1001A*R1033                                REFFLD(SSCOU5)
R1001A*R1033      SFCODE    R               COLHDG('Payment Freq' 'Code')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SIFREQ    R               COLHDG('Interest Payment' 'Freq')
R1001A*R1033                                REFFLD(SSCOU5)
R1001A*R1033      SIFCOD    R               COLHDG('Interest Paym' 'Freq Code')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      S1DDPD    R               COLHDG('1st Past Due Day')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S2DDPD    R               COLHDG('2nd Past Due Day')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S3DDPD    R               COLHDG('3rd Past Due Day')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S4DDPD    R               COLHDG('4th Past Due Day')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S5DDPD    R               COLHDG('5th Past Due Day')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S6DDPD    R               COLHDG('6th Past Due Day')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S1MMPD    R               COLHDG('1st Past Due Month')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S2MMPD    R               COLHDG('2nd Past Due Month')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S3MMPD    R               COLHDG('3rd Past Due Month')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S4MMPD    R               COLHDG('4th Past Due Month')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S5MMPD    R               COLHDG('5th Past Due Month')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      S6MMPD    R               COLHDG('6th Past Due Month')
R1001A*R1033                                REFFLD(SSCOU3)
      *R1033
R1001A*R1033      SOTOL     R               COLHDG('Payoff Tolerance' 'Dr Bal')
R1001A*R1033                                REFFLD(SSAMT4)
R1001A*R1033      SOTCB     R               COLHDG('Payoff Tolerance' 'Cr Bal')
R1001A*R1033                                REFFLD(SSAMT4)
R1001A*R1033      SBLNDY    R               COLHDG('Days Before Payment' -
R1001A*R1033                                'Date For' 'Billing Record')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      SSKBIL    R               COLHDG('Skip Bill' -
R1001A*R1033                                'Interest Past' 'Billing Cycle')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SBILIN    R               COLHDG('Forecast Bill' 'Interest')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SBILCF    R               COLHDG('Forecast Bill' -
R1001A*R1033                                'Commitment Fees')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SBILLC    R               COLHDG('Forecast Bill' -
R1001A*R1033                                'Late Charge')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SRCMRT    R               COLHDG('Use Maturity Rate' -
R1001A*R1033                                'Upon Recalled')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SSDDYM    R               COLHDG('Switch Payment Freq' -
R1001A*R1033                                'to Monthly' 'Upon Matured')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SDDAYM    R               COLHDG('Due Day Upon Matured')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      SUADVP    R               COLHDG('Auto Uplift' -
R1001A*R1033                                'Advance Payment')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCFPDT    R               COLHDG('Autoset 1st' -
R1001A*R1033                                'Payment Date' 'Prin/PrinInt')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCNIPD    R               COLHDG('Autoset 1st' -
R1001A*R1033                                'Payment Date' 'Interest')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SUPDOB    R               COLHDG('Disburse On/Before' -
R1001A*R1033                                'Day Prin')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SUPIOB    R               COLHDG('Disburse On/Before' -
R1001A*R1033                                'Day Interest')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDAFP     R               COLHDG('Day for Autoset 1st' -
R1001A*R1033                                'Interest Payment' 'Date Prin')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDANIP    R               COLHDG('Day for Autoset 1st' -
R1001A*R1033                                'Interest Payment' 'Date Interest')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SFFPDT    R               COLHDG('Set First Payment' -
R1001A*R1033                                'Date based on')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SUPPCD    R               COLHDG('Auto Update' -
R1001A*R1033                                'Payment Code')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SDFPCD    R               COLHDG('Default Payment Code')
R1001A*R1033                                REFFLD(SSCOU1)
R1001A*R1033      SMTHBK    R               COLHDG('Month Grace to' -
R1001A*R1033                                'Set 1st' 'Payment Date')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      SBCFTD    R               COLHDG('Billing Cycle' -
R1001A*R1033                                'from/to Day' ' based on')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SDFD1     R               COLHDG('Billing Cycle 1 From')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDFD2     R               COLHDG('Billing Cycle 2 From')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDFD3     R               COLHDG('Billing Cycle 3 From')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDFD4     R               COLHDG('Billing Cycle 4 From')
R1001A*R1033                                REFFLD(SSCOU2)
R1029A*R1033      SDFD5     R               COLHDG('Billing Cycle 5 From')
R1029A*R1033                                REFFLD(SSCOU2)
R1029A*R1033      SDFD6     R               COLHDG('Billing Cycle 6 From')
R1029A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDTD1     R               COLHDG('Billing Cycle 1 To')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDTD2     R               COLHDG('Billing Cycle 2 To')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDTD3     R               COLHDG('Billing Cycle 3 To')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDTD4     R               COLHDG('Billing Cycle 4 To')
R1001A*R1033                                REFFLD(SSCOU2)
R1029A*R1033      SDTD5     R               COLHDG('Billing Cycle 5 To')
R1029A*R1033                                REFFLD(SSCOU2)
R1029A*R1033      SDTD6     R               COLHDG('Billing Cycle 6 To')
R1029A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDDD1     R               COLHDG('Billing Cycle' '1 Due Day')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDDD2     R               COLHDG('Billing Cycle' '2 Due Day')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDDD3     R               COLHDG('Billing Cycle' '3 Due Day')
R1001A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SDDD4     R               COLHDG('Billing Cycle' '4 Due Day')
R1001A*R1033                                REFFLD(SSCOU2)
R1029A*R1033      SDDD5     R               COLHDG('Billing Cycle' '5 Due Day')
R1029A*R1033                                REFFLD(SSCOU2)
R1029A*R1033      SDDD6     R               COLHDG('Billing Cycle' '6 Due Day')
R1029A*R1033                                REFFLD(SSCOU2)
R1001A*R1033      SREAMO    R               COLHDG('Reamor Payment' 'Amount' -
R1001A*R1033                                '- Rate Change')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCPAMR    R               COLHDG('Reamor Payment' 'Amount' -
R1001A*R1033                                '- Capital Repayment')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SABKD     R               COLHDG('Reamor Payment' 'Amount' -
R1001A*R1033                                '- Disbursement')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SOREAM    R               COLHDG('Payment Amount' -
R1001A*R1033                                'RtChg Method')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SOCPAM    R               COLHDG('Payment Amount' -
R1001A*R1033                                'Cap Repyt Method')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SOABKD    R               COLHDG('Payment Amount' -
R1001A*R1033                                'for Dismt Method')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SREAMG    R               COLHDG('Payment Grace')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      SDNCPM    R               COLHDG('Do not Change' -
R1001A*R1033                                'Payment Amount if')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SUMDRC    R               COLHDG('Update Maturity' -
R1001A*R1033                                'Date for' 'Rate Change')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SUMDCP    R               COLHDG('Update Maturity Date' -
R1001A*R1033                                'Date for' 'Capital Repayment')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SUMDDB    R               COLHDG('Update Maturity Date' -
R1001A*R1033                                'Date for' 'Disbursement')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SASMAT    R               COLHDG('Auto set' 'Maturity Date')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SUMATD    R               COLHDG('Auto Extend Maturity' -
R1001A*R1033                                'Date Upon Maturity')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCMATD    R               COLHDG('Maturity Date' -
R1001A*R1033                                'Calculation Method')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCAPCA    R               COLHDG('Capital' 'Commitment Fee')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCPCOM    R               COLHDG('Charge Type')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCTYPE    R               COLHDG('Charge To')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCAPIN    R               COLHDG('Accrued Interest' -
R1001A*R1033                                'at End of Month')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCAPFL    R               COLHDG('Accrued Interest' -
R1001A*R1033                                'at Full' 'Release Date')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCAPMT    R               COLHDG('Accrued at' -
R1001A*R1033                                'Maturity Date')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SCAPNP    R               COLHDG('Accrued Interest' -
R1001A*R1033                                'EOM for' 'NPL/Matured Account')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SROMOT    R               COLHDG('Switch to' -
R1001A*R1033                                'Default Rate Flag')
R1001A*R1033                                REFFLD(SSCOD1)
R1033A*R1033      SRENRT    R               COLHDG('Reinstate' -
R1033A*R1033                                'Normal Rate')
R1033A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SROARR    R               COLHDG('Duration in Default' -
R1001A*R1033                                'to Switch' 'Default Rate')
R1001A*R1033                                REFFLD(SSCOU3)
R1001A*R1033      SROATC    R               COLHDG('Duration in Default' -
R1001A*R1033                                'to S/W Def' 'Rate Code')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SROCLB    R               COLHDG('Clawback' -
R1001A*R1033                                'Last Due Date')
R1001A*R1033                                REFFLD(SSCOD1)
R1001A*R1033      SRORAT    R               COLHDG('Default Rate')
R1001A*R1033                                REFFLD(SSPERD)
R1001A*R1033      SRORTN    R               COLHDG('Default Rate Number')
R1001A*R1033                                REFFLD(SSCOU5)
R1001A*R1033      SROVRI    R               COLHDG('Default Rate' -
R1001A*R1033                                'Variance')
R1001A*R1033                                REFFLD(SSPERD)
R1001A*R1033      SROVRC    R               COLHDG('Default Rate' -
R1001A*R1033                                'Variance Code')
R1001A*R1033                                REFFLD(SSCOD1)
R1005A*****************************************************************
R1005A* LNPARD - Loan Account Close Status Parameter
R1005A*****************************************************************
R1005A*
R1005A            LDCLOS    R               COLHDG('Close Account' 'Status')
R1005A                                      REFFLD(SSCOD2)
R1005A            LDDESC    R               COLHDG('Close Account' -
R1005A                                      'Description')
R1005A                                      REFFLD(SSDESC)
R1005A            LDLCLD    R               COLHDG('Local Description')
R1005A                                      REFFLD(SSDESC)
R1005A            LDLCSD    R               COLHDG('Short Description')
R1005A                                      REFFLD(SSDES2)
R1005A*****************************************************************
R1005A* LNPARE - Loan GSAM Code Parameter
R1005A*****************************************************************
R1005A*
R1006A            LGSSBU    R               COLHDG('SBU Code')
R1006A                                      REFFLD(SSCOD4)
R1005A            LGSAMC    R               COLHDG('GSAM Code')
R1005A                                      REFFLD(SSCOD2)
R1005A            LGSAMD    R               COLHDG('GSAM Code' -
R1005A                                      'Description')
R1005A                                      REFFLD(SSDESC)
R1005A            LGSAML    R               COLHDG('Local Description')
R1005A                                      REFFLD(SSDESC)
R1005A            LGSAMS    R               COLHDG('Short Description')
R1005A                                      REFFLD(SSDES2)
R1005A*****************************************************************
R1005A* LNPARK - Loan Legal Status Parameter
R1005A*****************************************************************
R1005A*
R1005A            LLEGAC    R               COLHDG('Legal Status Code')
K0003A                                      REFFLD(SSCOD3)
R1005A*K0003                                REFFLD(SSCOD1)
R1005A            LLEGAD    R               COLHDG('Legal Status Code' -
R1005A                                      'Description')
R1005A                                      REFFLD(SSDESC)
R1005A            LLEGAL    R               COLHDG('Local Description')
R1005A                                      REFFLD(SSDESC)
R1005A            LLEGAS    R               COLHDG('Short Description')
R1005A                                      REFFLD(SSDES2)
R1008A*****************************************************************
R1008A* LNRPSD - Loan Legal Status Parameter
R1008A*****************************************************************
R1008A*
R1008A            RPTYPE    R               COLHDG('Loan Type')
R1008A                                      REFFLD(SSPROD)
R1008A            RPCURT    R               COLHDG('Currency')
R1008A                                      REFFLD(SSCURC)
R1008A            RPCCOD    R               COLHDG('Campaign Code')
R1008A                                      REFFLD(SSPROD)
R1008A            RPSEQN    R               COLHDG('Sequence Number')
R1008A                                      REFFLD(SSSEQ)
R1008A            RPTERM    R               COLHDG('Period')
R1008A                                      REFFLD(SSTERM)
R1008A            RPPERC    R               COLHDG('Reduction Percentage')
R1008A                                      REFFLD(SSPERD)
G001 A*
G001 A            RPPRAT    R               COLHDG('Relation rate')
G001 A                                      REFFLD(SSPERD)
G001 A            RPPRTN    R               COLHDG('Relation Prime Rate')
G001 A                                      REFFLD(SSRATE)
G001 A            RPPVCE    R               COLHDG('Relation variance' 'code')
G001 A                                      REFFLD(SSCOD1)
G001 A            RPPVRI    R               COLHDG('Relation variance')
G001 A                                      REFFLD(SSPERD)
G001 A            RPPASS    R               COLHDG('Relation Pass Code')
G001 A                                      REFFLD(SSCOD1)
R1010A*****************************************************************
R1010A* LNTSER - Product Auxiliary Service
R1010A*****************************************************************
R1010A*
R1010A            LSRLTY    R               COLHDG('Loan Type')
R1010A                                      REFFLD(SSCODA)
R1010A            LSRCUR    R               COLHDG('Currency Type')
R1010A                                      REFFLD(SSCOD4)
R1010A            LSRYID    R               COLHDG('System ID')
R1010A                                      REFFLD(SSCODA)
R1010A            LSRCTP    R               COLHDG('Account Type Code')
R1010A                                      REFFLD(SSCODA)
R1010A            LSRTYP    R               COLHDG('Internal Account' 'Type')
R1010A                                      REFFLD(SSCOD1)
     A*****************************************************************
R1014A* LNPARL - Return Cheque Reason Code Parameter
     A*****************************************************************
     A*
     A            LNLCOD    R               COLHDG('Reason code')
     A                                      REFFLD(SSCOD2)
     A            LNLSDS    R               COLHDG('Short Description')
     A                                      REFFLD(SSDES2)
     A            LNLDSC    R               COLHDG('Description')
     A                                      REFFLD(SSDESC)
     A            LNLLDS    R               COLHDG('Local Description')
     A                                      REFFLD(SSDESC)
     A*****************************************************************
R1023A* LNPDUA - Disbursement Dual-Level Approval Parameter
     A*****************************************************************
     A*
     A            LPDSBU    R               COLHDG('SBU Code')
     A                                      REFFLD(SSCOD4)
     A            LPDAMT    R               COLHDG('Threshold Amount')
     A                                      REFFLD(SSAMT4)
R1024A            LPDDLA    R               COLHDG('Drawing Limit' 'Activation')
R1024A                                      REFFLD(SSAMT4)
R1045A*****************************************************************
R1045A* LNPARV - Developer/Employer Code Parameter
R1045A*****************************************************************
R1045A            LVDEEM    R               COLHDG('Subsidised' 'Party Code')
R1045A                                      REFFLD(SSCODA)
R1045A            LVDECD    R               COLHDG('Subsidised' 'Type')
R1045A                                      REFFLD(SSCOD1)
R1045A            LVDEDS    R               COLHDG('Subsidised' 'Party -
R1045A                                      Description')
R1045A                                      REFFLD(SSDESC)
R1045A            LVDLDS    R               COLHDG('Subsidised' 'Party -
R1045A                                      Local Desc')
R1045A                                      REFFLD(SSDESC)
R1045A            LVDSDS    R               COLHDG('Subsidised' 'Party -
R1045A                                      Short Desc')
R1045A                                      REFFLD(SSDES2)
G001 A*****************************************************************
G001 A** Campaign Code Extension Parameter - LNPRPPE
G001 A*****************************************************************
G001 A            CSAEF8    R               COLHDG('Start Acceptance' 'Date')
G001 A                                      REFFLD(SSDAT8)
G001 A            CSAEX8    R               COLHDG('End Acceptance' 'Date')
G001 A                                      REFFLD(SSDAT8)
G001 A            CPMTRV    R               COLHDG('Rate Variance' 'for Payment-
G001 A                                       Amount')
G001 A                                      REFFLD(SSPERD)
G001 A            CPMTRC    R               COLHDG('Rate Variance code' 'for Pa-
G001 A                                      yment Amount')
G001 A                                      REFFLD(SSCOD1)
G008 A            CPMTRT    R               COLHDG('Rate for' 'Payment Amount')
G008 A                                      REFFLD(SSPERD)
G008 A            CPMTRN    R               COLHDG('Rate Number' 'for' 'Payment-
G008 A                                       Amount')
G008 A                                      REFFLD(SSRATE)
G001 A            CLMTRT    R               COLHDG('Rate for' 'Limit Calculatio-
G001 A                                      n')
G001 A                                      REFFLD(SSPERD)
G007 A            CLMMRT    R               COLHDG('Tier rate' 'Month used-
G007 A                                      ' 'for Limit cal')
G007 A                                      REFFLD(SSCOU3)
G001 A            CCMAXL    R               COLHDG('Campaign Limit'-
G001 A                                       '(Approved)')
G001 A                                      REFFLD(SSAMT4)
G001 A*G003       CCREML    R               COLHDG('Campaign Limit'-
G001 A*G003                                  '(Approved)')
G001 A*G003                                 REFFLD(SSAMT4)
G001 A            CMXAPL    R               COLHDG('Campaign Limit'-
G001 A                                       '(Approved)')
G001 A                                      REFFLD(SSAMT4)
G001 A*G003       CRMXAP    R               COLHDG('Remaining Campaign'-
G001 A*G003                                  'Limit (Applied)')
G001 A*G003                                 REFFLD(SSAMT4)
G001 A            CMXACL    R               COLHDG('Campaign Limit'-
G001 A                                       '(Acceptance)')
G001 A                                      REFFLD(SSAMT4)
G001 A*G003       CRMXAC    R               COLHDG('Remaining Campaign'-
G001 A*G003                                  'Limit (Acceptance)')
G001 A*G003                                 REFFLD(SSAMT4)
G001 A            CMAXOD    R               COLHDG('Maximum Overdue %')
G001 A                                      REFFLD(SSPERD)
G001 A            CODAMT    R               COLHDG('Total overdue amount')
G001 A                                      REFFLD(SSAMT4)
G001 A            CODPER    R               COLHDG('Total overdue %')
G001 A                                      REFFLD(SSPERD)
G003 A            CAGEMA    R               COLHDG('Maximum Age')
G003 A                                      REFFLD(SSCOU3)
G003 A            CAGEMM    R               COLHDG('Maximum Age' 'Upon -
G003 A                                      maturity')
G003 A                                      REFFLD(SSCOU3)
G003 A            CMXYRC    R               COLHDG('Minimum Year' 'of -
G003 A                                      Employment' '(current)')
G003 A                                      REFFLD(SSCOU3)
G003 A            CMXYRT    R               COLHDG('Minimum Year' 'of -
G003 A                                      Employment' '(total)')
G003 A                                      REFFLD(SSCOU3)
G007 A            CWFBLP    R               COLHDG('Welfare a/c' 'bal-
G007 A                                      ance % limit ')
G001 A                                      REFFLD(SSPERD)
G001 A*****************************************************************
G001 A** Campaign Purpose Code Parameter - LNPRPS
G001 A*****************************************************************
G001 A            CPPCOD    R               COLHDG('Campaign' 'Code')
G001 A                                      REFFLD(SSCODA)
G001 A            CPPPUR    R               COLHDG('Purpose' 'Code')
G001 A                                      REFFLD(SSCOD2)
G001 A*****************************************************************
G001 A** Campaign Collateral  Code Parameter - LNPRPT
G001 A*****************************************************************
G001 A            CPCCOD    R               COLHDG('Campaign' 'Code')
G001 A                                      REFFLD(SSCODA)
G001 A            CPCCPD    R               COLHDG('Collateral' 'Code')
G001 A                                      REFFLD(SSCOLD)
G001 A*****************************************************************
G001 A** Campaign Tier Prepayment Parameter - LNPRPU
G001 A*****************************************************************
G001 A            CPTCOD    R               COLHDG('Campaign' 'Code')
G001 A                                      REFFLD(SSCODA)
G001 A            CPTSEQ    R               COLHDG('Seq No.')
G001 A                                      REFFLD(SSCOU3)
G001 A            CPTAMT    R               COLHDG('Amount')
G001 A                                      REFFLD(SSAMT4)
G001 A            CPTROM    R               COLHDG('Term(Fr)')
G001 A                                      REFFLD(SSCOU3)
G001 A            CPTTO     R               COLHDG('Term(To)')
G001 A                                      REFFLD(SSCOU3)
G001 A            CPTTMC    R               COLHDG('Term Code')
G001 A                                      REFFLD(SSCOD1)
G001 A            CPTRAT    R               COLHDG('Rate')
G001 A                                      REFFLD(SSPERD)
G001 A*****************************************************************
G001 A** Campaign Welfare Deposit  Parameter - LNPRPV
G001 A*****************************************************************
G001 A            CPDCOD    R               COLHDG('Campaign' 'Code')
G001 A                                      REFFLD(SSCODA)
G001 A            CPDACC    R               COLHDG('Deposit Account No')
G001 A                                      REFFLD(SSACCN)
G001 A            CPDACT    R               COLHDG('Deposit Account Type')
G001 A                                      REFFLD(SSACCT)
G001 A*****************************************************************
G001 A** Campaign Tiered rate Extension - LNPRPQE
G001 A*****************************************************************
G001 A            LDPMRV    R               COLHDG('Rate Variance' 'for Payment-
G001 A                                       Amount')
G001 A                                      REFFLD(SSPERD)
G001 A            LDPMRC    R               COLHDG('Rate Variance code' 'for Pa-
G001 A                                      yment Amount')
G001 A                                      REFFLD(SSCOD1)
G008 A            LDPMRT    R               COLHDG('Rate for' 'Payment Amount')
G008 A                                      REFFLD(SSPERD)
G008 A            LDPMRN    R               COLHDG('Rate Number' 'for' 'Payment-
G008 A                                       Amount')
G008 A                                      REFFLD(SSRATE)
G001 A*****************************************************************
G001 A** Occupation Welfare Parameter - LNPRPM
G004 A** Occupation Benefit Parameter - LNPRPM
G001 A*****************************************************************
G001 A            OCCCOD    R               COLHDG('Occupation Code')
G001 A                                      REFFLD(SSCODA)
G001 A            OCCCRV    R               COLHDG('Additional' 'Rate Variance')
G001 A                                      REFFLD(SSPERD)
G001 A            OCCCRC    R               COLHDG('Additional' 'Rate Variance -
G001 A                                      code')
G001 A                                      REFFLD(SSCOD1)
G003 A            OCARVT    R               COLHDG('Additional' 'Rate Variance -
G003 A                                      Term')
G003 A                                      REFFLD(SSCOU5)
G003 A            OCARVC    R               COLHDG('Additional' 'Rate Vari. -
G003 A                                      Term Code')
G003 A                                      REFFLD(SSCOD1)
G001 A            OMGFIN    R               COLHDG('Margin of Finance')
G001 A                                      REFFLD(SSPERD)
G001 A            OMAXTM    R               COLHDG('Maximum Term')
G001 A                                      REFFLD(SSTERM)
G001 A            OMAXTC    R               COLHDG('Maximum Term' 'Code')
G001 A                                      REFFLD(SSCOD1)
G001 A            OMINTM    R               COLHDG('Minimum Term')
G001 A                                      REFFLD(SSTERM)
G001 A            OMINTC    R               COLHDG('Minimum Term' 'Code')
G001 A                                      REFFLD(SSCOD1)
G003 A            OAGELM    R               COLHDG('Minimum Age')
G003 A                                      REFFLD(SSCOU3)
G001 A*G003       OAGEML    R               COLHDG('Maximum Age Limit')
G003 A            OAGEMA    R               COLHDG('Maximum Age')
G001 A                                      REFFLD(SSCOU3)
G003 A            OAGEMM    R               COLHDG('Maximum Age' 'Upon -
G003 A                                      maturity')
G003 A                                      REFFLD(SSCOU3)
G001 A            OSGCLM    R               COLHDG('Single Customer' 'Limit')
G001 A                                      REFFLD(SSAMT4)
G003 A            OMXYRC    R               COLHDG('Minimum Year' 'of -
G003 A                                      Employment' '(current)')
G003 A                                      REFFLD(SSCOU3)
G003 A            OMXYRT    R               COLHDG('Minimum Year' 'of -
G003 A                                      Employment' '(total)')
G003 A                                      REFFLD(SSCOU3)
G001 A*****************************************************************
G002 ** LNPHOL - Payment Holiday Month Parameter File
G002 A*****************************************************************
G002 A            LPHTYP    R               COLHDG('Fin Type')
G002 A                                      REFFLD(SSCODA)
G002 A            LPHCUR    R               COLHDG('Currency Type')
G002 A                                      REFFLD(SSCOD4)
G002 A            LPHJAN    R               COLHDG('January Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHFEB    R               COLHDG('February Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHMAR    R               COLHDG('March Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHAPR    R               COLHDG('April Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHMAY    R               COLHDG('May Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHJUN    R               COLHDG('June FLag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHJUL    R               COLHDG('July Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHAUG    R               COLHDG('August Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHSEP    R               COLHDG('September Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHOCT    R               COLHDG('October Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHNOV    R               COLHDG('November Flag')
G002 A                                      REFFLD(SSYON)
G002 A            LPHDEC    R               COLHDG('December Flag')
G002 A                                      REFFLD(SSYON)
G002 A*************************************************************************
G003 ** LNPRPW - CAMPAIGN MAXIMUM LIMIT TIER
G003 A*****************************************************************
G003 A            CTPCOD    R               COLHDG('Campaign' 'Code')
G003 A                                      REFFLD(SSCODA)
G003 A            CTSEQN    R               COLHDG('Seq No.')
G003 A                                      REFFLD(SSCOU3)
G003 A            CTFRAM    R               COLHDG('Tier Limit')
G003 A                                      REFFLD(SSAMT4)
G003 A            CTLPER    R               COLHDG('Limit' 'Percentage %')
G003 A                                      REFFLD(SSPERD)
G003 A*************************************************************************
G003 ** LNPRPWWK - CAMPAIGN MAXIMUM LIMIT TIER WORK FILE
G003 A*****************************************************************
G003 A            CTLMTP    R               COLHDG('Limit Status')
G003 A                                      REFFLD(SSCOD1)
G003 A            CTAMLM    R               COLHDG('Allocated' 'Tiered Limit')
G003 A                                      REFFLD(SSAMT4)
G003 A            CFUTLL    R               COLHDG('Utilised Limit')
G003 A                                      REFFLD(SSAMT4)
G006 A*****************************************************************
G006 A** GENERAL LOAN PARAMETER FILE EXTERNAL FILE- LNPARZ1
G006 A*****************************************************************
G006 A            LPZUSR    R               COLHDG('Spooling user ID')
G006 A                                      REFFLD(SSCODA)
G006 A            LPZRCD1   R               COLHDG('Reserved code 1')
G006 A                                      REFFLD(SSCODA)
G006 A            LPZRCD2   R               COLHDG('Reserved code 2')
G006 A                                      REFFLD(SSCODA)
G006 A            LPZRCD3   R               COLHDG('Reserved code 3')
G006 A                                      REFFLD(SSCODA)
G006 A            LPZRCD4   R               COLHDG('Reserved code 4')
G006 A                                      REFFLD(SSCODA)
G006 A            LPZRCD5   R               COLHDG('Reserved code 5')
G006 A                                      REFFLD(SSCODA)
G006 A            LPZRCD6   R               COLHDG('Reserved code 6')
G006 A                                      REFFLD(SSCOD1)
G006 A            LPZRCD7   R               COLHDG('Reserved code 7')
G006 A                                      REFFLD(SSCOD1)
G006 A            LPZRCD8   R               COLHDG('Reserved code 8')
G006 A                                      REFFLD(SSCOD1)
G006 A            LPZRCD9   R               COLHDG('Reserved code 9')
G006 A                                      REFFLD(SSCOD1)
G006 A            LPZRCD0   R               COLHDG('Reserved code 10')
G006 A                                      REFFLD(SSCOD1)
G006 A            LPZRAM1   R               COLHDG('Reserved AMT 1')
G006 A                                      REFFLD(SSAMT4)
G006 A            LPZRAM2   R               COLHDG('Reserved AMT 2')
G006 A                                      REFFLD(SSAMT4)
G006 A            LPZRAM3   R               COLHDG('Reserved AMT 3')
G006 A                                      REFFLD(SSAMT4)
G006 A            LPZRAM4   R               COLHDG('Reserved AMT 4')
G006 A                                      REFFLD(SSAMT4)
G006 A            LPZRAM5   R               COLHDG('Reserved AMT 5')
G006 A                                      REFFLD(SSAMT4)
G006 A            LPZRRT1   R               COLHDG('Reserved RATE 1')
G006 A                                      REFFLD(SSPERD)
G006 A            LPZRRT2   R               COLHDG('Reserved RATE 2')
G006 A                                      REFFLD(SSPERD)
G006 A            LPZRRT3   R               COLHDG('Reserved RATE 3')
G006 A                                      REFFLD(SSPERD)
G006 A            LPZRRT4   R               COLHDG('Reserved RATE 4')
G006 A                                      REFFLD(SSPERD)
G006 A            LPZRRT5   R               COLHDG('Reserved RATE 5')
G006 A                                      REFFLD(SSPERD)
G006 A            LPZRCT1   R               COLHDG('Reserved COUNTER 1')
G006 A                                      REFFLD(SSCOU3)
G006 A            LPZRCT2   R               COLHDG('Reserved COUNTER 2')
G006 A                                      REFFLD(SSCOU3)
G006 A            LPZRCT3   R               COLHDG('Reserved COUNTER 3')
G006 A                                      REFFLD(SSCOU3)
G006 A            LPZRCT4   R               COLHDG('Reserved COUNTER 4')
G006 A                                      REFFLD(SSCOU3)
G006 A            LPZRCT5   R               COLHDG('Reserved COUNTER 5')
G006 A                                      REFFLD(SSCOU3)
G007 A** C2C relationship consider 1 borrower - LNPRPN
G007 A*****************************************************************
G007 A            RLCREL    R               COLHDG('Relationship-
G007 A                                       Code' 'Owner Relationship')
G007 A                                      REFFLD(SSCOD2)
G010 A*****************************************************************
G010 A            POGRCD    R               COLHDG('ACC OPENING' +
G010 A                                      'MTH GRACE TO SET' +
G010 A                                      '1ST PMT DT')
G010 A                                      REFFLD(SSCOU5)
G010 A            POGRCC    R               COLHDG('ACC OPENING' +
G010 A                                      'MTH GRACE TO SET' +
G010 A                                      '1ST PMT DT CODE')
G010 A                                      REFFLD(SSCOD1)
     A******************************************************************
     A** GENERAL LOAN PARAMETER FILE EXTERNAL FILE- LNPVST
     A******************************************************************
K0001A*K0005      LPVSTS    R               COLHDG('VEHICAL STATUS CODE')
K0001A*K0005                                REFFLD(SSCOD3)
K0001A*K0005      LPVSTD    R               COLHDG('VEHICLE STATUS' +
K0001A*K0005                                'DESCRIPTION')
K0001A*K0005                                REFFLD(SSDES2)
K0005A            LPVSTS    R               COLHDG('VEHICAL STATUS CODE')
K0005A                                      REFFLD(SSCOU5)
K0005A            LPVSTD    R               COLHDG('VEHICLE STATUS' +
K0005A                                      'DESCRIPTION')
K0005A                                      REFFLD(SSDESC)
K0010A******************************************************************
K0010A** Color Code Parameter - LNVCLR
K0010A******************************************************************
K0010A            LVCLCD    R               COLHDG('Color Code')
K0010A                                      REFFLD(SSCOD3)
K0010A            LVCSDS    R               COLHDG('Color Description')
K0010A                                      REFFLD(SSDES2)
K0010A            LVCDES    R               COLHDG('Long Description')
K0010A                                      REFFLD(SSDESP)
K0010A            LVCLDS    R               COLHDG('Local Description')
K0010A                                      REFFLD(SSDESP)
K0010A******************************************************************
K0010A** Model Code Parameter - LNVMDL
K0010A******************************************************************
K0010A            LVMAKG    R               COLHDG('Make of Goods')
K0010A                                      REFFLD(SSCOD5)
K0010A            LVMODG    R               COLHDG('Model of Goods')
K0010A                                      REFFLD(SSCODF)
K0010A            LVMDES    R               COLHDG('Long Description')
K0010A                                      REFFLD(SSDESP)
K0010A            LVTYPE    R               COLHDG('Vehicle Type')
K0010A                                      REFFLD(SSCOD2)
K0010A            LVSTRY    R               COLHDG('Start Year')
K0010A                                      REFFLD(SSCOD4)
K0010A            LVLATY    R               COLHDG('Latest Year')
K0010A                                      REFFLD(SSCOD4)
K0010A            LVASTS    R               COLHDG('Active Status')
K0010A                                      REFFLD(SSDESB)
K0010A            LVSCTY    R               COLHDG('Source Type')
K0010A                                      REFFLD(SSCOD6)
K0010A******************************************************************
K0010A** Sub Model Code Parameter - LNVSMD
K0010A******************************************************************
K0010A            LVSMAK    R               COLHDG('Make of Goods')
K0010A                                      REFFLD(SSCOD5)
K0010A            LVSMOD    R               COLHDG('Model of Goods')
K0010A                                      REFFLD(SSCODF)
K0010A            LVSMOG    R               COLHDG('Sub Model of Goods')
K0010A                                      REFFLD(SSCOD8)
K0010A            LVSNAM    R               COLHDG('Sub' 'Model Description')
K0010A                                      REFFLD(SSDESP)
K0010A            LVSVEH    R               COLHDG('Vehicle Key')
K0010A                                      REFFLD(SSCOD8)
K0010A            LVSYEA    R               COLHDG('Year Group')
K0010A                                      REFFLD(SSCOD4)
K0010A            LVSMON    R               COLHDG('Month Group')
K0010A                                      REFFLD(SSCOD2)
K0010A            LVSAUT    R               COLHDG('Auto Type')
K0010A                                      REFFLD(SSDESP)
K0010A            LVSAUS    R               COLHDG('Sub Auto Type')
K0010A                                      REFFLD(SSDESP)
K0010A            LVSTYP    R               COLHDG('Vehicle Type')
K0010A                                      REFFLD(SSCOD2)
K0010A            LVSCUR    R               COLHDG('Current Release')
K0010A                                      REFFLD(SSCOD1)
K0010A            LVSRLY    R               COLHDG('Release Year')
K0010A                                      REFFLD(SSCOD4)
K0010A            LVSRLM    R               COLHDG('Release Month')
K0010A                                      REFFLD(SSCOD2)
K0010A            LVSIMP    R               COLHDG('Import Flag')
K0010A                                      REFFLD(SSCOD1)
K0010A            LVSLIM    R               COLHDG('Limited Edition')
K0010A                                      REFFLD(SSCOD1)
K0010A            LVSSRS    R               COLHDG('Series')
K0010A                                      REFFLD(SSDESS)
K0010A            LVSBDS    R               COLHDG('Body Style Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSBDC    R               COLHDG('Body Config Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSBAG    R               COLHDG('Badge Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSBAS    R               COLHDG('Badge' 'Secondary Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSEID    R               COLHDG('Extra Identification')
K0010A                                      REFFLD(SSDESS)
K0010A            LVSGTY    R               COLHDG('Gear Type Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSGNU    R               COLHDG('Gear Num')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSGLC    R               COLHDG('Gear Location Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSDNU    R               COLHDG('Door Num')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSSEC    R               COLHDG('Seat Capacity')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSENS    R               COLHDG('Engine Size')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSEND    R               COLHDG('Engine Desc.')
K0010A                                      REFFLD(SSCOD4)
K0010A            LVSCYL    R               COLHDG('Cylinders')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSDRI    R               COLHDG('Drive Description')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSIDC    R               COLHDG('Induction Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSFDE    R               COLHDG('Fuel Delivery Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSMDE    R               COLHDG('Method' 'Of Delivery Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSFTY    R               COLHDG('Fuel Type Desc.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSCAM    R               COLHDG('Cam Description.')
K0010A                                      REFFLD(SSDESC)
K0010A            LVSPOW    R               COLHDG('Power')
K0010A                                      REFFLD(SSAMT4)
K0010A            LVSPOF    R               COLHDG('Power RPM From')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSPOT    R               COLHDG('Power RPM To')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSTOR    R               COLHDG('Torque')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSTOF    R               COLHDG('Torque RPM From')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSTOT    R               COLHDG('Torque RPM To')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSWHE    R               COLHDG('Wheel Base')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSGVM    R               COLHDG('Gross Vehicle Mass')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSPAY    R               COLHDG('Pay Load')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSGCM    R               COLHDG('Gross' 'Combination Mass')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSKER    R               COLHDG('KERB Weight')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSTAR    R               COLHDG('TARE Mass')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSAKM    R               COLHDG('Average KM')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSGKM    R               COLHDG('Good KM')
K0010A                                      REFFLD(SSCOUA)
K0010A            LVSAWO    R               COLHDG('Avg Wholesale')
K0010A                                      REFFLD(SSAMT4)
K0010A            LVSARE    R               COLHDG('Avg Retail')
K0010A                                      REFFLD(SSAMT4)
K0010A            LVSGWO    R               COLHDG('Good Wholesale')
K0010A                                      REFFLD(SSAMT4)
K0010A            LVSGRE    R               COLHDG('Good Retail')
K0010A                                      REFFLD(SSAMT4)
K0010A            LVSNEP    R               COLHDG('New Price')
K0010A                                      REFFLD(SSAMT4)
K0010A            LVSEX1    R               COLHDG('Extra 1')
K0010A                                      REFFLD(SSDESB)
K0010A            LVSEX2    R               COLHDG('Extra 2')
K0010A                                      REFFLD(SSDESB)
K0010A            LVSEX3    R               COLHDG('Extra 3')
K0010A                                      REFFLD(SSDESB)
K0010A            LVSDRC    R               COLHDG('Data Source')
K0010A                                      REFFLD(SSDES1)
K0010A            LVSMST    R               COLHDG('Map Status')
K0010A                                      REFFLD(SSDES1)
K6401A******************************************************************
K6401A** LOAN PARAMETER FILE NAME INTERFACE
K6401A******************************************************************
K6401A            LPTYPE    R               COLHDG('LOAN' 'TYPE')
K6401A                                      REFFLD(SSPROD)
K6401A            LPCURT    R               COLHDG('CURRENCY' 'TYPE')
K6401A                                      REFFLD(SSCURC)
K6401A            LPFILN    R               COLHDG('Interface File name')
K6401A                                      REFFLD(SSNAML)
K6401A            LPSOUC    R               COLHDG('Source System')
K6401A                                      REFFLD(SSCODA)
K6401A******************************************************************
