      ****************************************************************
      *  SILVERLAKE SYSTEM FIELD REFERENCE                           *
      ****************************************************************
      *  SSFREF   is a part of Silverlake System (R)                 *
      *  (C) Copyright 1993, 1994                                    *
      *                 By:  Silverlake System Sdn. Bhd.             *
      *                      Floor 12A, Plaza IBM,                   *
      *                      No.1, Jalan Tun Mohd Fuad,              *
      *                      Taman Tun Dr. Ismail,                   *
      *                      60000 Kuala Lumpur, Malaysia            *
      ****************************************************************
      *  Created By:                                                 *
      *  Date      :                                                 *
      ****************************************************************
      *  Modification Logs:                                          *
      *  Name  Init   Date      Remarks                              *
      *  ----  -----  --------  -----------------------------------  *
      *  V10   SS01   06/01/10  V10 ENHANCEMENT                      *
      *  WLL   SS02   11/01/10  - ENVIRONMENT SETTING BY APPLICATION *
      *  WLL   SS03   12/01/10  - rename GLPAR7 as SSPAR7            *
      *                         - rename GLPAR9 as SSPAR9(shld use   *
      *                           Business Unit)                     *
      *                         - rename SSPRLB TO SSPARW            *
      *  WLL   SS05   03/02/10  - ADD SSPARS-System ID 10            *
      *                           ADD SSPART-Account Type Code       *
      *                           ADD SSPARI-System Interface ID     *
      *                           ADD SSCOUN-IDD                     *
      *  LTJ   SS06   10/04/10  - ADD SSPARH-Islamic Concept Code    *
      *                         - ADD SSPARJ-Islamic Concept Code    *
      *                           By Application                     *
      *  WLL   SS07   23/04/10  - SSJOBE -Batch Job Run Event Control*
      *                         - SSJOBB -Batch Job Run Event Bypass Control*
      *  LEL   SS08   23/04/10  - SSJOBL -Batch Job Run Job Log      *
      *  WLL   SS09   18/05/10  - cpy SSUSRP from BP
      *  AZR   SS10   31/05/10  - Chnage VTPRDC to 10A and add VTSTR8
      *  TST   SS11   03/06/10  - Add cheque clearing parameters:
      *                            a) SSCLRP - Clearing code
      *                            b) SSCLRQ - Cheque/clearing code linkage
      *  SRY   SS12   14/06/10  - Add SSBRCM - Application CM - CMS
      *                         - Add SSBRCS - Application CM - CMS
      *  WLL   SS13   07/07/10  - Add SSIRCB - Inter Region Country/Bank
      *  AZR   SS14   28/07/10  - Add SSCRSK - Country High Risk
      *  WLL   SS15   13/08/10  - add SSNOTP - Re-Con Number Type File
      **************************************************************************
      *  WLL   ST01   17/12/10  - Add new fld - SSRDMT, rd method    *
      *  WLL   R101   16/03/11  - EXTEND SSMNTN LENGTH               *
      *  WLL   R102   24/03/11  - SSJOBC GLOBAL CONTROL              *
      *  WLL   R103   06/04/11  - add rmrun dtaara                   *
      *  AZR   R104   09/04/11  - add journal files                  *
      *                           ( not using SSJGMS/SSJDMS)         *
      *  AZR   R105   19/04/11  - Add MBRUN and DSPRUN status        *
      *  AZR   R106   26/04/11  - Add SIBSRUN                        *
      *  AZR   R107   03/05/11  - Add file type ( Parameter/Data )   *
      *                         - Add Supervisor ID 2                *
      *  CKW   1P01   03/05/11  - Add previous date / time.          *
      *  AZR   R108   13/05/11  - Add sbs, jobq and cls info         *
      *  wll   R109   16/05/11  - Add ssdcid/ssapno/ssafno/ssrmno    *
      *  azr   R110   08/06/11  - Add backup field                   *
      *  AZR   R111   08/06/11  - Add new fld - SSRDMT, rd method    *
      *  AZR   R112   14/06/11  - Add new fld - SSCUTT, cut off time *
      *                         - Add new fld - SSEODZ1, Zone 1 dtaara*
      *                         - Add new fld - SSEODZ2, Zone 2 dtaara*
      *                         - Add new fld - SSEODZ3, Zone 3 dtaara*
      *                         - Add new fld - SSEODZ4, Zone 4 dtaara*
      *  AZR   R113   22/06/11  - Add new fld - SSENV                *
      *  WZX   R114   24/06/11  - Add new fld SSLDSC,SSSHDS for SSOFRT *
      *  wll   R115   13/07/11  - Add CMRUN/CMPRT                    *
      *  AZR   R116   15/07/11  - Add new fld - SSMSGQ               *
      *  TWC   R117   22/07/11  - Change Description to Cross Product*
      *  AZR   R118   27/09/11  - Add new file - SIBSPAR             *
      *  wll   R119   13/07/11  - Add CMRUN/CMPRT                    *
      *  wll   R120   10/11/11  - ssjobb/ssjobe str/end timestamp    *
      *  azr   R121   02/12/11  - app code 3 char                    *
      *  azr   R122   24/02/12  - add backup file                    *
      *  azr   R123   27/02/12  - add event control parameter        *
      *  DOL   T1001  21/08/12  - add ALTERNATE RATE GROUP CODE      *
      *  DOL   T1002  19/07/13  - ADD FILLER
      *  AMP   T1003  24/07/13  - add filter and SSCHME field        *
      *  SP    T1004  11/10/13  - Change NWCPNT to REFFLD(SSCOUB)    *
      *  SP    T1005  21/04/17  - Add SSDLYZ3 Flag                   *
      *  Pong  K1001  24/06/21  - Add SSFXWL - Special Exchange Rate *
      *                           by Wealth Grade                    *
      *  CHAK  K1002  06/07/21  - Add SSCIBR - Calendar iBOR(Foreign)*
      *  Pong  K1003  13/06/22  - Add SSPARY - PDPA Data Retention   *
      **************************************************************************
     A                                      REF(SILVERLAKE)
     A          R RSSFREF
     A                                      TEXT('SILVERLAKE system field -
     A                                      reference format')
     **
     **=========================================================================
     A* WORK FIELDS
     **=========================================================================
     A            ROW       R
     A                                      REFFLD(SSCOU3)
     A                                      COLHDG('Print control')
     A            COL       R
     A                                      REFFLD(SSCOU3)
     A                                      COLHDG('Print control')
     A            LSKIP     R
     A                                      REFFLD(SSCOD3)
     A                                      COLHDG('Print control')
     A            LSPACE    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Print control')
     A            RSKIP     R
     A                                      REFFLD(SSCOD3)
     A                                      COLHDG('Print control')
     A            RSPACE    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Print control')
     A            FCFC      R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('First character' 'control')
     A            PLINE     R
     A                                      REFFLD(SSPRTP)
     A                                      COLHDG('Print line')
     A            LEFT      R
     A                                      REFFLD(SSPRTH)
     A                                      COLHDG('Print line' 'left half')
     A            RIGHT     R
     A                                      REFFLD(SSPRTH)
     A                                      COLHDG('Print line' 'right half')
     A            SSTIME    R
     A                                      REFFLD(SSDAT4)
     A                                      COLHDG('Time')
     A            SSAMPM    R
     A                                      REFFLD(SSCOD2)
     A                                      COLHDG('Am/Pm')
     A            PERCT     R
     A                                      REFFLD(SSPERP)
     A                                      COLHDG('Percent')
     A            DSPPCT    R
     A                                      REFFLD(SSPERP)
     A                                      COLHDG('Percent')
     A            DSPCVR    R
     A                                      REFFLD(SSAMTA)
     A                                      COLHDG('Conversion rate')
     A            BEGDAT    R
     A                                      REFFLD(SSDAT8)
     A                                      COLHDG('Beginning date')
     A            ENDDAT    R
     A                                      REFFLD(SSDAT8)
     A                                      COLHDG('Ending date')
     A            TITLE     R
     A                                      REFFLD(SSPRTL)
     A                                      COLHDG('Title')
     A            APCODE    R
     A                                      REFFLD(SSCOD2)
     A                                      COLHDG('Application code')
     A            DELETE    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Delete code')
     A            SELECT    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Selection')
     A            OPTION    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Option')
     A            YORN      R
     A                                      REFFLD(SSCOD3)
     A                                      COLHDG('Yes or No')
     A            MODE      R
     A                                      REFFLD(SSCOD6)
     A                                      COLHDG('Processing mode')
     A                                      VALUES('Add' 'Change' -
     A                                      'Delete')
     A            PASSWD    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Password')
     A            CPYRIT    R
     A                                      REFFLD(SSCOPY)
     A                                      COLHDG('Silverlake Copyright')
     A* FILE INFORMATION DATA STRUCTURE
     A            IFFILO    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('File opened name')
     A            IFFMTN    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Format name')
     A*
     A* MAINTENANCE LOG STRUCTURE
SS01 A            MNLUID    R               COLHDG('Last Maint' 'User ID')
SS01 A                                      REFFLD(SSCODA)
SS01 A            MNLSID    R               COLHDG('Last Maint' 'Supr ID')
SS01 A                                      REFFLD(SSCODA)
SS01 A            MNLWID    R               COLHDG('Last Maint' 'Workstation')
SS01 A                                      REFFLD(SSJWID)
SS01 A            MNLDT8    R               COLHDG('Last Maint' 'Date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A            MNLTIM    R               COLHDG('Last Maint' 'Time')
SS01 A                                      REFFLD(SSTIME)
THS  A            MNLSRC    R               COLHDG('Last Maint' 'Source')
THS  A                                      REFFLD(SSCODA)
SS01 A            MNCUID    R               COLHDG('Created' 'User ID')
SS01 A                                      REFFLD(SSCODA)
SS01 A            MNCSID    R               COLHDG('Created' 'Supr ID')
SS01 A                                      REFFLD(SSCODA)
SS01 A            MNCWID    R               COLHDG('Created' 'Workstation')
SS01 A                                      REFFLD(SSJWID)
SS01 A            MNCDT8    R               COLHDG('Created' 'Date')
SS01 A                                      REFFLD(SSDAT8)
SS01 A            MNCTIM    R               COLHDG('Created' 'Time')
SS01 A                                      REFFLD(SSTIME)
THS  A            MNCSRC    R               COLHDG('Created' 'Source')
THS  A                                      REFFLD(SSCODA)
     A*
     A**************************************************************************
     ** PARAMETER FILES (QSYSPARDDS)
     A**************************************************************************
     **
     **=========================================================================
     A* BANK CONTROL INFO DATA STRUCTURE / LOCAL DATA AREA - SSAPAR/*LDA
     **=========================================================================
     A*
     A* PROCESSING PARAMETERS
     A            SSBANK    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Main' 'Bank identifier')
     A                                      CHECK(VN)
     A            SSBNKN    R
     A                                      REFFLD(SSBANK)
     A                                      COLHDG('Main' 'Bank number')
     A            SSUBNK    R
     A                                      REFFLD(SSBANK)
     A                                      COLHDG('User' 'Bank number')
     A            SSBRNN    R
     A                                      REFFLD(SSBRAN)
     A                                      COLHDG('Branch number')
     A            SSBNAM    R
     A                                      REFFLD(SSNAML)
     A                                      COLHDG('Bank name')
     A            SSBADD    R
     A                                      REFFLD(SSNAML)
     A                                      COLHDG('Bank address' 'line 1')
     A            SSBAD2    R
     A                                      REFFLD(SSNAML)
     A                                      COLHDG('Bank address' 'line 2')
     A            SSBCSZ    R
     A                                      REFFLD(SSNAML)
     A                                      COLHDG('Bank city state zip')
     A            SSBTEL    R
     A                                      REFFLD(SSTELE)
     A                                      COLHDG('Bank telephone' 'number')
     A            SSBTE2    R
     A                                      REFFLD(SSTELE)
     A                                      COLHDG('Bank telephone' 'number')
     A            SSBTE3    R
     A                                      REFFLD(SSTELE)
     A                                      COLHDG('Bank telephone' 'number')
     A            SSBRAT    R
     A                                      REFFLD(SSROUT)
     A                                      COLHDG('R & T' 'number')
     A                                      TEXT('Bank routing & transit nu-
     A                                      mber')
     A            SSBTIN    R
     A                                      REFFLD(SSIDNO)
     A                                      COLHDG('Bank ID number')
     A            SSBYRE    R
     A                                      REFFLD(SSDAT4)
     A                                      COLHDG('Bank year' 'end MM/DD')
     A            SSBWKE    R
     A                                      REFFLD(SSCOU1)
     A                                      COLHDG('Bank week' 'end code')
     A            SSBLED    R
     A                                      REFFLD(SSCOU1)
     A                                      COLHDG('Check' 'lead days')
     A            SSBRAN    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Branch' 'accounting')
R113 A            SSENV     R
R113 A                                      REFFLD(SSCOD2)
R113 A                                      COLHDG('Environment')
V503 A            SSBKLB    R
V503 A                                      REFFLD(SSBANK)
V503 A                                      COLHDG('Library list' 'bank no')
     A* Applications installed
     A            SSBRDD    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Demand' 'deposits' -
     A                                      'installed')
     A            SSBRLN    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Loans')
     A            SSBRCD    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Time' 'deposits')
     A            SSBRGL    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('General' 'ledger')
     A            SSBRCF    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Central information')
     A            SSBRBD    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Investments')
     A            SSBRSH    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Shareholder' 'accounting')
     A            SSBRSD    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Safe deposit' 'box')
     A            SSBRPD    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Item processing')
     A            SSBROD    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Overdraft' 'checking')
     A            SSBRAL    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Asset/liability' 'managemen-
     A                                      t')
     A            SSBRTL    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Teller' 'balancing')
     A            SSBRAU    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Remittance')
     A            SSBRLP    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Loan' 'pricing')
     A            SSBRRC    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Account' 'reconcilement')
     A            SSBRSW    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Sweep')
     A            SSBRFA    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Fixed' 'assets')
     A            SSBRAC    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('ACH')
     A            SSBRCT    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('ATM')
     A*SS01       SSBRML    R
SS01 A            SSBROL    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('OD In Loan')
     A            SSBRPP    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Accounts payable')
     A            SSBROC    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Manual accounts')
     A            SSBRTR    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Treasury System')
     A            SSBRPR    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Payroll')
     A            SSBRRP    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Share' 'financing')
     A            SSBREQ    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Auto funds' 'transfer')
     A            SSBRMF    R
     A                                      REFFLD(SSYON)
     A*R117                                 COLHDG('Microfiche')
R117 A                                      COLHDG('Cross Product')
WFO  A            SSBRRD    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Report distribution')
WFO  A            SSBRTF    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Trade finance')
WFO  A            SSBRSS    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Silverlake functions')
WFO  A            SSBRCC    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Credit card')
V002 A            SSBRAR    R
V002 A                                      REFFLD(SSYON)
V002 A                                      COLHDG('Account Receivable')
V88  A            SSBRAF    R
V88  A                                      REFFLD(SSYON)
V88  A                                      COLHDG('AFT Spooling')
V88  A            SSBRCX    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Collection')
SS01 A            SSBRCL    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Collateral & Limit' -
     A                                      'Management')
SS01 A            SSBRNP    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Non Performing' -
     A                                      'Management')
SS01 A            SSBRCR    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Central Reporting' -
     A                                      'Management')
SS12 A            SSBRCM    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Cash Management' -
     A                                      'System')
     A* Applications processing status
     A            SSBSDD    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Demand' 'deposits' -
     A                                      'status')
     A            SSBSLN    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Loans')
     A            SSBSCD    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Time' 'deposits')
     A            SSBSGL    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('General' 'ledger')
     A            SSBSCF    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Central information')
     A            SSBSBD    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Investments')
     A            SSBSSH    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Shareholder' 'accounting')
     A            SSBSSD    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Safe deposit' 'box')
     A            SSBSPD    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Item processing')
     A            SSBSOD    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Overdraft' 'checking')
     A            SSBSAL    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Asset/liability' 'managemen-
     A                                      t')
     A            SSBSTL    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Teller' 'balancing')
     A            SSBSAU    R
     A                                      REFFLD(SSCOD1)
     A*SS01                                 COLHDG('Audit')
SS01 A                                      COLHDG('Remittance')
     A            SSBSLP    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Loan' 'pricing')
     A            SSBSRC    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Account' 'reconcilement')
     A            SSBSSW    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Sweep')
     A            SSBSFA    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Fixed' 'assets')
     A            SSBSAC    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('ACH')
     A            SSBSCT    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('ATM')
     A*SS01       SSBSML    R
SS01 A            SSBSOL    R
     A                                      REFFLD(SSCOD1)
     A*SS01                                 COLHDG('Mortgage loan' 'servicing')
SS01 A                                      COLHDG('OD In Loan')
     A            SSBSPP    R
     A                                      REFFLD(SSCOD1)
     A*SS01                                 COLHDG('Prepaids & accruals')
SS01 A                                      COLHDG('Accounts Payable')
     A            SSBSOC    R
     A                                      REFFLD(SSCOD1)
     A*SS01                                 COLHDG('Official checks')
SS01 A                                      COLHDG('Manual Accounts')
     A            SSBSTR    R
     A                                      REFFLD(SSCOD1)
     A*SS01                                 COLHDG('Trust')
SS01 A                                      COLHDG('Treasury System')
     A            SSBSPR    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Payroll')
     A            SSBSRP    R
     A                                      REFFLD(SSCOD1)
     A*SS01                                 COLHDG('Repurchase' 'agreements')
SS01 A                                      COLHDG('Share Financing')
     A            SSBSEQ    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Auto funds' 'transfer')
     A            SSBSMF    R
     A                                      REFFLD(SSCOD1)
     A*R117                                 COLHDG('Microfiche')
R117 A                                      COLHDG('Cross Product')
WFO  A            SSBSRD    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Report distribution')
WFO  A            SSBSTF    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Trade finance')
WFO  A            SSBSSS    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Silverlake functions')
WFO  A            SSBSCC    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Credit card')
SS01 A            SSBSAF    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('AFT Spooling')
SS01 A            SSBSCX    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Collection')
SS01 A            SSBSCL    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Collateral & Limit' -
     A                                      'Management')
SS01 A            SSBSNP    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Non Performing' -
     A                                      'Management')
SS01 A            SSBSCR    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Central Reporting' -
     A                                      'Management')
SS12 A            SSBSCM    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Cash Management' -
     A                                      'System')
     A* Processing options
     A            SSITEM    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Item processing')
     A            SSPFTR    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('G/L run' 'same day')
     A            SSPANT    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Consider today' 'a float -
     A                                      day')
     A* Y=Current day is float day 1
     A* N=Next day is float day 1
     A            SSAT24    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('ATM processing' 'method')
     A            SSPTSC    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Sales tax on' 'service char-
     A                                      ge')
     A            SSPPSQ    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Use posting' 'sequence on -
     A                                      deposits')
     A            SSPBRT    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Branch totals' 'required')
     A            SSPODP    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Roll float' 'option')
     A* A=After processing
     A* B=Before processing - expires on current processing date
     A* C=Before processing - expires on next processing date
     A            SSPDEP    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Deposit statement' 'format')
     A* A=All-in-One
     A* C=Combined
     A* F=Free format
     A            SSPDDM    R
     A                                      REFFLD(SSCOD8)
     A                                      COLHDG('Not used')
     A            SSPSVM    R
     A                                      REFFLD(SSCOD8)
     A                                      COLHDG('Not used')
     A            SSPACH    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('ACH entry method')
     A* D=Diskette
     A* F=Transmission
     A* M=Manual
     A* T=Tape
     A            SSPMFO    R
     A                                      REFFLD(SSCOD1)
     A*R117                                 COLHDG('Microfiche option')
R117 A                                      COLHDG('Cross Product option')
     A* F=Transmission
     A* I=
     A* S=
     A* T=Tape
     **
ST01 A            SSRDMT    R
ST01 A                                      REFFLD(SSCOD1)
ST01 A                                      COLHDG('RD Method option')
ST01 A* O=On-Demand
ST01 A* A=all
     **
R111 A            SSBKIN    R
R111 A                                      REFFLD(SSCOD1)
R111 A                                      COLHDG('Backup Method')
R111 A* S=Save File
R111 A* F=FlashCopy
     **
R112 A            SSCUTT    R
R112 A                                      REFFLD(SSTIM6)
R112 A                                      COLHDG('Cut Off Time')
     **
R116 A**          SSMSGQ    R
R116 A**                                    REFFLD(SSNAME)
R116 A**                                    COLHDG('Message Queue')
     **-
T1004A            SSDLYZ3   R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Delay Waiting Zone 3')
     **-
     **
     A            SSPATM    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('ATM entry method')
     A* D=Diskette
     A* F=Transmission
     A* M=Manual
     A* T=Tape
     A*
V501 A            SSSPTF    R               REFFLD(SSCOD1)
V501 A                                      COLHDG('Interest' 'free' 'banking')
V505 A            SSMLDB    R               REFFLD(SSCOD1)
V505 A                                      COLHDG('Multiple' 'database')
V505 A            SSRTTP    R               REFFLD(SSCOD1)
V505 A                                      COLHDG('Master rate' 'type usage')
     A* R=Branch rate
     A* E=Enterprise rate
     A* I=Institute/Bank
     A* P=Product
     A*
V521 A            SSBTMO    R               REFFLD(SSCOD1)
V521 A                                      COLHDG('Batch run' 'mode')
V521 A* 'D'=Debugging mode
V521 A* ' '=Production mode
     A*
     A            SSPQCT    R
     A                                      REFFLD(SSCOD4)
     A                                      COLHDG('Queue control')
     A            SSACGC    R
     A                                      REFFLD(SSACGC)
     A                                      COLHDG('Accounting code')
     A            SSTSYS    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Teller system')
     A            SSAREL    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Silverlake' 'release level')
     A            SSAESC    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Pay escrow' 'interest')
     A            SSICUR    R
     A                                      REFFLD(SSCURC)
     A                                      COLHDG('Currency code')
     A            SSIDEC    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Decimal code')
     A            SSIDFM    R
     A                                      REFFLD(SSCOD3)
     A                                      COLHDG('Date format')
     A            SSAMSG    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Message' 'file name')
     A            SSIMCA    R
     A                                      REFFLD(SSYENO)
     A                                      COLHDG('Multi-currency')
     A            SSICOC    R
     A                                      REFFLD(SSSTA3)
     A                                      COLHDG('Country' 'code')
     A            SSISTC    R
     A                                      REFFLD(SSSTA3)
     A                                      COLHDG('State' 'code')
     A            SSINCN    R
     A                                      REFFLD(SSSTA3)
     A                                      COLHDG('Numeric Country' 'code')
     A*           SSJOBT    R
     A*                                     REFFLD(SSCOD1)
     A*                                     COLHDG('Job type')
     A*                                     VALUES('0' '1')
     A* 0=Batch
     A* 1=Interactive
     A            SSINWA    R
     A                                      REFFLD(SSYENO)
     A                                      COLHDG('N-way processing' 'active')
     A* *YES=N-way used
     A* *NO =N-way not used
     A*           SSRUNS    R
     A*                                     REFFLD(SSCODA)
     A*                                     COLHDG('Run' 'status')
     A* *RUN      =Run in progress
     A* *RERUN    =Rerun in progress
     A* *RESTART  =Restarted run in progress
     A* *CLEAR    =Run completed thru clear
     A* *INACTIVE =Run not in progress
     A            SSATMN    R
     A                                      REFFLD(SSCOU9)
     A                                      COLHDG('Bank ATM switch' -
     A                                      'number')
     A            SSIFRL    R
     A                                      REFFLD(SSYENO)
     A                                      COLHDG('Roll float' 'mode')
     A                                      TEXT('Roll float by transaction -
     A                                      branch')
     A            SSQFIL    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Outq file' 'name')
     A                                      TEXT('Qutput queue PF for spool -
     A                                      files')
V527 A            SSHBRN    R
V527 A                                      REFFLD(SSBRAN)
V527 A                                      COLHDG('Head office center')
P0001A***         SSADBU    R
P0001A***                                   REFFLD(SSCOD1)
P0001A***                                   COLHDG('ACU/DBU' 'Flag')
P0001A            SSTDIF    R
P0001A                                      REFFLD(SSCOD1)
P0001A                                      COLHDG('Time' 'Zone' -
P0001A                                      'Difference')
P0001A                                      VALUES(' ' '+' '-')
P0001A            SSTZHR    R
P0001A                                      REFFLD(SSCOU2)
P0001A                                      COLHDG('Hour' 'Difference')
P0001A            SSTZMN    R
P0001A                                      REFFLD(SSCOU2)
P0001A                                      COLHDG('Minute' 'Difference')
V88  A            SBTIMZ    R               COLHDG('Time Zone' -
V88  A                                      'Base on Branch')
V88  A                                      REFFLD(SSYON)
P0001A***         SSTAXE    R               REFFLD(SSCOD1)
P0001A***                                   COLHDG('Taxation' 'Calender' -
P0001A***                                   'Year End')
V88  A            SSCENS    R               REFFLD(SSCOD1)
V88  A                                      COLHDG('Century' 'Setting')
V88  A            SSCNPL    R               REFFLD(SSCOD1)
V88  A                                      COLHDG('Central' 'NPL' 'Tracking')
V88  A            SSADBU    R               REFFLD(SSCOD1)
V88  A                                      COLHDG('ACU/DBU' 'Flag')
V88  A            SSISLG    R               REFFLD(SSCOD1)
V88  A                                      COLHDG('Islamic' 'Book' 'Method')
V88  A            SSYOSR    R               REFFLD(SSCOD2)
V88  A                                      TEXT('Year to be showed on SCR&RPT')
V88  A                                      COLHDG('Year on' 'Screen&Report')
V88  A            SSLGID    R
V88  A                                      REFFLD(SSCOD3)
V88  A                                      COLHDG('Language' 'ID')
     A* E=Entity
     A* B=Branch
     A* G=GL Book
     A            JIWDNO    R
     A                                      REFFLD(SSCOU1)
     A                                      COLHDG('Day of' 'week number')
     A* 1=Sunday
     A* ...
     A* 7=Saturday
     A            SSUSRA    R
     A                                      REFFLD(SSDESX)
     A                                      COLHDG('Reserved' 'user area(256)')
T006 A            SSLANG    R               COLHDG('Multi Language')
T006 A                                      REFFLD(SSCOD1)
T006 A            SSNPOS    R               COLHDG('GL Post Negative Amt')
T006 A                                      REFFLD(SSCOD1)
IC001A            SSRBUY    R               COLHDG('Buy Rate Number')
IC001A                                      REFFLD(SSCOD1)
IC001A            SSRSEL    R               COLHDG('Sell Rate Number')
IC001A                                      REFFLD(SSCOD1)
IC001A            SSRMID    R               COLHDG('Mid Rate Number')
IC001A                                      REFFLD(SSCOD1)
IC001A            SSRDRC    R               COLHDG('Debit Cost' 'rate Number')
IC001A                                      REFFLD(SSCOD1)
IC001A            SSRCRC    R               COLHDG('Credit Cost' 'rate Number')
IC001A                                      REFFLD(SSCOD1)
V539 A            SSGLET    R               COLHDG('GL Entity Identifier')
V539 A                                      REFFLD(SSCOD2)
V539 A            SSGLBR    R               COLHDG('GL Branch Number')
V539 A                                      REFFLD(SSCOD5)
     ** TEMP CREATE FOR SSAPAR DUMMY
     A            SSFILL    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Filler 10 byte')
     A*
     **=========================================================================
     A* APPLICATION CODES - SSAPPL
     **=========================================================================
     A            SSACD2    R               COLHDG('App' 'code')
     A                                      REFFLD(SSCOD2)
     A                                      TEXT('Application code (2)')
     A            SSACD1    R               COLHDG('Account' 'type')
     A                                      REFFLD(SSACCT)
     A                                      TEXT('Account type code (1)')
     A            SSACDM    R               COLHDG('Application' 'maintenance c-
     A                                      ode')
     A                                      REFFLD(SSNAME)
     A            SSADSC    R               COLHDG('Application' 'description')
     A                                      REFFLD(SSDESM)
     A            SSATXT    R               COLHDG('Application text')
     A                                      REFFLD(SSDESC)
     A            SSADI8    R               COLHDG('Date installed')
     A                                      REFFLD(SSDAT8)
     A            SSAINT    R               COLHDG('Auto G/L' 'interface')
     A                                      REFFLD(SSYON)
     A                                      TEXT('Automatic G/L interface')
     A            SSAFOL    R               COLHDG('First/last' 'day option')
     A                                      REFFLD(SSCOD1)
     A* F=First
     A* L=Last
     A            SSAGNO    R               COLHDG('Account group' 'used')
     A                                      REFFLD(SSYON)
C005 A            SSAGBL    R               COLHDG('Group balance' 'used')
C005 A                                      REFFLD(SSYON)
     A            SSAROT    R               COLHDG('Round/truncate' 'option')
     A                                      REFFLD(SSCOD1)
     A* R=Round
     A* T=Truncate
     A            SSAAAA    R               COLHDG('Automatic' 'A/C no')
     A                                      REFFLD(SSYON)
     A            SSAMOD    R               COLHDG('Account' 'number' 'modulus')
     A                                      REFFLD(SSNAME)
V5001A            SSABOR    R               COLHDG('Use' 'branch' 'rate')
     A                                      REFFLD(SSCOD1)
OS001A            SSPACD    R               REFFLD(SSCOD2)
|    A                                      COLHDG('Appl' 'code')
|    A                                      TEXT('Application code')
|    A            SSPAFT    R               REFFLD(SSDESM)
|    A                                      COLHDG('New Data' 'Numeric')
|    A            SSPBEF    R               REFFLD(SSDESM)
|    A                                      COLHDG('Old Data' 'Numeric')
|    A            SSPFLD    R               COLHDG('Field' 'Description')
|    A                                      TEXT('Field Description')
|    A                                      REFFLD(SSDESC)
|    A            SSPSRC    R               COLHDG('Source')
|    A                                      TEXT('Source')
|    A                                      REFFLD(SSCOD3)
|    A            SSPSKP    R               COLHDG('Skip' 'Logging')
|    A                                      TEXT('Skip Logging')
|    A                                      REFFLD(SSCOD1)
|    A            SSKLEN    R               COLHDG('Key' 'Length')
|    A                                      TEXT('Key Length')
|    A                                      REFFLD(SSCOU3)
|    A            SSKNUM    R               COLHDG('No' 'of' 'Keys')
|    A                                      TEXT('No of Keys')
OS001A                                      REFFLD(SSCOU3)
V88  A            SSZTIM    R               COLHDG('System' 'Time')
SS01 A                                      REFFLD(SSTIME)
     **
     **=========================================================================
     A* TOTAL BANK CAPITAL FUNDS - SSCFUN
     **=========================================================================
     A            JCBANK    R               COLHDG('Bank Number')
     A                                      REFFLD(SSBANK)
     A            JCBRN     R               COLHDG('Branch Number')
     A                                      REFFLD(SSBRAN)
     A            JCCFUN    R               COLHDG('Capital Funds')
     A*** V002                              REFFLD(SSAMTD)
V002 A                                      REFFLD(SSAMT5)
     A            JCLMN8    R               COLHDG('Date Last' 'Maintenance')
     A                                      REFFLD(SSDAT8)
     A            JCFIS     R               COLHDG('FIS Company Code')
     A                                      REFFLD(SSCOD4)
     A            JCCAGA    R               COLHDG('Fin Inst Code')
     A                                      REFFLD(SSCOD3)
C001 A            JCFPCT    R               COLHDG('SCL %')
C001 A                                      REFFLD(SSPERD)
C001 A            JCLARG    R               COLHDG('Large loan %')
C001 A                                      REFFLD(SSPERD)
C001 A            JCLRGA    R               COLHDG('Large loan amount')
C001 A                                      REFFLD(SSAMTB)
äW004A            JCFCYL    R               COLHDG('Foregin' 'Currency limit')
äW004A                                      REFFLD(SSAMTB)
äW004A            JCFCYC    R               COLHDG('Foregin' 'Currency Code')
äW004A                                      REFFLD(SSCURC)
äW004A            JCSACC    R               COLHDG('SA Staff' 'Account Allowed')
äW004A                                      REFFLD(SSCOU3)
äW004A            JCCDTL    R               COLHDG('FD Staff' 'Max. Limit')
äW004A                                      REFFLD(SSAMTB)
äW004A            JCCDGL    R               COLHDG('FD SuperGroup' 'Agg. Limit')
äW004A                                      REFFLD(SSAMTB)
C001 A            JCMAXL    R               COLHDG('Overdraft' 'maximum limit')
C001 A                                      REFFLD(SSAMTB)
I002 A            JCCTAX    R               COLHDG('Corporate' 'Tax')
I002 A***                                   REFFLD(SSRATE)
I002 A                                      REFFLD(SSPERD)
I005 A            JCCDSN    R               COLHDG('Bank/Branch' 'CDS number')
I005 A                                      REFFLD(SSNAMS)
V511 A            JCIAL     R               COLHDG('Initial' 'Allowance')
V511 A                                      REFFLD(SSPERD)
V511 A            JCMCAL    R               COLHDG('Max Capital' 'Allowance')
V511 A                                      REFFLD(SSAMT4)
V511 A            JCSUMA    R               COLHDG('% Var.' 'in sum assured')
V511 A                                      REFFLD(SSPERD)
V511 A            JCDEP1    R               COLHDG('Depreciation rate' '1st yr-
V511 A                                       Renewed')
V511 A                                      REFFLD(SSPERD)
V511 A            JCDEP2    R               COLHDG('Depreciation rate' '2nd yr-
V511 A                                       Renewed')
V511 A                                      REFFLD(SSPERD)
V511 A            JCDEP3    R               COLHDG('Depreciation rate' '3rd yr-
V511 A                                       Renewed')
V511 A                                      REFFLD(SSPERD)
V511 A            JCDEP4    R               COLHDG('Depreciation rate' '4th yr-
V511 A                                       Renewed')
V511 A                                      REFFLD(SSPERD)
V511 A            JCVASS    R               COLHDG('Variation in' 'Sum Assured -
V511 A                                      %')
V511 A                                      REFFLD(SSPERD)
V528 A            JCCFRN    R               COLHDG('Cost Of' 'Fund')
V528 A                                      REFFLD(SSRATE)
W0001A            JCISBL    R               COLHDG('Internal SCL %')
W0001A                                      REFFLD(SSPERD)
W0001A            JCGSBL    R               COLHDG('Banking Group' 'SBL')
W0001A                                      REFFLD(SSAMT4)
SS05 A            JCMSHP    R               COLHDG('Min Shareholding %' -
V511 A                                      'For SCL Calc')
SS05 A                                      REFFLD(SSPERD)
     **
     **=========================================================================
TF   A* COUNTRY/CURRENCY HOLIDAY - SSCHOL
     **=========================================================================
SS01 A**          SSCCOU    R               COLHDG('Country' 'Code')
SS01 A**                                    REFFLD(SSSTA3)
TF   A            SSCCUR    R               COLHDG('Currency')
TF   A                                      REFFLD(SSCURC)
TF   A            SSCHL8    R               COLHDG('Holiday date')
TF   A                                      REFFLD(SSDAT8)
TF   A            SSCHDS    R               COLHDG('Holiday' 'Description')
TF   A                                      REFFLD(SSDESM)
     **
     **=========================================================================
     A* CALENDAR BUILD HOLIDAYS - SSCLDH
     **=========================================================================
     A            CLHTYP    R               COLHDG('Holiday' 'type')
     A                                      REFFLD(SSCOD1)
     A* A=All purposes holiday
     A* B=Business day holiday
     A* P=Processing day holiday
     A            CLHFRC    R               COLHDG('Holiday' 'frequency code')
     A                                      REFFLD(SSCOD1)
     A* Y=Occurs same date each year
     A            CLHDSC    R               COLHDG('Holiday' 'description')
     A                                      REFFLD(SSDESS)
     A            CLHTXT    R               COLHDG('Holiday' 'text')
     A                                      REFFLD(SSDESC)
     **
     **=========================================================================
     A* CALENDAR - SSCLDD
     **=========================================================================
     A            CLSDA8    R               COLHDG('Calender' 'Date')
     A                                      REFFLD(SSDAT8)
     A            CLWDAX    R               COLHDG('Day of week' 'name')
     A                                      REFFLD(SSCOD9)
     A            CLWDAN    R               COLHDG('Day of week' 'number')
     A                                      REFFLD(SSCOU1)
     A* 1=SUNDAY
     A* 7=SATURDAY
     A            CLMONX    R               COLHDG('Month' 'name')
     A                                      REFFLD(SSCOD9)
     A            CLMONN    R               COLHDG('Month' 'number')
     A                                      REFFLD(SSCOU2)
     A            CLYEAR    R               COLHDG('Year')
     A                                      REFFLD(SSDAT4)
     A            CLLEAP    R               COLHDG('Leap year' 'flag')
     A                                      REFFLD(SSCOD1)
     A* Y=Leap year
     A* N=Not leap year
     A            CLCENT    R               COLHDG('Century')
     A                                      REFFLD(SSDAT2)
     A*???        CLJPRD    R               COLHDG('Julian period' 'date')
     A*???                                  REFFLD(SSDAT7)
     A            CLTEXT    R               COLHDG('Date text')
     A                                      REFFLD(SSDESS)
     **
     **=========================================================================
     A* PROCESSING CALENDAR BUILD PARAMETERS - SSCLDP
     **=========================================================================
     A            CBYEAR    R               COLHDG('Calendar year')
     A                                      REFFLD(SSDAT4)
     A            CBMON     R               COLHDG('Mon processing')
     A                                      REFFLD(SSYON)
     A            CBMONB    R               COLHDG('Mon business')
     A                                      REFFLD(SSYON)
     A            CBTUE     R               COLHDG('Tue processing')
     A                                      REFFLD(SSYON)
     A            CBTUEB    R               COLHDG('Tue business')
     A                                      REFFLD(SSYON)
     A            CBWED     R               COLHDG('Wed processing')
     A                                      REFFLD(SSYON)
     A            CBWEDB    R               COLHDG('Wed business')
     A                                      REFFLD(SSYON)
     A            CBTHU     R               COLHDG('Thu processing')
     A                                      REFFLD(SSYON)
     A            CBTHUB    R               COLHDG('Thu business')
     A                                      REFFLD(SSYON)
     A            CBFRI     R               COLHDG('Fri processing')
     A                                      REFFLD(SSYON)
     A            CBFRIB    R               COLHDG('Fri business')
     A                                      REFFLD(SSYON)
     A            CBSAT     R               COLHDG('Sat processing')
     A                                      REFFLD(SSYON)
     A            CBSATB    R               COLHDG('Sat business')
     A                                      REFFLD(SSYON)
     A            CBSUN     R               COLHDG('Sun processing')
     A                                      REFFLD(SSYON)
     A            CBSUNB    R               COLHDG('Sun business')
     A                                      REFFLD(SSYON)
     A            CBHD01    R               COLHDG('Holiday 1')
     A                                      REFFLD(SSDAT8)
     A            CBHD02    R               COLHDG('Holiday 2')
     A                                      REFFLD(SSDAT8)
     A            CBHD03    R               COLHDG('Holiday 3')
     A                                      REFFLD(SSDAT8)
     A            CBHD04    R               COLHDG('Holiday 4')
     A                                      REFFLD(SSDAT8)
     A            CBHD05    R               COLHDG('Holiday 5')
     A                                      REFFLD(SSDAT8)
     A            CBHD06    R               COLHDG('Holiday 6')
     A                                      REFFLD(SSDAT8)
     A            CBHD07    R               COLHDG('Holiday 7')
     A                                      REFFLD(SSDAT8)
     A            CBHD08    R               COLHDG('Holiday 8')
     A                                      REFFLD(SSDAT8)
     A            CBHD09    R               COLHDG('Holiday 9')
     A                                      REFFLD(SSDAT8)
     A            CBHD10    R               COLHDG('Holiday 10')
     A                                      REFFLD(SSDAT8)
     A            CBHD11    R               COLHDG('Holiday 11')
     A                                      REFFLD(SSDAT8)
     A            CBHD12    R               COLHDG('Holiday 12')
     A                                      REFFLD(SSDAT8)
     A            CBHD13    R               COLHDG('Holiday 13')
     A                                      REFFLD(SSDAT8)
     A            CBHD14    R               COLHDG('Holiday 14')
     A                                      REFFLD(SSDAT8)
     A            CBHD15    R               COLHDG('Holiday 15')
     A                                      REFFLD(SSDAT8)
     A            CBHD16    R               COLHDG('Holiday 16')
     A                                      REFFLD(SSDAT8)
     A            CBHD17    R               COLHDG('Holiday 17')
     A                                      REFFLD(SSDAT8)
     A            CBHD18    R               COLHDG('Holiday 18')
     A                                      REFFLD(SSDAT8)
     A            CBHD19    R               COLHDG('Holiday 19')
     A                                      REFFLD(SSDAT8)
     A            CBHD20    R               COLHDG('Holiday 20')
     A                                      REFFLD(SSDAT8)
     **
     **=========================================================================
     A* PROCESSING CALENDAR - SSCLDR
     **=========================================================================
T004 A            CBNKNO    R               COLHDG('Bank number')
T004 A                                      REFFLD(SSBANK)
     A            CBRNBR    R               COLHDG('Calendar branch')
     A                                      REFFLD(SSBRAN)
     A            CDATE8    R               COLHDG('Current processing' 'date')
     A                                      REFFLD(SSDAT8)
     A            CDYEAR    R               COLHDG('Calendar year')
     A                                      REFFLD(SSDAT4)
     A            CWDAY     R               COLHDG('Day of week' 'name')
     A                                      REFFLD(SSCOD9)
     A            CMONTH    R               COLHDG('Month' 'name')
     A                                      REFFLD(SSCOD9)
     A            PRODAY    R               COLHDG('Processing day' 'flag')
     A                                      REFFLD(SSYON)
     A            BUSDAY    R               COLHDG('Business day' 'flag')
     A                                      REFFLD(SSYON)
     A            PROSTM    R               COLHDG('Process statements')
     A                                      REFFLD(SSYON)
     A            DETDDA    R               COLHDG('Process DDA' 'Dormant Fees')
     A                                      REFFLD(SSYON)
     A            DETSAV    R               COLHDG('Process SAV' 'Dormant Fees')
     A                                      REFFLD(SSYON)
äW005A            UMASBM    R               COLHDG('Unclaim' 'summission date')
äW005A                                      REFFLD(SSYON)
     A            DETXMS    R               COLHDG('Day of' 'week number')
     A                                      REFFLD(SSCOU1)
     A* 1=Sunday
     A* 2=Monday
     A* 3=Tuesday
     A* 4=Wednesday
     A* 5=Thursday
     A* 6=Friday
     A* 7=Saturday
     A            ENDCK8    R               COLHDG('Ending check date')
     A                                      REFFLD(SSDAT8)
     A            TRIOPT    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Reorganize' 'scheme')
v88  A            HKPOPT    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Housekeep' 'scheme')
v88  A            CLRRS1    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Reserve' '1')
v88  A            CLRRS2    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Reserve' '2')
v88  A            CLRRS3    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Reserve' '3')
     A            DETCDS    R
     A                                      REFFLD(SSCOD1)
C003 A                                      COLHDG('Process G/L' 'revaluation')
     A            DETLON    R               COLHDG('Process escrow' -
     A                                      'interest credit')
     A                                      REFFLD(SSYON)
     A            PRTPDR    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Process G/L closing')
     A            PRTACR    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Not used')
     A            NOGLTB    R
     A                                      REFFLD(SSCOU3)
     A                                      COLHDG('Not used')
     A            NOGLBS    R
     A                                      REFFLD(SSCOU3)
     A                                      COLHDG('Not used')
     A            NOGLIS    R
     A                                      REFFLD(SSCOU3)
     A                                      COLHDG('Not used')
     A            NOGLCS    R
     A                                      REFFLD(SSCOU3)
     A                                      COLHDG('Not used')
     A            DEPSTS    R               COLHDG('Deposits processed')
     A                                      REFFLD(SSYON)
     A            CDSSTS    R               COLHDG('C/D processed')
     A                                      REFFLD(SSYON)
     A            LONSTS    R               COLHDG('Loans processed')
     A                                      REFFLD(SSYON)
     A            GLESTS    R               COLHDG('G/L processed')
     A                                      REFFLD(SSYON)
     A            CTEXT     R               COLHDG('Current date text')
     A                                      REFFLD(SSDESS)
     A            PROLS8    R               COLHDG('Last processing date')
     A                                      REFFLD(SSDAT8)
     A            PRONX8    R               COLHDG('Next processing date')
     A                                      REFFLD(SSDAT8)
     A            NODLTC    R               COLHDG('Days last to current')
     A                                      REFFLD(SSCOU1)
     A            NODCTN    R               COLHDG('Days current to next')
     A                                      REFFLD(SSCOU1)
     A            NODREM    R               COLHDG('Days left in period')
     A                                      REFFLD(SSCOU1)
     A            NODADV    R               COLHDG('Days advanced' 'in period')
     A                                      REFFLD(SSCOU1)
     A            NODCHK    R               COLHDG('Days in advance' 'for check-
     A                                       print')
     A                                      REFFLD(SSCOU3)
     A            HOLDAY    R               COLHDG('Holiday')
     A                                      REFFLD(SSYON)
     A            CEOW      R               COLHDG('End of week')
     A                                      REFFLD(SSYON)
     A            CEOM      R               COLHDG('End of month')
     A                                      REFFLD(SSYON)
     A            CEOQ      R               COLHDG('End of quarter')
     A                                      REFFLD(SSYON)
     A            CEOY      R               COLHDG('End of year')
     A                                      REFFLD(SSYON)
     A            CROW      R               COLHDG('Beginning of week')
     A                                      REFFLD(SSYON)
     A            CROM      R               COLHDG('Beginning of month')
     A                                      REFFLD(SSYON)
     A            CROQ      R               COLHDG('Beginning of quarter')
     A                                      REFFLD(SSYON)
     A            CROY      R               COLHDG('Beginning of year')
     A                                      REFFLD(SSYON)
C013 A* BUSINESS DAYS OF JULIAN DATES
C013 A            BDAYNO    R               COLHDG('No of business' 'days')
C013 A                                      REFFLD(SSCOU3)
     **
     **=========================================================================
V509 A* State Calendar Holiday File - SSCLSH
     **=========================================================================
V509 A            STHTYP    R               COLHDG('Holiday type code')
V509 A                                      REFFLD(SSCOD1)
V509 A            STHFRC    R               COLHDG('Holiday frequency')
V509 A                                      REFFLD(SSCOD1)
V509 A            STHDSC    R               COLHDG('Holiday description')
V509 A                                      REFFLD(SSDESM)
V509 A            STHTXT    R               COLHDG('Holiday text')
V509 A                                      REFFLD(SSDESC)
N001 A            STCCTR    R               COLHDG('Clearing Center')
 |   A                                      REFFLD(SSCODA)
 |   A            STHDT8    R               COLHDG('Holiday Date(ddmmyy)')
N001 A                                      REFFLD(SSDAT8)
     **
     **=========================================================================
V509 A* State Calendar Processing Flag File  - SSCLST
     **=========================================================================
V509 A            STMON     R               COLHDG('Mon processing')
V509 A                                      REFFLD(SSCOD1)
V509 A            STMONB    R               COLHDG('Mon business')
V509 A                                      REFFLD(SSCOD1)
V509 A            STTUE     R               COLHDG('Tue processing')
V509 A                                      REFFLD(SSCOD1)
V509 A            STTUEB    R               COLHDG('Tue business')
V509 A                                      REFFLD(SSCOD1)
V509 A            STWED     R               COLHDG('Wed processing')
V509 A                                      REFFLD(SSCOD1)
V509 A            STWEDB    R               COLHDG('Wed business')
V509 A                                      REFFLD(SSCOD1)
V509 A            STTHU     R               COLHDG('Thu processing')
V509 A                                      REFFLD(SSCOD1)
V509 A            STTHUB    R               COLHDG('Thu business')
V509 A                                      REFFLD(SSCOD1)
V509 A            STFRI     R               COLHDG('Fri processing')
V509 A                                      REFFLD(SSCOD1)
V509 A            STFRIB    R               COLHDG('Fri business')
V509 A                                      REFFLD(SSCOD1)
V509 A            STSAT     R               COLHDG('Sat processing')
V509 A                                      REFFLD(SSCOD1)
V509 A            STSATB    R               COLHDG('Sat business')
V509 A                                      REFFLD(SSCOD1)
V509 A            STSUN     R               COLHDG('Sun processing')
V509 A                                      REFFLD(SSCOD1)
V509 A            STSUNB    R               COLHDG('Sun business')
V509 A                                      REFFLD(SSCOD1)
     **
     **=========================================================================
     A* COUNTRY INFORMATION - SSCOUN
     **=========================================================================
     A            SSCCOC    R               COLHDG('Country' 'code')
     A                                      REFFLD(SSSTA3)
     A            SSCCCY    R
     A                                      REFFLD(SSCURC)
     A                                      COLHDG('Currency code')
SS04 A            SSCNCN    R               COLHDG('Numeric' 'Country code')
     A                                      REFFLD(SSCNCN)
     A            SSCNAM    R               COLHDG('Country' 'name')
     A                                      REFFLD(SSNAMS)
     A            SSCSUB    R               COLHDG('Country' 'subdivision')
     A                                      REFFLD(SSNAMS)
     A            SSCTXT    R               COLHDG('Country' 'text')
     A                                      REFFLD(SSDESC)
TF   A            SSCREM    R               COLHDG('Std Enroute' 'Remittance')
TF   A                                      REFFLD(SSCOU3)
SS05 A            SSIDDC    R               COLHDG('Int Direct' -
SS05 A                                      'Dialling Code')
SS05 A                                      REFFLD(SSCOU4)
     A            SSCAFM    R               COLHDG('Country' 'address' 'format')
     A                                      REFFLD(SSCOD1)
V001 A            SSCMON    R               COLHDG('Monday' 'bus day')
V001 A                                      REFFLD(SSCOD1)
V001 A            SSCTUE    R               COLHDG('Tuesday' 'bus day')
V001 A                                      REFFLD(SSCOD1)
V001 A            SSCWED    R               COLHDG('Wednesday' 'bus day')
V001 A                                      REFFLD(SSCOD1)
V001 A            SSCTHU    R               COLHDG('Thursday' 'bus day')
V001 A                                      REFFLD(SSCOD1)
V001 A            SSCFRI    R               COLHDG('Friday' 'bus day')
V001 A                                      REFFLD(SSCOD1)
V001 A            SSCSAT    R               COLHDG('Saturday' 'bus day')
V001 A                                      REFFLD(SSCOD1)
V001 A            SSCSUN    R               COLHDG('Sunday' 'bus day')
V001 A                                      REFFLD(SSCOD1)
SS14 A            SSCRSK    R               COLHDG('Country High Risk')
SS14 A                                      REFFLD(SSCOD1)
     A* 1=Postal code/city-state country
     A* 2=City/state/zip code (USA format)
     **
     **=========================================================================
     A* BANK/BRANCH PARAMETERS - SSDATA
     **=========================================================================
     A*
     A            JDIDST    R               COLHDG('Information status')
     A                                      REFFLD(SSREID)
     A            JDBANK    R               COLHDG('Bank number')
     A                                      REFFLD(SSBANK)
     A            JDBR      R               COLHDG('Branch number')
     A                                      REFFLD(SSBRAN)
     A            JDMBR     R               COLHDG('Main' 'Branch number')
     A                                      REFFLD(SSBRAN)
     A            JDBRID    R               COLHDG('Branch ID')
     A                                      REFFLD(SSNAME)
     A            JDNAME    R
     A                                      REFFLD(SSDESC)
     A                                      COLHDG('Bank/branch name')
     A            JDBNAL    R
     A                                      REFFLD(SSNAML)
     A                                      COLHDG('Address' 'line 1')
     A            JDADDR    R
     A                                      REFFLD(SSNAML)
     A                                      COLHDG('Address' 'line 2')
     A            JDCSZ     R
     A                                      REFFLD(SSNAML)
     A                                      COLHDG('Address line 5')
     A            JDTAXN    R               COLHDG('Bank/branch' 'ID number')
     A                                      REFFLD(SSIDNO)
V510 A            JDTAX2    R               COLHDG('SPTF branch' 'ID number')
V510 A                                      REFFLD(SSIDNO)
     A            JDTELE    R               COLHDG('Telephone number')
     A                                      REFFLD(SSTELE)
     A            JDTEL2    R               COLHDG('Telephone number')
     A                                      REFFLD(SSTELE)
     A            JDTEL3    R               COLHDG('Fax number')
     A                                      REFFLD(SSTELE)
     A            JDBRAT    R
     A                                      REFFLD(SSROUT)
     A                                      COLHDG('R & T' 'number')
     A                                      TEXT('Bank routing & transit nu-
     A                                      mber')
     A            JDBCAP    R               COLHDG('Total' 'capital')
     A                                      REFFLD(SSAMT5)
     A            JDTREN    R               COLHDG('Year end')
     A                                      REFFLD(SSDAT4)
     A            JDWKEN    R               COLHDG('Week ending day')
     A                                      REFFLD(SSCOD9)
     A            JDWKND    R               COLHDG('Week ending' 'day number')
     A                                      REFFLD(SSCOU1)
     A* 1=Sunday
     A* 2=Monday
     A* 3=Tuesday
     A* 4=Wednesday
     A* 5=Thursday
     A* 6=Friday
     A* 7=Saturday
     A            JDBRAN    R               COLHDG('Branch accounting')
     A                                      REFFLD(SSYON)
     A            JDCUTT    R               COLHDG('Branch cutoff time')
     A                                      REFFLD(SSTIM6)
     A            JDOPN8    R               COLHDG('Branch opened date')
     A                                      REFFLD(SSDAT8)
     A            JDLEAD    R               COLHDG('Bank check lead days')
     A                                      REFFLD(SSCOU1)
     A* MODULUS PGMS
     A            JDMODD    R               COLHDG('Demand modulus')
     A                                      REFFLD(SSNAME)
     A            JDMODS    R               COLHDG('Savings modulus')
     A                                      REFFLD(SSNAME)
     A            JDMODX    R               COLHDG('Club modulus')
     A                                      REFFLD(SSNAME)
     A            JDMODT    R               COLHDG('Time modulus')
     A                                      REFFLD(SSNAME)
     A            JDMODL    R               COLHDG('Loan modulus')
     A                                      REFFLD(SSNAME)
     A            JDMODG    R               COLHDG('G/L modulus')
     A                                      REFFLD(SSNAME)
     A            JDMODC    R               COLHDG('CIF modulus')
     A                                      REFFLD(SSNAME)
     A            JDMODO    R               COLHDG('ODP modulus')
     A                                      REFFLD(SSNAME)
     A*
     A            JDSTAX    R               COLHDG('Sales tax' 'routine')
     A                                      REFFLD(SSNAME)
     A            JDIDFM    R               COLHDG('Date' 'format')
     A                                      REFFLD(SSCOD3)
     A            JDBMCA    R               COLHDG('Multi-currency' +
     A                                      'authorized')
     A                                      REFFLD(SSYENO)
     A            JDCURR    R               COLHDG('Currency ' 'code')
     A                                      REFFLD(SSCURC)
     A            JDDECI    R               COLHDG('Decimal' 'code')
     A                                      REFFLD(SSCOD1)
     A            JDCOUN    R               COLHDG('Country' 'code')
     A                                      REFFLD(SSSTA3)
     A            JDSTAT    R               COLHDG('State' 'code')
     A                                      REFFLD(SSSTA3)
     A            JDBRMD    R               COLHDG('Branch' 'mode')
     A                                      REFFLD(SSCOD1)
     A* A=ACH branch on system
     A* C=Non ACH branch on system
     A* M=Manual branch not on system
V88  A            JDTDIF    R
V88  A                                      REFFLD(SSCOD1)
V88  A                                      COLHDG('Time' 'Zone' -
V88  A                                      'Difference')
V88  A            JDTZHR    R
V88  A                                      REFFLD(SSCOU2)
V88  A                                      COLHDG('Hour' 'Difference')
V88  A            JDTZMN    R
V88  A                                      REFFLD(SSCOU2)
V88  A                                      COLHDG('Minute' 'Difference')
V88  A            JDSPTF    R               REFFLD(SSCOD1)
V88  A                                      COLHDG('Islamic' 'Branch')
V88  A            JDGBLT    R               REFFLD(SSCOD1)
V88  A                                      COLHDG('Group' 'Balance' 'Type')
V88  A            JDGBAL    R               REFFLD(SSAMT5)
V88  A                                      COLHDG('W/H' 'Group Balance' -
V88  A                                      'exemption')
A001 A            SSTRSS    R               REFFLD(SSCOD1)
A001 A                                      COLHDG('OD Tier' 'Sorting Method')
A001 A* 1= Tier Type Sequence.
A001 A* 2= Date of Creation (FIFO) .
A001 A*
V88  A            SBRATE    R               REFFLD(SSCOD1)
V88  A                                      COLHDG('Multi' 'branch' 'SSRATE')
V88  A            SBFXRT    R               REFFLD(SSCOD1)
V88  A                                      COLHDG('Multi' 'branch' 'SSFXRT')
     A            JDBRF1    R               COLHDG('Reference' 'number 1')
     A                                      REFFLD(SSCODF)
     A            JDBRF2    R               COLHDG('Reference' 'number 2')
     A                                      REFFLD(SSCODF)
     A            JDBRF3    R               COLHDG('Reference' 'number 3')
     A                                      REFFLD(SSCODF)
     A            JDBRF4    R               COLHDG('Reference' 'number 4')
     A                                      REFFLD(SSCODF)
     A            SSMDL8    R               COLHDG('Date last' 'maintenance')
     A                                      REFFLD(SSDAT8)
C008 A            JDBMGR    R               COLHDG('Branch' 'manager')
C008 A                                      REFFLD(SSOFFC)
C008 A            JDRMGR    R               COLHDG('Regional' 'manager')
C008 A                                      REFFLD(SSOFFC)
C018 A            JDREGN    R               COLHDG('Region' 'code')
C018 A                                      REFFLD(SSNAME)
V510 A            JDIBRN    R               COLHDG('Internal' 'Branch ID')
V510 A                                      REFFLD(SSCOD3)
V518 A            JDFISB    R               COLHDG('FIS' 'Branch ID')
V518 A                                      REFFLD(SSCOD3)
V510 A            JDLCRG    R               COLHDG('LC clearing' 'region')
V510 A                                      REFFLD(SSBRAN)
V510 A            JDOCRG    R               COLHDG('OC clearing' 'region')
V510 A                                      REFFLD(SSBRAN)
V517 A            JDRBRN    R               COLHDG('Reporting' 'Branch ID')
V517 A                                      REFFLD(SSCOD3)
V517 A            JDRSV1    R               COLHDG('Reserve field 1')
V517 A                                      REFFLD(SSCOD1)
V517 A            JDRSV2    R               COLHDG('Reserve field 2')
V517 A                                      REFFLD(SSCOD1)
V517 A            JDRSV3    R               COLHDG('Reserve field 3')
V517 A                                      REFFLD(SSCOD1)
V517 A            JDRSV4    R               COLHDG('Reserve field 4')
V517 A                                      REFFLD(SSCOD1)
SNY  A            JDCLRG    R               REFFLD(SSCODA)
SNY  A                                      TEXT('Clearing Centre')
SNY  A                                      COLHDG('Clearing Centre')
V533 A            JDISHQ    R
V533 A                                      REFFLD(SSCOD2)
V533 A                                      TEXT('HQ Identifier')
V533 A                                      COLHDG('HQ Identifier')
V532 A            JDMASB    R               REFFLD(SSCOD1)
V532 A                                      TEXT('MASB Tagging')
V532 A                                      COLHDG('MASB Tagging')
V536 A            JDSAD1    R               COLHDG('SWIFT Address' 'Line 1')
V536 A                                      REFFLD(SSNAML)
V536 A            JDSAD2    R               COLHDG('SWIFT Address' 'Line 2')
V536 A                                      REFFLD(SSNAML)
V536 A            JDSAD3    R               COLHDG('SWIFT Address' 'Line 3')
V536 A                                      REFFLD(SSNAML)
T003 A            JDBICD    R               COLHDG('Bank Identification' 'Code')
T003 A                                      REFFLD(SSCODC)
     A*
     **=========================================================================
     A* FOREIGN EXCHANGE CONVERSION CONTROL - SSFXCV
     **=========================================================================
     A            JFXCUR    R               COLHDG('Currency code')
     A                                      REFFLD(SSCURC)
     A            JFXAPP    R               COLHDG('Command/Parameter')
     A                                      REFFLD(SSNAME)
     A            JFXPCT    R               COLHDG('Tolerance' 'rate')
     A                                      REFFLD(SSPERD)
     A            JFXVAM    R               COLHDG('Tolerance' 'amount')
     A                                      REFFLD(SSAMT4)
V502 A            JFXCVR    R               COLHDG('Used Rate Number')
     A                                      REFFLD(SSCOD1)
V502 A            JFXDVR    R               COLHDG('Debit' -
     A                                      'Rate to use')
     A                                      REFFLD(SSCOD1)
     A* *BRANCH   =Modulus at branch level
     A* *NONE     =No modulus used
     A* pgm-name  =Modulus checking program name
     **
     **=========================================================================
     A* FOREIGN EXCHANGE CONTROL PARAMETERS - SSFXPM
     **=========================================================================
     A            JFXRD1    R               COLHDG('Rate 1 description')
     A                                      REFFLD(SSPROM)
     A            JFXRD2    R               COLHDG('Rate 2 description')
     A                                      REFFLD(SSPROM)
     A            JFXRD3    R               COLHDG('Rate 3 description')
     A                                      REFFLD(SSPROM)
     A            JFXRD4    R               COLHDG('Rate 4 description')
     A                                      REFFLD(SSPROM)
     A            JFXRD5    R               COLHDG('Rate 5 description')
     A                                      REFFLD(SSPROM)
     A            JFXRD6    R               COLHDG('Rate 6 description')
     A                                      REFFLD(SSPROM)
     A            JFXRD7    R               COLHDG('Rate 7 description')
     A                                      REFFLD(SSPROM)
     A            JFXRD8    R               COLHDG('Rate 8 description')
     A                                      REFFLD(SSPROM)
V524 A            JFXRD9    R               COLHDG('Rate 9 description')
V524 A                                      REFFLD(SSPROM)
V524 A            JFXRDA    R               COLHDG('Rate 10 description')
V524 A                                      REFFLD(SSPROM)
V524 A            JFXRDB    R               COLHDG('Rate 11 description')
V524 A                                      REFFLD(SSPROM)
V524 A            JFXRDC    R               COLHDG('Rate 12 description')
V524 A                                      REFFLD(SSPROM)
V524 A            JFXRDD    R               COLHDG('Rate 13 description')
V524 A                                      REFFLD(SSPROM)
V524 A            JFXRDE    R               COLHDG('Rate 14 description')
V524 A                                      REFFLD(SSPROM)
V524 A            JFXRDF    R               COLHDG('Rate 15 description')
V524 A                                      REFFLD(SSPROM)
     A            JFXDFM    R               COLHDG('Default display mode')
     A                                      REFFLD(SSCOD8)
     A* *BASE    =ENTER UNITS BASE PER 1 UNIT FOREIGN
     A* *FOREIGN =ENTER UNITS FOREIGN PER 1 UNIT BASE
     A* FX reference formula   - SSFXRR
     A            JFSEQN    R               COLHDG('Reference' 'Seq')
     A                                      REFFLD(SSCOU3)
     A            JFRLIN    R               COLHDG('Rate' 'Line')
     A                                      REFFLD(SSCOU2)
     A            JFRLN1    R               COLHDG('Rate' 'Line1' 'Reference')
     A                                      REFFLD(SSCOU2)
     A            JFRLN2    R               COLHDG('Rate' 'Line2' 'Reference')
     A                                      REFFLD(SSCOU2)
     A            JFRTYP    R               COLHDG('Reference' 'Type')
     A                                      REFFLD(SSCOD1)
     A            JFRCOD    R               COLHDG('Reference' 'Code')
     A                                      REFFLD(SSCOD1)
     A            JFRVAR    R               COLHDG('Reference' 'Variance')
     A                                      REFFLD(SSFEXRT)
     A            JFPVAR    R               COLHDG('Reference' 'Percentage')
     A                                      REFFLD(SSPERD)
     A            JFRCVT    R               COLHDG('Conv. dec.' 'for rate')
     A                                      REFFLD(SSCOD1)
     A            JFRRND    R               COLHDG('Round' 'truncate code')
     A                                      REFFLD(SSCOD1)
     A            JFRMAX    R               COLHDG('Maximum' 'Rate')
     A                                      REFFLD(SSFEXRT)
     A            JFRMIN    R               COLHDG('Minimum' 'Rate')
     A                                      REFFLD(SSFEXRT)
     **
     **=========================================================================
     A* FOREIGN EXCHANGE RATES - SSFXRT
     **=========================================================================
V001 A            JFXBNK    R               COLHDG('Bank number')
V001 A                                      REFFLD(SSBANK)
     A            JFXCOD    R               COLHDG('Currency code')
     A                                      REFFLD(SSCURC)
SS04 A            JFXCDN    R               COLHDG('Numeric' 'Currency code')
SS04 A                                      REFFLD(SSCCDN)
SS04 A            JFXEXP    R               COLHDG('Exponent')
SS04 A                                      REFFLD(SSEXP)
     A            JFXDEC    R               COLHDG('Decimal' 'positions')
     A                                      REFFLD(SSCOD1)
C009 A            JFXPRI    R               COLHDG('Currency priority')
C009 A                                      REFFLD(SSCOU2)
C009 A*           JFXCVF    R               COLHDG('Conversion' 'decimals')
C009 A*                                     REFFLD(SSCOD1)
C009 A            JFXCV1    R               COLHDG('Conv. dec.' 'for rate 1')
C009 A                                      REFFLD(SSCOD1)
C009 A            JFXCV2    R               COLHDG('Conv. dec.' 'for rate 2')
C009 A                                      REFFLD(SSCOD1)
C009 A*SS01                                 VALUES('0' '1' '2' '3' '4' '5' '6' +
C009 A*SS01                                 '7')
C009 A            JFXCV3    R               COLHDG('Conv. dec.' 'for rate 3')
C009 A                                      REFFLD(SSCOD1)
C009 A            JFXCV4    R               COLHDG('Conv. dec.' 'for rate 4')
C009 A                                      REFFLD(SSCOD1)
C009 A            JFXCV5    R               COLHDG('Conv. dec.' 'for rate 5')
C009 A                                      REFFLD(SSCOD1)
C009 A            JFXCV6    R               COLHDG('Conv. dec.' 'for rate 6')
C009 A                                      REFFLD(SSCOD1)
C009 A            JFXCV7    R               COLHDG('Conv. dec.' 'for rate 7')
C009 A                                      REFFLD(SSCOD1)
C009 A            JFXCV8    R               COLHDG('Conv. dec.' 'for rate 8')
C009 A                                      REFFLD(SSCOD1)
V523 A            JFXCV9    R               COLHDG('Conv. dec.' 'for rate 9')
V523 A                                      REFFLD(SSCOD1)
V523 A            JFXCVA    R               COLHDG('Conv. dec.' 'for rate 10')
V523 A                                      REFFLD(SSCOD1)
V523 A            JFXCVB    R               COLHDG('Conv. dec.' 'for rate 11')
V523 A                                      REFFLD(SSCOD1)
V523 A            JFXCVC    R               COLHDG('Conv. dec.' 'for rate 12')
V523 A                                      REFFLD(SSCOD1)
V523 A            JFXCVD    R               COLHDG('Conv. dec.' 'for rate 13')
V523 A                                      REFFLD(SSCOD1)
V523 A            JFXCVE    R               COLHDG('Conv. dec.' 'for rate 14')
V523 A                                      REFFLD(SSCOD1)
V523 A            JFXCVF    R               COLHDG('Conv. dec.' 'for rate 15')
V523 A                                      REFFLD(SSCOD1)
C009 A            JFXLCD    R               COLHDG('Low. curr.' 'denomination')
C009 A                                      REFFLD(SSAMT1)
     A            JFXRND    R               COLHDG('Round' 'truncate code')
     A                                      REFFLD(SSCOD1)
     A            JFXCUN    R               COLHDG('Conversion' 'units')
     A***                                   REFFLD(SSCOU3)
     A***                                   VALUES(1 100)
     A                                      REFFLD(SSCOU4)
      * ADDED BY CHEWFANG
     A            JFXDSC    R               COLHDG('Description' '(Long)')
     A                                      REFFLD(SSDESC)
     A            JFXLSC    R               COLHDG('Description' '(Local)')
     A                                      REFFLD(SSDESC)
     A            JFXSSC    R               COLHDG('Short' 'description')
     A                                      REFFLD(SSDESS)
     A            JFXTLR    R               COLHDG('Tolerance' 'rate')
     A                                      REFFLD(SSPERD)
     A            JFXTAM    R               COLHDG('Tolerance' 'amount')
     A                                      REFFLD(SSAMT4)
     A            JFXACD    R               COLHDG('Account' 'number' 'digit')
     A                                      REFFLD(SSCOD2)
     A            JFDENO    R               COLHDG('Denomination')
     A                                      REFFLD(SSCOU4)
     A            JFSETN    R               COLHDG('Set number')
     A                                      REFFLD(SSCOU5)
     A            JFSPRE    R               COLHDG('Spread type')
     A                                      REFFLD(SSCODA)
     A            JFSP01    R               COLHDG('Current Spread 01')
     A                                      REFFLD(SSAMTQ)
     A            JFSP02    R               COLHDG('Current Spread 02')
     A                                      REFFLD(SSAMTQ)
     A            JFSP03    R               COLHDG('Current Spread 03')
     A                                      REFFLD(SSAMTQ)
     A            JFSP04    R               COLHDG('Current Spread 04')
     A                                      REFFLD(SSAMTQ)
     A            JFSP05    R               COLHDG('Current Spread 05')
     A                                      REFFLD(SSAMTQ)
     A            JFSP06    R               COLHDG('Current Spread 06')
     A                                      REFFLD(SSAMTQ)
     A            JFSP07    R               COLHDG('Current Spread 07')
     A                                      REFFLD(SSAMTQ)
     A            JFSP08    R               COLHDG('Current Spread 08')
     A                                      REFFLD(SSAMTQ)
     A            JFSP09    R               COLHDG('Current Spread 09')
     A                                      REFFLD(SSAMTQ)
     A            JFSP10    R               COLHDG('Current Spread 10')
     A                                      REFFLD(SSAMTQ)
     A            JFSP11    R               COLHDG('Current Spread 11')
     A                                      REFFLD(SSAMTQ)
     A            JFSP12    R               COLHDG('Current Spread 12')
     A                                      REFFLD(SSAMTQ)
     A            JFSP13    R               COLHDG('Current Spread 13')
     A                                      REFFLD(SSAMTQ)
     A            JFSP14    R               COLHDG('Current Spread 14')
     A                                      REFFLD(SSAMTQ)
     A            JFSP15    R               COLHDG('Current Spread 15')
     A                                      REFFLD(SSAMTQ)
     A            JFXRM1    R               COLHDG('Rate 1 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRM2    R               COLHDG('Rate 2 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRM3    R               COLHDG('Rate 3 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRM4    R               COLHDG('Rate 4 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRM5    R               COLHDG('Rate 5 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRM6    R               COLHDG('Rate 6 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRM7    R               COLHDG('Rate 7 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRM8    R               COLHDG('Rate 8 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRM9    R               COLHDG('Rate 9 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRMA    R               COLHDG('Rate 10 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRMB    R               COLHDG('Rate 11 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRMC    R               COLHDG('Rate 12 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRMD    R               COLHDG('Rate 13 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRME    R               COLHDG('Rate 14 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFXRMF    R               COLHDG('Rate 15 maintainable')
     A                                      REFFLD(SSCOD1)
     A            JFRECI    R               COLHDG('Identifier')
     A                                      REFFLD(SSCOD1)
     A            CPFLSD    R               COLHDG('Short' 'description')
     A                                      REFFLD(SSDESS)
     A            CPFLLS    R               COLHDG('Local' 'description')
     A                                      REFFLD(SSDESC)
     A            JFIN01    R               COLHDG('Income Rate 01')
     A                                      REFFLD(SSAMTQ)
     A            JFIN02    R               COLHDG('Income Rate 02')
     A                                      REFFLD(SSAMTQ)
     A            JFIN03    R               COLHDG('Income Rate 03')
     A                                      REFFLD(SSAMTQ)
     A            JFIN04    R               COLHDG('Income Rate 04')
     A                                      REFFLD(SSAMTQ)
     A            JFIN05    R               COLHDG('Income Rate 05')
     A                                      REFFLD(SSAMTQ)
     A            JFIN06    R               COLHDG('Income Rate 06')
     A                                      REFFLD(SSAMTQ)
     A            JFIN07    R               COLHDG('Income Rate 07')
     A                                      REFFLD(SSAMTQ)
     A            JFIN08    R               COLHDG('Income Rate 08')
     A                                      REFFLD(SSAMTQ)
     A            JFIN09    R               COLHDG('Income Rate 09')
     A                                      REFFLD(SSAMTQ)
     A            JFIN10    R               COLHDG('Income Rate 10')
     A                                      REFFLD(SSAMTQ)
     A            JFIN11    R               COLHDG('Income Rate 11')
     A                                      REFFLD(SSAMTQ)
     A            JFIN12    R               COLHDG('Income Rate 12')
     A                                      REFFLD(SSAMTQ)
     A            JFIN13    R               COLHDG('Income Rate 13')
     A                                      REFFLD(SSAMTQ)
     A            JFIN14    R               COLHDG('Income Rate 14')
     A                                      REFFLD(SSAMTQ)
     A            JFIN15    R               COLHDG('Income Rate 15')
     A                                      REFFLD(SSAMTQ)
     A            JDLDSC    R               COLHDG('Local branch name')
     A                                      REFFLD(SSDESC)
     A            JDADR3    R               COLHDG('Address line 3')
     A                                      REFFLD(SSNAML)
     A            JDADR4    R               COLHDG('Address line 4')
     A                                      REFFLD(SSNAML)
     A            JDBRTP    R               COLHDG('Branch type')
     A                                      REFFLD(SSCOD1)
     A            JDABR     R               COLHDG('Alternate branch' -
     A                                      'number')
     A                                      REFFLD(SSCOU5)
     A            JDHCBR    R               COLHDG('Head office calender' -
     A                                      'branch')
     A                                      REFFLD(SSCOU5)
     A            JDCLBR    R               COLHDG('Calender branch')
     A                                      REFFLD(SSCOU5)
     A            JDFLBR    R               COLHDG('Float calender' -
     A                                      'branch')
     A                                      REFFLD(SSCOU5)
     A            JDXSET    R               COLHDG('Exchange/Income' -
     A                                      'set number')
     A                                      REFFLD(SSCOU5)
     A            JDDATE    R               COLHDG('Opened date')
     A                                      REFFLD(SSDAT8)
     A            SSLTXT    R               COLHDG('Country Local Text')
     A                                      REFFLD(SSDESC)
     A            JDRSV5    R               COLHDG('Reserve field')
     A                                      REFFLD(SSCOD1)
     A            JDRSV6    R               COLHDG('Reserve field')
     A                                      REFFLD(SSCOD1)
     A            JDRSV7    R               COLHDG('Reserve field')
     A                                      REFFLD(SSCOD1)
     A            JDRSV8    R               COLHDG('Reserve field')
     A                                      REFFLD(SSCOD1)
     A            JDRSVA    R               COLHDG('Reserve field')
     A                                      REFFLD(SSAMT5)
     A            JDEXID    R               COLHDG('External branch ID')
     A                                      REFFLD(SSCOU5)
     A            SSSLTX    R               COLHDG('State local Text')
     A                                      REFFLD(SSDESC)
     A            SSDDIC    R               COLHDG('district code')
     A                                      REFFLD(SSCODA)
     A            SSDSTX    R               COLHDG('district name')
     A                                      REFFLD(SSDESS)
     A            SSDTXT    R               COLHDG('district text')
     A                                      REFFLD(SSDESC)
     A            SSDLTX    R               COLHDG('district local text')
     A                                      REFFLD(SSDESC)
     A            SSSDIC    R               COLHDG('Sub district code')
     A                                      REFFLD(SSCODA)
     A            SSSDST    R               COLHDG('Sub district name')
     A                                      REFFLD(SSDESS)
     A            SSSDTX    R               COLHDG('Sub district text')
     A                                      REFFLD(SSDESC)
     A            SSSDLT    R               COLHDG('Sub district Local' -
     A                                      'Text')
     A                                      REFFLD(SSDESC)
     A            SSACLT    R               COLHDG('Local description')
     A                                      REFFLD(SSDESC)
     A            SSGENB    R               COLHDG('Generate by Branch')
     A                                      REFFLD(SSCOD1)
     A            SSGENP    R               COLHDG('Generate by Product')
     A                                      REFFLD(SSCOD1)
     A            SSBRSP    R               COLHDG('Branch start' -
     A                                      'position')
     A                                      REFFLD(SSCOU2)
     A            SSSTAT    R               COLHDG('Start number')
     A                                      REFFLD(SSCOU2)
     A            SSSEND    R               COLHDG('End number')
     A                                      REFFLD(SSCOU2)
     A            SSPDSP    R               COLHDG('Product start' -
     A                                      'position')
     A                                      REFFLD(SSCOU2)
     A            SSSQSP    R               COLHDG('Running no' -
     A                                      'position')
     A                                      REFFLD(SSCOU2)
     A            SSCHKD    R               COLHDG('Check digit' -
     A                                      'required')
     A                                      REFFLD(SSCOD1)
     A            SSCDSP    R               COLHDG('Check digit' -
     A                                      'start position')
     A                                      REFFLD(SSCOU2)
     A            JFXPR1    R               COLHDG('Previous' 'Rate 1')
     A                                      REFFLD(SSFEXRT)
     A            JFXPR2    R               COLHDG('Previous' 'Rate 2')
     A                                      REFFLD(SSFEXRT)
     A            JFXPR3    R               COLHDG('Previous' 'Rate 3')
     A                                      REFFLD(SSFEXRT)
     A            JFXPR4    R               COLHDG('Previous' 'Rate 4')
     A                                      REFFLD(SSFEXRT)
     A            JFXPR5    R               COLHDG('Previous' 'Rate 5')
     A                                      REFFLD(SSFEXRT)
     A            JFXPR6    R               COLHDG('Previous' 'Rate 6')
     A                                      REFFLD(SSFEXRT)
     A            JFXPR7    R               COLHDG('Previous' 'Rate 7')
     A                                      REFFLD(SSFEXRT)
     A            JFXPR8    R               COLHDG('Previous' 'Rate 8')
     A                                      REFFLD(SSFEXRT)
     A            JFXPR9    R               COLHDG('Previous' 'Rate 9')
     A                                      REFFLD(SSFEXRT)
     A            JFXPRA    R               COLHDG('Previous' 'Rate 10')
     A                                      REFFLD(SSFEXRT)
     A            JFXPRB    R               COLHDG('Previous' 'Rate 11')
     A                                      REFFLD(SSFEXRT)
     A            JFXPRC    R               COLHDG('Previous' 'Rate 12')
     A                                      REFFLD(SSFEXRT)
     A            JFXPRD    R               COLHDG('Previous' 'Rate 13')
     A                                      REFFLD(SSFEXRT)
     A            JFXPRE    R               COLHDG('Previous' 'Rate 14')
     A                                      REFFLD(SSFEXRT)
     A            JFXPRF    R               COLHDG('Previous' 'Rate 15')
     A                                      REFFLD(SSFEXRT)
     A            JFBSIN    R               COLHDG('Buy/Sell' 'Indicator')
     A                                      REFFLD(SSCOD1)
     A            JFDRIN    R               COLHDG('Direct/' 'Indirect')
     A                                      REFFLD(SSCOD1)
     A            JFXERR    R               COLHDG('Error Code')
     A                                      REFFLD(SSCOD1)
     A            JFXOPT    R               COLHDG('Option')
     A                                      REFFLD(SSCOD1)
     A            G9CTGY    R               COLHDG('Category Type')
     A                                      REFFLD(SSCODA)
     A            G9CSST    R               COLHDG('Consolidated' -
     A                                      'Statement')
     A                                      REFFLD(SSCOD1)
     A            G9RQTA    R               COLHDG('Required Total' -
     A                                      'Amount')
     A                                      REFFLD(SSCOD1)
     A            G9RQAD    R               COLHDG('Required Account' -
     A                                      'Detail')
     A                                      REFFLD(SSCOD1)
     A            G9RQTD    R               COLHDG('Required Transaction' -
     A                                      'Detail')
     A                                      REFFLD(SSCOD1)
     A            CBHDIN    R               COLHDG('Holiday Indicator')
     A                                      REFFLD(SSCOD1)
     A            JFRAMT    R               COLHDG('Amount')
     A                                      REFFLD(SSAMT5)
     A            BPCATG    R               COLHDG('Category Code')
     A                                      REFFLD(SSCOD2)
     A            BPMILM    R               COLHDG('Minimum Limit')
     A                                      REFFLD(SSAMT4)
     A            BPMXLM    R               COLHDG('Maximum Limit')
     A                                      REFFLD(SSAMT4)
     A            BPCURR    R               COLHDG('Limit Currency Code')
     A                                      REFFLD(SSCURC)
     A            BPSDES    R               COLHDG('Short Description')
     A                                      REFFLD(SSDESS)
     A            BPDESC    R               COLHDG('Description')
     A                                      REFFLD(SSDESC)
     A            BPDESL    R               COLHDG('Local Description')
     A                                      REFFLD(SSDESC)
     A            BPCODE    R               COLHDG('Purpose Code')
     A                                      REFFLD(SSCOU7)
     A            BPDRCR    R               COLHDG('Debit/Credit' -
     A                                      'Indicator')
     A                                      REFFLD(SSCOD1)
     A            BPSIC1    R               COLHDG('Special Information' -
     A                                      'Code 1')
     A                                      REFFLD(SSCOD1)
     A            BPSIC2    R               COLHDG('Special Information' -
     A                                      'Code 2')
     A                                      REFFLD(SSCOD1)
     A            BPSIC3    R               COLHDG('Special Information' -
     A                                      'Code 3')
     A                                      REFFLD(SSCOD1)
     A            BPSIC4    R               COLHDG('Special Information' -
     A                                      'Code 4')
     A                                      REFFLD(SSCOD1)
     A            SSSBUC    R               COLHDG('STRATEGIC' 'BUSINESS UNIT')
     A                                      REFFLD(SSCOD4)
     A            WACTION   R               COLHDG('CODE FIELD 1')
     A                                      REFFLD(SSCOD1)
     A            JFXCTIM   R               COLHDG('Process Time')
     A                                      REFFLD(SSTIME)
     A            JFXERRR   R               COLHDG('Error Code')
     A                                      REFFLD(SSCODA)
     A            JFXLEDS   R               COLHDG('Long Error' -
     A                                      'Description')
     A                                      REFFLD(SSPRTL)
     A            JFXCSTS   R               COLHDG('Record Status')
     A                                      REFFLD(SSCOD2)
     A            JFXCBNK   R               COLHDG('Creation Bank')
     A                                      REFFLD(SSBANK)
     A            JFXCBRN   R               COLHDG('Creation Branch')
     A                                      REFFLD(SSBRAN)
     A            SSCPRDC   R               COLHDG('Application Product' -
     A                                      'Code')
     A                                      REFFLD(SSCODA)
     A            SSCRMTI   R               COLHDG('Outward/Inward' -
     A                                      'Remittance')
     A                                      REFFLD(SSCOD1)
     A            SSCCODE   R               COLHDG('Charge Code')
     A                                      REFFLD(SSCODA)
     A            SSCDESC   R               COLHDG('Charge Code' -
     A                                      'Description')
     A                                      REFFLD(SSDES1)
     A            SSCEXPD   R               COLHDG('Expiry Date')
     A                                      REFFLD(SSDAT8)
     A            SSCEFFD   R               COLHDG('Effective Date')
     A                                      REFFLD(SSDAT8)
     A            SSCGRFN   R               COLHDG('GL Reference Number')
     A                                      REFFLD(SSACGL)
      * END CHEWFANG
     A            JFXUND    R               COLHDG('Units' 'description')
     A                                      REFFLD(SSDESS)
     A            JFXFRD    R               COLHDG('Fractions' 'description')
     A                                      REFFLD(SSDESS)
     A            JFXCNC    R               COLHDG('Country' 'code')
     A                                      REFFLD(SSSTA3)
     A            JFXITC    R               COLHDG('Iso' 'Currency' 'Code')
     A                                      REFFLD(SSCODA)
     A            JFXREF    R               COLHDG('Current' 'Reference' 'rate')
     A                                      REFFLD(SSFEXRT)
     A            JFXBRT    R               COLHDG('Current' 'Rate 1')
     A                                      REFFLD(SSFEXRT)
     A            JFXSRT    R               COLHDG('Current' 'Rate 2')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
     A            JFXMRT    R               COLHDG('Current' 'Rate 3')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
     A            JFXART    R               COLHDG('Current' 'Rate 4')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
     A            JFXORT    R               COLHDG('Current' 'Rate 5')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
     A            JFXRT6    R               COLHDG('Current' 'Rate 6')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
     A            JFXRT7    R               COLHDG('Current' 'Rate 7')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
     A            JFXRT8    R               COLHDG('Current' 'Rate 8')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
V523 A            JFXRT9    R               COLHDG('Current' 'Rate 9')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
V523 A            JFXRTA    R               COLHDG('Current' 'Rate 10')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
V523 A            JFXRTB    R               COLHDG('Current' 'Rate 11')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
V523 A            JFXRTC    R               COLHDG('Current' 'Rate 12')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
V523 A            JFXRTD    R               COLHDG('Current' 'Rate 13')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
V523 A            JFXRTE    R               COLHDG('Current' 'Rate 14')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
V523 A            JFXRTF    R               COLHDG('Current' 'Rate 15')
     A                                      REFFLD(SSFEXRT)
SNY  A**                                    REFFLD(SSAMTQ)
T001 A            JFXTTY    R               COLHDG('Tolerance Type')
T001 A                                      REFFLD(SSCOD1)
T001 A            JFXBDL    R               COLHDG('Min Bid Rate')
T001 A                                      REFFLD(SSAMTQ)
T001 A            JFXBDU    R               COLHDG('Max Bid Rate')
T001 A                                      REFFLD(SSAMTQ)
T001 A            JFXOFL    R               COLHDG('Min Offer Rate')
T001 A                                      REFFLD(SSAMTQ)
T001 A            JFXOFU    R               COLHDG('Max Offer Rate')
T001 A                                      REFFLD(SSAMTQ)
T001 A            JFXSRV    R               COLHDG('Share FX' 'Revaluation PL')
T001 A                                      REFFLD(SSCOD1)
T001 A            JFPIPF    R               COLHDG('Pips Factor')
T001 A                                      REFFLD(SSAMTA)
T001 A            JFXDRC    R               COLHDG('Data Source')
T001 A                                      REFFLD(SSCOD3)
T001 A            JFXMJR    R               COLHDG('Currency Major')
T001 A                                      REFFLD(SSCURC)
T001 A            JFXSUP    R               COLHDG('Currency Susp' 'indicator')
T001 A                                      REFFLD(SSCOD1)
T001 A            JFXWORK   R               COLHDG('Workstation ID')
T001 A                                      REFFLD(SSCODA)
T001 A            JSRTIME   R               COLHDG('Last maintenance' 'time')
T001 A                                      REFFLD(SSTIM6)
T001 A            JFXSPER   R               COLHDG('Supervisor ID')
T001 A                                      REFFLD(SSCODA)
T001 A            JFXPGM    R               COLHDG('Program ID')
T001 A                                      REFFLD(SSCODA)
T001 A            JSRMD8    R               COLHDG('Date' 'last maintenance')
T001 A                                      REFFLD(SSDAT8)
T001 A            JFXTIME   R               COLHDG('Last maintenance' 'time')
T001 A                                      REFFLD(SSTIM6)
T001 A            JSRWORK   R               COLHDG('Workstation ID')
T001 A                                      REFFLD(SSCODA)
T001 A            JSRSPER   R               COLHDG('Supervisor ID')
T001 A                                      REFFLD(SSCODA)
T001 A            JSRPGM    R               COLHDG('Program ID')
T001 A                                      REFFLD(SSCODA)
     A            JFXMD8    R               COLHDG('Date last' 'maintenance')
     A                                      REFFLD(SSDAT8)
     A            JFXBKC    R               COLHDG('Quote currency')
     A                                      REFFLD(SSCURC)
V5001A            JFXBRN    R               COLHDG('Branch number')
V5001A                                      REFFLD(SSBRAN)
T1001A            JFGPRT    R               COLHDG('Group Rate')
T1001A                                      REFFLD(SSINF1)
     **
     **=========================================================================
     A* Journal detail master file - SSJDMS
     **=========================================================================
     A            SSJFNM    R               COLHDG('File name')
     A                                      REFFLD(SSNAME)
     A            SSJFAP    R               COLHDG('Access Path')
     A                                      REFFLD(SSYON)
     **
     **=========================================================================
     A* Journaling group master file - SSJGMS
     **=========================================================================
     A*
     A            SSJMGP    R               COLHDG('Group name')
     A                                      REFFLD(SSNAMS)
     A            SSJMCD    R               COLHDG('Group code')
     A                                      REFFLD(SSCOD3)
     A            SSJMAC    R               COLHDG('Activation')
     A                                      REFFLD(SSYON)
     A* Y=Journal this group
     A* N=Do not journal this group
     A            SSJMSD    R               COLHDG('Date journal' 'started')
     A                                      REFFLD(SSDAT8)
     A            SSJMST    R               COLHDG('Time journal' 'started')
     A                                      REFFLD(SSTIM6)
     A            SSJMED    R               COLHDG('Date journal' 'ended')
     A                                      REFFLD(SSDAT8)
     A            SSJMET    R               COLHDG('Time journal' 'ended')
     A                                      REFFLD(SSTIM6)
     A            SSJJNM    R               COLHDG('Journal name')
     A                                      REFFLD(SSNAME)
     A            SSJJLB    R               COLHDG('Journal library')
     A                                      REFFLD(SSNAME)
     A            SSJJAS    R               COLHDG('Journal ASP')
     A                                      REFFLD(SSCOD2)
     A            SSJJTQ    R               COLHDG('Journal Thrshld' 'msgq')
     A                                      REFFLD(SSNAME)
     A            SSJJTL    R               COLHDG('Journal Thrshld' 'msgq lib')
     A                                      REFFLD(SSNAME)
     A            SSJRNM    R               COLHDG('Journal rec' 'name')
     A                                      REFFLD(SSNAME)
     A            SSJRLB    R               COLHDG('Journal rec' 'library')
     A                                      REFFLD(SSNAME)
     A            SSJRAS    R               COLHDG('Journal rec' 'ASP')
     A                                      REFFLD(SSCOD2)
     A*  blanks for default *LIBASP
     A            SSJRTH    R               COLHDG('Journal rec' 'threshold')
     A                                      REFFLD(SSCOU7)
     A* SSJPAR data structure map
     A            SSJSTS    R               COLHDG('Journaling' 'Active')
     A                                      REFFLD(SSYON)
     A* Y=Journaling active
     A* N=Journaling not active
     A            SSJSDT    R     S         COLHDG('Date journal' 'started')
     A                                      REFFLD(SSDAT8)
     A            SSJSTM    R     S         COLHDG('Time journal' 'started')
     A                                      REFFLD(SSTIM6)
     A            SSJEDT    R     S         COLHDG('Date journal' 'ended')
     A                                      REFFLD(SSDAT8)
     A            SSJETM    R     S         COLHDG('Time journal' 'ended')
     A                                      REFFLD(SSTIM6)
     A            SSJACT    R               COLHDG('Journal activation')
     A                                      REFFLD(SSCOD1)
     A* B=after batch run
     A* I=during IPL
     A*
     **=========================================================================
     A* OFFICER - SSOFFR
     **=========================================================================
     A            SSOOFF    R               COLHDG('Officer' 'code')
     A                                      REFFLD(SSOFFC)
     A            SSOBRN    R               COLHDG('Branch number')
     A                                      REFFLD(SSBRAN)
     A            SSOIDN    R               COLHDG('Officer ID')
     A                                      REFFLD(SSNAME)
     A            SSONAM    R               COLHDG('Officer' 'name')
     A                                      REFFLD(SSDESC)
     A            SSOSNA    R               COLHDG('Officer' 'short name')
     A                                      REFFLD(SSNAMS)
A001 A            SSOPOS    R               COLHDG('Officer' 'position code')
A001 A                                      REFFLD(SSCOD3)
TF   A            SSOCUR    R               COLHDG('Currency Code')
TF   A                                      REFFLD(SSCURC)
TF   A            SSOALG    R               COLHDG('Approval Limit group')
TF   A                                      REFFLD(SSCOU1)
     A            SSOALM    R               COLHDG('Approval limit')
     A*** V002                              REFFLD(SSAMTC)
V002 A                                      REFFLD(SSAMT4)
C016 A            SSCNTR    R               COLHDG('C/C')
     A                                      REFFLD(SSCOST)
     A                                      TEXT('Cost centre')
V520 A            SSTMLD    R               COLHDG('Lead')
     A                                      REFFLD(SSCOD1)
      * T=Team Lead
      * D=Division Lead
      * S=SBU Lead
V520 A*V529       SSRPTO    R               COLHDG('Reporting To')
     A*V529                                 REFFLD(SSOFFC)
T005 A            SSOBNK    R               COLHDG('Bank number')
T005 A                                      REFFLD(SSBANK)
     A            SSTEAM    R               COLHDG('Team Code')
     A                                      REFFLD(SSCODA)
     A            SSRTEM    R               COLHDG('Report To Team Code')
     A                                      REFFLD(SSCODA)
     A            STMDSS    R               COLHDG('Short Description')
     A                                      REFFLD(SSDESS)
     A            STMDES    R               COLHDG('Long Description')
     A                                      REFFLD(SSDESC)
     A            STMLDS    R               COLHDG('Local Long' 'Description')
     A                                      REFFLD(SSDESC)
     A            SXNDID    R               COLHDG('Node ID')
     A                                      REFFLD(SSCOU3)
     A            SXNDRG    R               COLHDG('Node ID Range')
     A                                      REFFLD(SSCOU3)
     A            SSDIVN    R               COLHDG('Division Code')
     A                                      REFFLD(SSCODA)
     A            SSSEGC    R               COLHDG('Segment Code')
     A                                      REFFLD(SSCOD4)
     A            SSUSRD    R               COLHDG('User ID')
     A                                      REFFLD(SSCODA)
     **
     **=========================================================================
V513 A* OFFICER TYPE - SSOFRT
     **=========================================================================
     A            SSOTYP    R               COLHDG('Officer' 'Type')
     A                                      REFFLD(SSCOD3)
     A            SSOIND    R               COLHDG('Officer' 'Ind')
     A                                      REFFLD(SSCOD1)
     A            SSODSC    R               COLHDG('Type' 'Description')
     A                                      REFFLD(SSDESC)
     A            SSLDSC    R               COLHDG('LOCAL' 'Description')
     A                                      REFFLD(SSDESC)
     A            SSSHDS    R               COLHDG('SHORT' 'Description')
     A                                      REFFLD(SSDES2)
     **
     **=========================================================================
     A* SIC CODES DEFINITION - SSPARA
     **=========================================================================
     A            SICCNA    R               COLHDG('SIC code' 'name')
     A                                      REFFLD(SSDESC)
     **
     **=========================================================================
     A* SIC CODES PARAMETER - SSPARB
     **=========================================================================
     A            SICNAM    R               COLHDG('SIC' 'name')
     A                                      REFFLD(SSNAME)
     A* SIC       =Special information codes
     A* USER      =User information codes
     A            SICAPP    R               COLHDG('SIC' 'application')
     A                                      REFFLD(SSCODA)
     A            SICCOD    R               COLHDG('SIC code')
     A                                      REFFLD(SSCODA)
     A            SICDES    R               COLHDG('SIC prompt text')
     A                                      REFFLD(SSPROM)
     A            SICTXT    R               COLHDG('SIC description')
     A                                      REFFLD(SSDESC)
     **
     **=========================================================================
     A* SIC CODES VALUES - SSPARC
     **=========================================================================
     A            SICVAL    R               COLHDG('SIC code' 'value')
     A                                      REFFLD(SSCODA)
     A            SICVAD    R               COLHDG('SIC code' 'value -
     A                                      description')
     A                                      REFFLD(SSDESC)
     **
     **=========================================================================
     A*  Application master file extension parameter - SSPARF
     **=========================================================================
     A            SFAPPL    R               COLHDG('Application' 'code')
     A                                      REFFLD(SSCOD2)
     A            SFFILE    R               COLHDG('File' 'Used')
     A                                      REFFLD(SSCODA)
     A            SFFCOD    R               COLHDG('Field' 'code')
     A                                      REFFLD(SSCODA)
     A            SFDESC    R               COLHDG('Field' 'Description')
     A                                      REFFLD(SSDESC)
     A            SFEXP8    R               COLHDG('Cycle' 'date')
     A                                      REFFLD(SSDAT8)
     A            SFFTYP    R               COLHDG('Field' 'usage' 'type')
     A                                      REFFLD(SSCOD1)
     A* A = Amount   19,2
     A* C = Counter   9,0
     A* D = Data     30a
     A* T = TLASTS loc (SSFLEN)
     A
     A            SFFLEN    R               COLHDG('Field' 'length')
     A                                      REFFLD(SSCOU3)
     A            SFFEQN    R               COLHDG('Cycle' 'Frequency')
     A                                      REFFLD(SSCOU5)
     A            SFFEQC    R               COLHDG('Cycle' 'Frequency' -
     A                                      'code')
     A                                      REFFLD(SSCOD1)
     A            SFFDAY    R               COLHDG('Cycle' 'day of month')
     A                                      REFFLD(SSCOU2)
     A            SFSSEQ    R               COLHDG('Sort' 'Sequence')
     A                                      REFFLD(SSCOU5)
     A            SFFMAN    R               COLHDG('Field' 'User' -
     A                                      'Maintenable')
     A                                      REFFLD(SSCOD1)
     A            SFPGME    R               COLHDG('Edit' 'Routine')
     A                                      REFFLD(SSCODA)
     **
     **=========================================================================
     ** SS05 - SSPARG -LANGUAGE Group - (OLD CFPARF)
     **=========================================================================
     A            CPFLCD    R               COLHDG('Language' 'code')
     A                                      REFFLD(SSCOD3)
     A            CPFLDS    R               COLHDG('Language' 'description')
     A                                      REFFLD(SSDESC)
     **
     **=========================================================================
     A* SSPARM/SSPARN - Reference fields for N-Way Processing
     **=========================================================================
     A* Name of the program
     A            NWBPGM    R               COLHDG('Program name')
     A                                      REFFLD(SSNAME)
     A* Description
     A            NWBDES    R               COLHDG('Description')
     A                                      REFFLD(SSDESC)
     A* Number of jobs
     A            NWBNOJ    R               COLHDG('Number of' 'Jobs')
     A                                      REFFLD(SSCOU3)
     A* Name of the program running in this job
     A            NWPROG    R               COLHDG('Program name')
     A                                      REFFLD(SSNAME)
     A* Job name to assign to this group
     A            NWJNAM    R               COLHDG('Job Name')
     A                                      REFFLD(SSNAME)
     A* Description of this job
     A            NWDESC    R               COLHDG('Description')
     A                                      REFFLD(SSDESC)
     A* Definition of one branch
     A*           NWBRN     R               COLHDG('Branch' 'number')
     A*                                     REFFLD(SSBRAN)
     A* Beginning branch number
     A            NWBEGB    R               COLHDG('Beginning' 'record' -
     A                                      'number')
     A                                      REFFLD(SSCOUB)
     A* Ending branch number
     A            NWENDB    R               COLHDG('Ending' 'record' -
     A                                      'number')
     A                                      REFFLD(SSCOUB)
     A* Status of this job
     A            NWSTAT    R               COLHDG('Status')
     A                                      REFFLD(SSCOD1)
     A* A=Active
     A* C=Completed
     A* R=Ready to run
     A* Number of accounts to be processed in this job
     A            NWTACT    R               COLHDG('Number of' 'Records')
     A                                      REFFLD(SSCOU7)
     A* Current number of accounts that have been processed
     A            NWPACT    R               COLHDG('Processed' 'records')
     A                                      REFFLD(SSCOU7)
     A* Percent of accounts processed
     A            NWCOMP    R               COLHDG('Percent' 'Complete')
     A                                      REFFLD(SSPERP)
     A* Elasped time since this job was started (seconds)
     A            NWETIM    R               COLHDG('Elasped time' '(seconds)')
     A                                      REFFLD(SSCOU7)
     A* Estimated time that this job will complete
     A            NWECMP    R               COLHDG('Estimated' 'completion' -
     A                                      'Time')
     A                                      REFFLD(SSTIM6)
     A* Numb of accounts to be processed between notification to control program
     A            NWCPNT    R               COLHDG('Checkpoint' 'increment')
T1004A                                      REFFLD(SSCOUB)
T1004A*                                     REFFLD(SSCOU7)
     A* Time this job was started
     A            NWTIMS    R               COLHDG('Start time' 'HHMMSS')
     A                                      REFFLD(SSTIM6)
     A* Date this job was started (julian)
     A            NWDTS8    R               COLHDG('Start date' 'YYYYMMDD')
     A                                      REFFLD(SSDAT8)
     A* Time this job completed
     A            NWTIME    R               COLHDG('End time' 'HHMMSS')
     A                                      REFFLD(SSTIM6)
     A* Date this job completed (julian)
     A            NWDTE8    R               COLHDG('End date' 'YYYYDDD')
     A                                      REFFLD(SSDAT8)
     A* Job description to be used for this job
     A            NWJOBD    R               COLHDG('Job description')
     A                                      REFFLD(SSNAME)
     A* Job description library
     A            NWJOBL    R               COLHDG('Job description' 'library')
     A                                      REFFLD(SSNAME)
     A* Data Queue where notifications are sent
     A            NWDTQN    R               COLHDG('Data' 'queue' 'name')
     A                                      REFFLD(SSNAME)
     A* Library where Data Queue resides
     A            NWDTQL    R               COLHDG('Data' 'queue' 'library')
     A                                      REFFLD(SSNAME)
D555 A* Serial No.for ticket no
D555 A            NWPSRL    R               COLHDG('Serial No')
     A                                      REFFLD(SSCOU3)
Y001 A            NWMSRL    R               COLHDG('Serial No')
     A                                      REFFLD(SSCOU3)
Y001 A            NWPSEQ    R               COLHDG('Sequencial process')
     A                                      REFFLD(SSCOD1)
D555 A            NWPFIL    R               COLHDG('File Name')
     A                                      REFFLD(SSNAME)
     A            NWXLOD    R               COLHDG('Load Memory')
     A                                      TEXT('Load Memory Option')
     A                                      REFFLD(SSCOD1)
     A            NWSIC1    R               COLHDG('SIC 1')
     A                                      REFFLD(SSCOD1)
     A            NWSIC2    R               COLHDG('SIC 2')
     A                                      REFFLD(SSCOD1)
     A            NWSIC3    R               COLHDG('SIC 3')
     A                                      REFFLD(SSCOD1)
     A            NWSIC4    R               COLHDG('SIC 4')
     A                                      REFFLD(SSCOD1)
     **
     **=========================================================================
C007 A* SSPARR - BRANCH PRODUCT RATE
     **=========================================================================
OS999A            JPBKNN    R               COLHDG('Bank number')
OS999A                                      REFFLD(SSBANK)
 |   A            JPBRNN    R               COLHDG('Branch number')
 |   A                                      REFFLD(SSBRAN)
 |   A            JPAPCD    R               COLHDG('App' 'code')
 |   A                                      REFFLD(SSCOD2)
 |   A                                      TEXT('Application code '   )
 |   A            JPTYPE    R               COLHDG('Product' 'Type')
 |   A                                      REFFLD(SSPROD)
 |   A            JPRCUR    R               COLHDG('Currency')
 |   A                                      REFFLD(SSCURC)
 |   A            JPUBRR    R               COLHDG('Use branch rate')
 |   A                                      REFFLD(SSYON)
     **
     **=========================================================================
     A* SSPARS - system ID code
     **=========================================================================
     A            SSSYID    R               COLHDG('System ID')
     A                                      REFFLD(SSCODA)
     A            SSSYDS    R               COLHDG('System ID' 'Description')
     A                                      REFFLD(SSDESC)
     A            SSIACD    R               COLHDG('Internal' 'Appl Code')
     A                                      REFFLD(SSCOD2)
     A            SSCHNL    R               COLHDG('Channel' 'Y/N')
     A                                      REFFLD(SSCOD1)
     **=========================================================================
     A* SSPART - Account Type Code
     **=========================================================================
     A            STSYID    R               COLHDG('System ID')
     A                                      REFFLD(SSCODA)
     A            STACTP    R               COLHDG('Account' 'Type Code')
     A                                      REFFLD(SSCODA)
     A            STITYP    R               COLHDG('Internal Account' 'Type')
     A                                      REFFLD(SSACCT)
     A            STIDSS    R               COLHDG('Short' 'Description')
     A                                      REFFLD(SSDESS)
     A            STIDES    R               COLHDG('Description')
     A                                      REFFLD(SSDESC)
     **=========================================================================
     A* SSPARI - System Interface ID
     **=========================================================================
     A            SISYID    R               COLHDG('System ID')
     A                                      REFFLD(SSCODA)
     A            SIIFCD    R               COLHDG('Interface ID')
     A                                      REFFLD(SSCODA)
     A            SIIFDS    R               COLHDG('Interface ID' 'Desc')
     A                                      REFFLD(SSDESC)
     **=========================================================================
     ** SSMJHD - Multiple Job handler Header
     **=========================================================================
     A            SHACD2    R               COLHDG('App' 'code')
     A                                      REFFLD(SSCOD2)
     A                                      TEXT('Application code (2)')
     ** Name of the program
     A            SHBPGM    R               COLHDG('Program name')
     A                                      REFFLD(SSNAME)
     ** Description
     A            SHBDES    R               COLHDG('Description')
     A                                      REFFLD(SSDESC)
     ** SQL statement
     A            SHSQLS    R               COLHDG('SQL Select' 'Statement')
     A**********                            REFFLD(SSINFO)
     A                                      REFFLD(SSDESN)
     ** Number of jobs
     A            SHBNOJ    R               COLHDG('Number of' 'Jobs')
     A                                      REFFLD(SSCOU3)
     A            SHPFIL    R               COLHDG('File Name')
     A                                      REFFLD(SSNAME)
     A            SHPVEW    R               COLHDG('File View')
     A                                      REFFLD(SSNAME)
     A            SHLMEM    R               COLHDG('Load Memory')
     A                                      TEXT('Load Memory Option')
     A                                      REFFLD(SSCOD1)
     ** Elasped time duaration - Hours
     A            SHTIMDH   R               COLHDG('Elasped-Hours')
     A                                      REFFLD(SSCOU9)
     ** Elasped time duaration - Minutes
     A            SHTIMDM   R               COLHDG('Elasped-Minutes')
     A                                      REFFLD(SSCOU9)
     ** Elasped time duaration - Seconds
     A            SHTIMDS   R               COLHDG('Elasped-Seconds')
     A                                      REFFLD(SSCOU9)
     ** Elasped time duaration - Milliseconds
     A            SHTIMDMS  R               COLHDG('Elasped-MilliSeconds')
     A                                      REFFLD(SSCOU9)
     ** Start Timestamp
     A            SHSTIM    R               COLHDG('Start Timestamp')
     A                                      REFFLD(SSTIME)
     ** End Timestamp
     A            SHETIM    R               COLHDG('End Timestamp')
     A                                      REFFLD(SSTIME)
     **=========================================================================
     ** SSMJDT - Multiple Job handler detail
     **=========================================================================
     A            SDACD2    R               COLHDG('App' 'code')
     A                                      REFFLD(SSCOD2)
     A                                      TEXT('Application code (2)')
     ** Name of the program
     A            SDBPGM    R               COLHDG('Program name')
     A                                      REFFLD(SSNAME)
     A            SDJOBN    R               COLHDG('Job Name')
     A                                      REFFLD(SSDESS)
     A            SDPVEW    R               COLHDG('File View')
     A                                      REFFLD(SSDESS)
     ** Beginning rec number
     A            SDBEGB    R               COLHDG('Beginning' 'record' -
     A                                      'number')
     A                                      REFFLD(SSCOUB)
     ** Ending rec number
     A            SDENDB    R               COLHDG('Ending' 'record' -
     A                                      'number')
     A                                      REFFLD(SSCOUB)
     ** re-start RRN
     A            SDRSR     R               COLHDG('Re-start' 'RRN')
     A                                      REFFLD(SSCOUB)
     ** Total Rec
     A            SDTOTR    R               COLHDG('Number of' 'Records')
     A                                      REFFLD(SSCOU7)
     ** Status of this job
     A            SDSTAT    R               COLHDG('Status')
     A                                      REFFLD(SSCOD1)
     A* A=Active
     A* C=Completed
     A* R=Ready to run
     **
     ** Current number of accounts that have been processed
     A            SDPACT    R               COLHDG('Processed' 'records')
     A                                      REFFLD(SSCOU7)
     ** Percent of accounts processed
     A            SDCOMP    R               COLHDG('Percent' 'Complete')
     A                                      REFFLD(SSPERP)
     ** Elasped time duaration - Hours
     A            SDTIMDH   R               COLHDG('Elasped-Hours')
     A                                      REFFLD(SSCOU9)
     ** Elasped time duaration - Minutes
     A            SDTIMDM   R               COLHDG('Elasped-Minutes')
     A                                      REFFLD(SSCOU9)
     ** Elasped time duaration - Seconds
     A            SDTIMDS   R               COLHDG('Elasped-Seconds')
     A                                      REFFLD(SSCOU9)
     ** Elasped time duaration - Milliseconds
     A            SDTIMDMS  R               COLHDG('Elasped-MilliSeconds')
     A                                      REFFLD(SSCOU9)
     ** Start Timestamp
     A            SDSTIM    R               COLHDG('Start Timestamp')
     A                                      REFFLD(SSTIME)
     ** End Timestamp
     A            SDETIM    R               COLHDG('End Timestamp')
     A                                      REFFLD(SSTIME)
     ** System Job info
     A            SDSJOB    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Job Name')
     A            SDSUSR    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Job User')
     A            SDSJBN    R
     A                                      REFFLD(SSCOD6)
     A                                      COLHDG('Job Number')
     **=========================================================================
     A* HELP PROGRAM PARAMETER - SSPARX
     **=========================================================================
     A            SSHAPP    R               COLHDG('Help' 'application')
     A                                      REFFLD(SSCOD2)
     A            SSHSEQ    R               COLHDG('Help program' 'seq')
     A                                      REFFLD(SSCOU3)
     A            SSHPGM    R               COLHDG('Help program' 'name')
     A                                      REFFLD(SSNAME)
     A            SSHDES    R               COLHDG('Help program' 'description')
     A                                      REFFLD(SSDESC)
     **
     **=========================================================================
BP001A* SSPARW - LINE OF BUSINESS PARAMETER
     **=========================================================================
BP001A            SLBCOD    R               COLHDG('LINE OF BUSINESS' 'CODE')
BP001A                                      REFFLD(SSCOU3)
BP001A            SLBBKN    R               COLHDG('BANK NUMBER')
BP001A                                      REFFLD(SSBANK)
BP001A            SLBGLC    R               COLHDG('LINE OF BUSINESS' 'GL CODE')
BP001A                                      REFFLD(SSCOD2)
BP001A            SLBDSC    R               COLHDG('LINE OF BUSINESS' 'DESC')
BP001A                                      REFFLD(SSDESM)
     **
     **=========================================================================
     A* MASTER RATE INFORMATION - SSRATE
     **=========================================================================
     A            JRSTAT    R               COLHDG('Status')
     A                                      REFFLD(SSREID)
     A            JRRATN    R               COLHDG('Rate' 'number')
     A                                      REFFLD(SSRATE)
     A            JRRCUR    R               COLHDG('Rate' 'currency')
     A                                      REFFLD(SSCURC)
     A            JRCODE    R               COLHDG('Type maintenance')
     A                                      REFFLD(SSCOD1)
     A* A=ADD
     A* C=CHANGE
     A* D=DELETE
     A            JRCRAT    R               COLHDG('Current' 'rate')
     A                                      REFFLD(SSPERD)
     A            JRPRAT    R               COLHDG('Previous' 'rate')
     A                                      REFFLD(SSPERD)
     A            JRLFM8    R               COLHDG('Date last' -
     A                                      'maintenance')
     A                                      REFFLD(SSDAT8)
     A            JRRDA8    R               COLHDG('Next review' -
     A                                      'date')
     A                                      REFFLD(SSDAT8)
     A            JRRFRQ    R               COLHDG('Review' 'frequency')
     A                                      REFFLD(SSCOU3)
     A            JRRFRC    R               COLHDG('Review' 'frequency code')
     A                                      REFFLD(SSCOD1)
     A            JRRNAM    R               COLHDG('Rate' 'name')
     A                                      REFFLD(SSNAMS)
     A            JRDESC    R               COLHDG('Rate' 'description')
     A                                      REFFLD(SSDESC)
     A            JRBANK    R               COLHDG('Bank number')
     A                                      REFFLD(SSBANK)
C006 A            JRBRAN    R               COLHDG('Branch number')
C006 A                                      REFFLD(SSBRAN)
     A            JRREFR    R               COLHDG('Reference' 'Rate' 'number')
     A                                      REFFLD(SSRATE)
C020 A            JRREFV    R               COLHDG('Reference' 'variance code')
C020 A                                      REFFLD(SSCOD1)
C020 A*SS01                                 VALUES('+' '-' '%')
C020 A**C020      JRREFI    R               COLHDG('Reference' 'Rate' 'number')
C020 A            JRREFI    R               COLHDG('Reference' 'Rate variance')
     A                                      REFFLD(SSPERD)
V537 A            JRDPTN    R               COLHDG('Department' 'Identifier')
V537 A                                      REFFLD(SSCOU3)
W006 A            JRTYPE    R               COLHDG('Rate' 'type')
W006 A                                      REFFLD(SSCOD3)
T002 A*V88        JRB4RT    R               COLHDG('Before previous rate')
T002 A*V88                                  REFFLD(SSPERD)
T002 A*V88        JRB4DT    R               COLHDG('Before previous date')
T002 A*V88                                  REFFLD(SSDAT7)
T002 A*V88        JRPFMD    R               COLHDG('Date previous' 'file Maint')
T002 A*V88                                  REFFLD(SSDAT7)
T002 A            JROPER    R               COLHDG('Last changed by')
T002 A                                      REFFLD(SSCODA)
T002 A            JRSPER    R               COLHDG('Supervisor id')
T002 A                                      REFFLD(SSCODA)
V88  A            JRPPRT    R               COLHDG('Previous' 'old' 'rate')
V88  A                                      REFFLD(SSPERD)
V88  A            JRPTIM    R               COLHDG('Previous' 'Change' -
V88  A                                      'time')
V88  A                                      REFFLD(SSTIM6)
V88  A            JRPDT8    R               COLHDG('Previous' 'Date last' -
V88  A                                      'maintenance')
V88  A                                      REFFLD(SSDAT8)
     **
     **=========================================================================
     A* MASTER RATE HISTORY - SSRATH
     **=========================================================================
     A            JRTIME    R               COLHDG('Change Time')
     A                                      REFFLD(SSTIM6)
     A            JRWSID    R               COLHDG('Workstation Id')
     A                                      REFFLD(SSNAME)
     A            JRUSID    R               COLHDG('User Id')
     A                                      REFFLD(SSNAME)
     **
     **=========================================================================
C011 A* FUTURE RATE MASTER - SSRATX
     **=========================================================================
C011 A            JXRATN    R               COLHDG('Rate' 'number')
C011 A                                      REFFLD(SSRATE)
C011 A            JXRCUR    R               COLHDG('Currency')
C011 A                                      REFFLD(SSCURC)
C011 A            JXBANK    R               COLHDG('Bank number')
C011 A                                      REFFLD(SSBANK)
C011 A            JXBRAN    R               COLHDG('Branch number')
C011 A                                      REFFLD(SSBRAN)
C011 A            JXEFD8    R               COLHDG('Effective' 'date')
C011 A                                      REFFLD(SSDAT8)
C011 A            JXRATE    R               COLHDG('Rate')
C011 A                                      REFFLD(SSPERD)
C011 A            JXRED8    R               COLHDG('Rate entry' 'date')
C011 A                                      REFFLD(SSDAT8)
C011 A            JXECD8    R               COLHDG('Loans Exist A/C' 'Eff.date')
C011 A                                      REFFLD(SSDAT8)
C011 A            JXTIME    R               COLHDG('Change Time')
C011 A                                      REFFLD(SSTIM6)
C011 A            JXWSID    R               COLHDG('Workstation Id')
C011 A                                      REFFLD(SSNAME)
C011 A            JXUSID    R               COLHDG('User Id')
C011 A                                      REFFLD(SSNAME)
V5001A            JRAUTO    R               COLHDG('Automatic update')
V5001A                                      REFFLD(SSCOD1)
V5001A            JRRTBK    R               COLHDG('Ref rate' 'bank number')
V5001A                                      REFFLD(SSBANK)
V5001A            JRRRTN    R               COLHDG('Ref rate' 'number')
V5001A                                      REFFLD(SSRATE)
V88 1A            JRMAXR    R               COLHDG('Maximum' 'rate')
V88  A                                      REFFLD(SSPERD)
V88 1A            JRMINR    R               COLHDG('Minimum' 'rate')
V88  A                                      REFFLD(SSPERD)
     **
R118 **=========================================================================
R118 ** SIBSPAR - SIBS SYSTEM SETTING
R118 **=========================================================================
R118 A            SIBCD3    R               COLHDG('SIBS' 'Code')
R118 A                                      REFFLD(SSCOD3)
R118 A                                      TEXT('SIBS code (3)')
R118 A            SIBDSC    R               COLHDG('SIBS' 'Code Desc')
R118 A                                      REFFLD(SSDESC)
R118 A                                      TEXT('SIBS Code Desc')
R118 **=========================================================================
R118 ** SIBSPAR1- SIBS LIBRARY LIST
R118 **=========================================================================
R118 A            SIBLIB    R               COLHDG('Library' 'Name')
R118 A                                      REFFLD(SSNAME)
R118 A                                      TEXT('Library Name')
R118 A            SIBDES    R               COLHDG('Library' 'Desc')
R118 A                                      REFFLD(SSDESC)
R118 A                                      TEXT('Library Desc')
R118 A            SIBTYP    R               COLHDG('Library' 'Type')
R118 A                                      REFFLD(SSCOD1)
R118 A                                      TEXT('Library Type')
R118 A            SIBCRI    R               COLHDG('Critical' 'Library')
R118 A                                      REFFLD(SSCOD1)
R118 A                                      TEXT('Critical Library')
R118 A            SIBBCK    R               COLHDG('Backup' 'Library')
R118 A                                      REFFLD(SSCOD1)
R118 A                                      TEXT('Backup Library')
R118 A            SIBJRN    R               COLHDG('Journal' 'Library')
R118 A                                      REFFLD(SSCOD1)
R118 A                                      TEXT('Journal Library')
     **=========================================================================
SS02 ** SSSPAR - ENVIRONMENT SETTING BY APPLICATION
     **=========================================================================
     A**          SSACD2    R               COLHDG('App' 'code')
     A**                                    REFFLD(SSCOD2)
     A**                                    TEXT('Application code (2)')
R108 ** Subsystem
R108 A            SSBCSB    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('Batch Run' 'SbsD')
R108 ** Subsystem Class
R108 A            SSBCCL    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('Batch Run' 'Cls')
R108 ** Job Queue
R108 A            SSBCJQ    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('Batch Run' 'JobQ')
     ** Job Description Setting
     A            SSBCJD    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Batch Run' 'JobD')
R108 ** Subsystem
R108 A            SSOLSB    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('Online' 'SbsD')
R108 ** Subsystem Class
R108 A            SSOLCL    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('Online' 'Cls')
R108 ** Job Queue
R108 A            SSOLJQ    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('Online' 'JobQ')
     ** Job Description Setting
     A            SSOLJD    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Online' 'JobD')
R108 ** Subsystem
R108 A            SS24SB    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('24H' 'SbsD')
R108 ** Subsystem Class
R108 A            SS24CL    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('24H' 'Cls')
R108 ** Job Queue
R108 A            SS24JQ    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('24H' 'JobQ')
     ** Job Description Setting
     A            SS24JD    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('24H' 'JobD')
R108 ** Subsystem
R108 A            SSIFSB    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('Interface' 'SbsD')
R108 ** Subsystem Class
R108 A            SSIFCL    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('Interface' 'Cls')
R108 ** Job Queue
R108 A            SSIFJQ    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('Interface' 'JobQ')
     ** Job Description Setting
     A            SSIFJD    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Interface' 'JobD')
R108 ** Subsystem
R108 A            SSRDSB    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('RD' 'SbsD')
R108 ** Subsystem Class
R108 A            SSRDCL    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('RD' 'Cls')
R108 ** Job Queue
R108 A            SSRDJQ    R
R108 A                                      REFFLD(SSNAME)
R108 A                                      CHECK(VN)
R108 A                                      COLHDG('RD' 'JobQ')
     ** Job Description Setting
     A            SSRDJD    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('RD' 'JobD')
     ** lib setting
     A            SSEVLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Environment' 'library')
     A            SSPRLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Parameter' 'Library')
     A            SSDTLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Data' 'Library')
     A            SS24LB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('24H' 'Library')
     A            SSDMLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Data Mart' 'library')
     A            SSIFLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Interface' 'library')
     A            SSWRLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Work File' 'library')
     A            SSARLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Archive' 'library')
     A            SSRNLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Run' 'library')
     A            SSSRLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Source' 'library')
     A            SSSVLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Save file' 'library')
     A            SSOQLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('OUTQ' 'library')
     A            SSJNLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Journal' 'Library')
     A            SSDQLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Data Queue' 'Library')
     A            SSDALB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Data Area' 'Library')
     A            SSJDLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Job Description' 'Library')
     A            SSMSLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Message File' 'Library')
     A            SSMLLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Multi Language' 'Library')
     A            SSSOLB    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('System Object' 'Library')
     **
     A            SSBAKD    R
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A                                      COLHDG('Backup Media')
     **
     **=========================================================================
     A* STATE INFORMATION - SSSTAT
     **=========================================================================
     A            SSSCOC    R               COLHDG('Country' 'code')
     A                                      REFFLD(SSSTA3)
     A            SSSTAC    R               COLHDG('State' 'code')
     A                                      REFFLD(SSSTA3)
     A            SSSTAN    R               COLHDG('State' 'name')
     A                                      REFFLD(SSNAMS)
     A            SSSSUB    R               COLHDG('State' 'subdivision')
     A                                      REFFLD(SSNAMS)
     A            SSSWRT    R               COLHDG('W/H rate')
     A                                      REFFLD(SSPERD)
     A            SSSREB    R               COLHDG('Rebate method')
     A                                      REFFLD(SSNAME)
     A            SSSRVC    R               COLHDG('Revolving credit' 'method')
     A                                      REFFLD(SSNAME)
     A            SSSTXT    R               COLHDG('State' 'text')
     A                                      REFFLD(SSDESC)
     **
     **=========================================================================
SS03 A** W/H TAX OVERRIDING GROUP - SSWHTG
     **=========================================================================
SS03 A            SWHBNK    R               REFFLD(SSBANK)
SS03 A                                      COLHDG('Bank' 'Code')
SS03 A            SWHGRP    R               REFFLD(SSCODA)
SS03 A                                      COLHDG('W/H' 'Group')
SS03 A            SWHCUR    R               REFFLD(SSCURC)
SS03 A                                      COLHDG('W/H' 'Currency')
SS03 A            SWHATP    R               REFFLD(SSACCT)
SS03 A                                      COLHDG('W/H' 'Account Type')
SS03 A            SWHSEQ    R               REFFLD(SSCOU3)
SS03 A                                      COLHDG('W/H' 'Sequence')
SS03 A** OVERRIDEN W/H TAX CODE
SS03 A            SWHCOD    R               REFFLD(SSWITH)
SS03 A                                      COLHDG('Overridden' 'W/H Code')
SS03 A** CIF CLASS CODE (A-Z)
SS03 A            SWHCLS    R               REFFLD(SSCOD1)
SS03 A                                      COLHDG('Customer' 'Class Code')
SS03 A** LOCAL CITIZENSHIP (YES/NO)
SS03 A            SWHCTZ    R               REFFLD(SSCOD1)
SS03 A                                      COLHDG('Citizenship')
SS03 A** RESIDENT (YES/NO)
SS03 A            SWHRES    R               REFFLD(SSCOD1)
SS03 A                                      COLHDG('Resident')
SS03 A** AGE RANGE (000 TO 999)
SS03 A            SWHAG1    R               REFFLD(SSCOU3)
SS03 A                                      COLHDG('Age' 'From')
SS03 A            SWHAG2    R               REFFLD(SSCOU3)
SS03 A                                      COLHDG('Age' 'To')
SS03 A            SWHAGC    R               REFFLD(SSCOD1)
SS03 A                                      COLHDG('Age' 'Code')
SS03 A** BALANCE RANGE (0 TO ALL'9')
SS03 A            SWHBL1    R               REFFLD(SSAMT4)
SS03 A                                      COLHDG('Balance' 'From')
SS03 A            SWHBL2    R               REFFLD(SSAMT4)
SS03 A                                      COLHDG('Balance' 'To')
SS03 A** TENURE RANGE (FD ONLY)
SS03 A            SWHTR1    R               REFFLD(SSCOU5)
SS03 A                                      COLHDG('Tenure' 'From')
SS03 A            SWHTR2    R               REFFLD(SSCOU5)
SS03 A                                      COLHDG('Tenure' 'To')
     **
     **=========================================================================
     A* FED W/H CODES - SSWITH
     **=========================================================================
     A            SSWBNK    R               COLHDG('Bank' 'Code')
     A                                      REFFLD(SSBANK)
     A            SSWCOD    R               COLHDG('W/H' 'code')
     A                                      REFFLD(SSWITH)
     A            SSWCUR    R               COLHDG('W/H' 'currency')
     A                                      REFFLD(SSCURC)
     A            SSWATP    R               COLHDG('W/H' 'account type')
     A                                      REFFLD(SSACCT)
     A            SSWDES    R               COLHDG('W/H' 'description')
     A                                      REFFLD(SSDESS)
     A            SSWLID    R               COLHDG('W/H' 'identifier')
     A                                      REFFLD(SSREID)
     A            SSWHRT    R               COLHDG('W/H rate')
     A                                      REFFLD(SSPERD)
     A            SSWEBL    R               COLHDG('W/H exempt' 'balance')
     A                                      REFFLD(SSAMT4)
     A            SSWEBC    R               COLHDG('W/H exempt' 'balance code')
     A                                      REFFLD(SSCOD1)
     A* E=Exemption amount
     A* L=Limit amount
C015 A* I=Use limit amount, if tax calculated > interest, tax = interest
     A*  =None
     A            SSWERT    R               COLHDG('W/H exempt' 'rate')
     A                                      REFFLD(SSPERD)
     A            SSWERC    R               COLHDG('W/H exempt' 'rate code')
     A                                      REFFLD(SSCOD1)
     A* C=Current rate
     A* H=Highest rate in int pmt period
     A            SSWPPT    R               COLHDG('W/H exempt' 'period term')
     A                                      REFFLD(SSCOU3)
     A            SSWPPC    R               COLHDG('W/H exempt' 'period code')
     A                                      REFFLD(SSCOD1)
     A* D=Days
     A* M=Months
     A            SSANUL    R               COLHDG('W/H exempt' 'access yrly')
     A                                      REFFLD(SSYON)
ccy  A            SSWEIN    R               COLHDG('W/H exempt' 'Interest')
ccy  A                                      REFFLD(SSAMT4)
ccy  A            SSWEIM    R               COLHDG('W/H exempt' 'Int Method')
ccy  A                                      TEXT('W/H exempt Interest Method')
ccy  A                                      REFFLD(SSYON)
ccy  A* F=Tax Full Interest
ccy  A* N=Tax Net Interest
ccy  A*  =None
PG   A            SSWHR2    R               COLHDG('W/H rate 2')
PG   A                                      REFFLD(SSPERD)
PG   A            SSWEB2    R               COLHDG('W/H exempt' 'balance 2')
PG   A                                      REFFLD(SSAMT4)
PG   A            SSWBC2    R               COLHDG('W/H exempt' 'condition' -
PG   A                                      'Code 2')
PG   A                                      REFFLD(SSCOD1)
PG   A            SSWHR3    R               COLHDG('W/H rate 3')
PG   A                                      REFFLD(SSPERD)
PG   A            SSWEB3    R               COLHDG('W/H exempt' 'balance 3')
PG   A                                      REFFLD(SSAMT4)
PG   A            SSWBC3    R               COLHDG('W/H exempt' 'condition' -
PG   A                                      'Code 3')
PG   A                                      REFFLD(SSCOD1)
PG   A            SSWHR4    R               COLHDG('W/H rate 4')
PG   A                                      REFFLD(SSPERD)
PG   A            SSWEB4    R               COLHDG('W/H exempt' 'balance 4')
PG   A                                      REFFLD(SSAMT4)
PG   A            SSWBC4    R               COLHDG('W/H exempt' 'condition' -
PG   A                                      'Code 4')
PG   A                                      REFFLD(SSCOD1)
PG   A            SSWHR5    R               COLHDG('W/H rate 5')
PG   A                                      REFFLD(SSPERD)
PG   A            SSWEB5    R               COLHDG('W/H exempt' 'balance 5')
PG   A                                      REFFLD(SSAMT4)
PG   A            SSWBC5    R               COLHDG('W/H exempt' 'condition' -
PG   A                                      'Code 5')
PG   A                                      REFFLD(SSCOD1)
     **
     **=========================================================================
     A* PTF REQUEST FILE - SSWRKR
     **=========================================================================
     A            RQRQID    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Request ID')
     A            RQTYPE    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Request' 'type')
     A*SS01                                 VALUES('*CHG' -
     A*SS01                                 '*DEMO' -
     A*SS01                                 '*DOC' -
     A*SS01                                 '*EDUCATE' -
     A*SS01                                 '*FIX' -
     A*SS01                                 '*FSD' -
     A*SS01                                 '*CVT' -
     A*SS01                                 '*NEW' -
     A*SS01                                 '*OTHER' -
     A*SS01                                 '*RFP' -
     A*SS01                                 '*SUPPORT')
     A* *CHG      =Programming change or enhancement
     A* *DEMO     =Demonstration
     A* *DOC      =Documentation
     A* *EDUCATE  =Education
     A* *FIX      =Programming fix
     A* *FSD      =Functional specifications definition
     A* *CVT      =Conversion
     A* *NEW      =Programming new feature
     A* *OTHER    =Not otherwise assigned
     A* *RFP      =Request for proposal
     A* *SUPPORT  =Support call
     A            RQFCAN    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Customer' 'number')
     A                                      TEXT('Request customer number')
     A            RQFCUS    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Reference' 'number')
     A                                      TEXT('Request reference number')
     A            RQAPPL    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('App')
     A                                      TEXT('Request application')
     A*SS01                                 VALUES('AC' 'AT' 'BD' 'CD' 'CF' -
     A*SS01                                 'DD' 'GL' 'SS' 'LN' 'OD' -
     A*SS01                                 'SD' 'SH' 'TL' '  ' '*ALL')
     A            RQMSYS    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Request' 'system')
     A*SS01                                 VALUES('Silverlake' 'SILVERLAKE')
     A            RQPRIO    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Priority')
     A                                      TEXT('Request priority')
     A*SS01                                 VALUES('0' '1' '2' '3' '4' '5' -
     A*SS01                                 '6' '7' '8' '9')
     A* 0=No priority assigned
     A* 1=Lowest priority
     A* 9=Highest priority
     A            RQRCD8    R
     A                                      REFFLD(SSDAT8)
     A                                      COLHDG('Date' 'recieved')
     A                                      TEXT('Date request recieved -
     A                                      - MMDDYY')
     A            RQRCDT    R
     A                                      REFFLD(SSTIM6)
     A                                      COLHDG('Time' 'recd')
     A                                      TEXT('Time request recieved -
     A                                      - HHMMSS')
     A            RQINIT    R
     A                                      REFFLD(SSNAML)
     A                                      COLHDG('Request' 'initiated by')
     A            RQIJOB    R
     A                                      REFFLD(SSJOBN)
     A                                      COLHDG('Request' 'initiating job')
     A            RQIDT8    R
     A                                      REFFLD(SSDAT8)
     A                                      COLHDG('Date' 'requested')
     A                                      TEXT('Date request initiated -
     A                                      - MMDDYY')
     A            RQITIM    R
     A                                      REFFLD(SSTIM6)
     A                                      COLHDG('Time' 'requested')
     A                                      TEXT('Time request initiated -
     A                                      - HHMMSS')
     A            RQIPGM    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Request' 'initiating' -
     A                                      'program')
     A            RQIFIL    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Request' 'initiating file')
     A            RQIFMT    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Request' 'initiating' -
     A                                      'format')
     A            RQDOCU    R
     A                                      REFFLD(SSYENO)
     A                                      COLHDG('Documentation')
     A                                      TEXT('Request documentation -
     A                                      provided')
     A*SS01                                 VALUES('*YES' '*NO')
     A            RQRCDB    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Received by')
     A                                      TEXT('Request received by')
     A            RQDISP    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Disposition')
     A                                      TEXT('Request disposition')
     A*SS01                                 VALUES('*CANCELED' -
     A*SS01                                 '*COMPLETED' '*DOCUMENT' -
     A*SS01                                 '*INPROCESS' -
     A*SS01                                 '*OPEN' '*TEST')
     A* *CANCELED =Canceled request
     A* *COMPLETED=Completed request
     A* *INPROCESS=Request in process of being resolved
     A* *OPEN     =Open request
     A* *WO       =W/O created
     A            RQASTO    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Assigned to')
     A                                      TEXT('Request assigned to')
     A            RQDIS8    R
     A                                      REFFLD(SSDAT8)
     A                                      COLHDG('Date' 'disposed')
     A                                      TEXT('Date request disposed -
     A                                      - MMDDYY')
     A            RQDIST    R
     A                                      REFFLD(SSTIM6)
     A                                      COLHDG('Time' 'disposed')
     A                                      TEXT('Time request disposed -
     A                                      - HHMMSS')
     A            RQNCHR    R
     A                                      REFFLD(SSAMTA)
     A                                      COLHDG('Nonchargeable' ' hours')
     A            RQRTXT    R
     A                                      REFFLD(SSDESC)
     A                                      COLHDG('Request text')
     A            RQDESC    R
     A                                      REFFLD(SSDESX)
     A                                      COLHDG('Description' 'of request')
     A            RQTEXT    R
     A                                      REFFLD(SSDESX)
     A                                      COLHDG('Description' -
     A                                      'of disposition')
     **=========================================================================
     A* BANK PROCESSING RUN DATA AREA - SS9913DS
     **=========================================================================
     A            ACPRE     R               COLHDG('ACH preprocessing' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            ACRUN     R               COLHDG('ACH run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
R103 A            ACPRT     R               COLHDG('ACH print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
R103 A            RMRUN     R               COLHDG('REM run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
R103 A            RMPRT     R               COLHDG('REM print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
R103 A            FCRUN     R               COLHDG('FCY run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
R103 A            FCPRT     R               COLHDG('FCY print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
R115 A            CMRUN     R               COLHDG('CMS run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
R115 A            CMPRT     R               COLHDG('CMS print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            ATPRE     R               COLHDG('ATM preprocessing' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            ATRUN     R               COLHDG('ATM run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            BDRUN     R               COLHDG('Investment run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            CDRUN     R               COLHDG('C/D run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            CDPRT     R               COLHDG('Time deposit print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            CFRUN     R               COLHDG('CIF run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            CFPRT     R               COLHDG('CIF print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
SS01 A            CLRUN1    R               COLHDG('CLM part 1 run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
SS01 A            CLRUN2    R               COLHDG('CLM part 2 run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
SS01 A            CLPRT     R               COLHDG('CLM print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
SS01 A            CRRUN     R               COLHDG('Central Reporting' 'run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
SS01 A            CRPRT     R               COLHDG('Central Reporting' 'print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            DDRUN     R               COLHDG('Deposit run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            DDAFT     R               COLHDG('AFT run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            DDPRT     R               COLHDG('Deposit print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            GLRUN     R               COLHDG('G/L run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            GLPUL     R               COLHDG('G/L pull' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            GLPRT     R               COLHDG('G/L print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            GLRSLEV2  R               COLHDG('G/L Restart level 2' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            INLRUN    R               COLHDG('INL pre-batch' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            IFPRT     R               COLHDG('IF Print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            ODRUN     R               COLHDG('ODP run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            ODSTM     R               COLHDG('ODP statement' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            ODPRT     R               COLHDG('ODP print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            LNRUN     R               COLHDG('Loan run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            LNPRT     R               COLHDG('Loan print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
SS01 A            NPRUN     R               COLHDG('Non Performing run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
SS01 A            NPPRT     R               COLHDG('Non Performing print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            PDRUN     R               COLHDG('Proof Of Deposit' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            PDPRE     R               COLHDG('POD preprocessing' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            RCRUN     R               COLHDG('Reconciliation run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            PRTCTL    R               COLHDG('Report print control' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            RDPRT     R               COLHDG('RD Print processing' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            EPPRT     R               COLHDG('EP Print processing' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            RDPRTEXI  R               COLHDG('Report print control' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SDRUN     R               COLHDG('Safe deposit run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            RSLEV1    R               COLHDG('Restart level 1' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            RSLEV2    R               COLHDG('Restart level 2' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            RSLEV3    R               COLHDG('Restart level 3' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SSEOD     R               COLHDG('Daily run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SSCPY     R               COLHDG('System copy' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SSCLR     R               COLHDG('Processing reset' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SSFIC     R               COLHDG('Fiche processing' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SSEIP     R               COLHDG('EIP run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SSRUN     R               COLHDG('System run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SSPRT     R               COLHDG('System print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SSPRTCTL  R               COLHDG('Report print control' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SMRUN     R               COLHDG('Share Margin Run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            SMPRT     R               COLHDG('Share Margin print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            TFRUN     R               COLHDG('Trade Finance run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            TFPRT     R               COLHDG('TF Print processing' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            TEPRE     R               COLHDG('Teller preprocessing' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            TECLR     R               COLHDG('Teller reset' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            TERUN     R               COLHDG('Teller run' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
     A            TEPRT     R               COLHDG('Teller print' -
     A                                      'status data area')
     A                                      REFFLD(SSNAME)
R105 A            MBRUN     R               COLHDG('MBASE run' -
R105 A                                      'status data area')
R105 A                                      REFFLD(SSNAME)
R105 A            DSPRUN    R               COLHDG('DSP run' -
R105 A                                      'status data area')
R105 A                                      REFFLD(SSNAME)
R106 A            SIBSRUN   R               COLHDG('SIBS run' -
R106 A                                      'status data area')
R106 A                                      REFFLD(SSDESP)
R112 A            SSEODZ1   R               COLHDG('ZONE 1 run' -
R112 A                                      'status data area')
R112 A                                      REFFLD(SSNAME)
R112 A            SSEODZ2   R               COLHDG('ZONE 2 run' -
R112 A                                      'status data area')
R112 A                                      REFFLD(SSNAME)
R112 A            SSEODZ3   R               COLHDG('ZONE 3 run' -
R112 A                                      'status data area')
R112 A                                      REFFLD(SSNAME)
R112 A            SSEODZ4   R               COLHDG('ZONE 4 run' -
R112 A                                      'status data area')
R112 A                                      REFFLD(SSNAME)
     A*****************************************************************
     ** DATA FILES - QSYSSRCDDS
     A*****************************************************************
     **=========================================================================
     ** System Backup Library List File- SSBK02F
     **=========================================================================
     A            SBDAT8    R               COLHDG('Backup Date 8')
     A                                      REFFLD(SSDAT8)
     A            SBAPP     R               COLHDG('Application Code')
     A                                      REFFLD(SSCOD2)
R121 A            SBAP3     R               COLHDG('Application Code')
R121 A                                      REFFLD(SSCOD3)
     A            SBLIB     R               COLHDG('Library')
     A                                      REFFLD(SSNAME)
     A            SBSAVF    R               COLHDG('Save File')
     A                                      REFFLD(SSNAME)
     A            SBSLIB    R               COLHDG('Save File Library')
     A                                      REFFLD(SSNAME)
     A            SBSTS     R               COLHDG('Status')
     A                                      REFFLD(SSNAME)
     A            SBTEXT    R               COLHDG('Description')
     A                                      REFFLD(SSDESM)
     A            SBJOB     R               COLHDG('Process Job')
     A                                      REFFLD(SSNAME)
     A            SBUSER    R               COLHDG('Process User')
     A                                      REFFLD(SSNAME)
     A            SBNBR     R               COLHDG('Process Number')
     A                                      REFFLD(SSJNBR)
     A            SBCCID    R               COLHDG('Created User')
     A                                      REFFLD(SSNAME)
     A            SBCCD8    R               COLHDG('Created Date')
     A                                      REFFLD(SSDAT8)
     A            SBCCTM    R               COLHDG('Created Time')
     A                                      REFFLD(SSTIME)
     A            SBWMID    R               COLHDG('Workstation ID')
     A                                      REFFLD(SSNAME)
     **
     **=========================================================================
     ** System Backup Library List File- SSBK05F
     **=========================================================================
     A            S5SAPP    R               COLHDG('Application Code')
     A                                      REFFLD(SSCOD2)
R121 A            S5SAP3    R               COLHDG('Application Code')
R121 A                                      REFFLD(SSCOD3)
     A            S5SLIB    R               COLHDG('Library Name')
     A                                      REFFLD(SSNAME)
R121 A            S5SLTY    R               COLHDG('Library Type')
R121 A                                      REFFLD(SSCOD1)
     A*R110       S5SFB4    R               COLHDG('Save File' 'Before')
     A*R110                                 REFFLD(SSNAME)
     A*R110       S5SFAF    R               COLHDG('Save File' 'After')
     A*R110                                 REFFLD(SSNAME)
R110 A            S5SFS1    R               COLHDG('Save File' '1')
R110 A                                      REFFLD(SSNAME)
R110 A            S5SFS2    R               COLHDG('Save File' '2')
R110 A                                      REFFLD(SSNAME)
R110 A            S5SFS3    R               COLHDG('Save File' '3')
R110 A                                      REFFLD(SSNAME)
     A            S5TXT1    R               COLHDG('Source Text')
     A                                      REFFLD(SSDESC)
R122 **=========================================================================
R122 ** System Backup File List - SSBK07F
R122 **=========================================================================
R122 A            S7SAP3    R               COLHDG('Application Code')
R122 A                                      REFFLD(SSCOD3)
R122 A            S7SFNM    R               COLHDG('From File Name')
R122 A                                      REFFLD(SSNAME)
R122 A            S7SEQN    R               COLHDG('Sequence Number')
R122 A                                      REFFLD(SSCOU3)
R122 A            S7STNM    R               COLHDG('To File Name')
R122 A                                      REFFLD(SSNAME)
R122 A            S7SFTY    R               COLHDG('Library Type of File')
R122 A                                      REFFLD(SSCOD1)
R122 A            S7DTE8    R               COLHDG('File' 'Date from PAR1')
R122 A                                      REFFLD(SSDAT8)
R122 A            S7TIME    R               COLHDG('System' 'Time')
R122 A                                      REFFLD(SSTIME)
     **
     **=========================================================================
     A* MAINTENANCE FORMATTER - SSFORM
     **=========================================================================
     A            NFMT      R               COLHDG('Format input')
     A                                      REFFLD(SSNAML)
     A            OFMT      R               COLHDG('Format output')
     A                                      REFFLD(SSNAML)
     **
     **=========================================================================
SS07 ** SSJOBEV- Batch Job Run Event Control
     **=========================================================================
     A            SVACD2    R
     A                                      REFFLD(SSCOD2)
     A                                      COLHDG('Application code')
     A            SVJOBE    R
     A                                      REFFLD(SSDESS)
     A                                      COLHDG('Job Event')
     A            SVJDEP    R
     A                                      REFFLD(SSDESS)
     A                                      COLHDG('Job Dependancy')
     A            SVDESC    R
     A                                      REFFLD(SSDESM)
     A                                      COLHDG('Job Event' 'Description')
     A            SVJDLY    R
     A                                      REFFLD(SSCOU9)
     A                                      COLHDG('Job Delay Retry')
     A            SVJBYP    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Job Allow' 'Bypass')
     A            SVJBRT    R
     A                                      REFFLD(SSCOU9)
     A                                      COLHDG('Job Retry')
     A            SVJSEV    R
     A                                      REFFLD(SSCOD2)
     A                                      COLHDG('Job Event' 'Severity')
     A            SVJOBN    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Job Name')
     A            SVUSRN    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Job User')
     A            SVJBNO    R
     A                                      REFFLD(SSCOD6)
     A                                      COLHDG('Job Number')
R120 A            SVSTRT    R
R120 A                                      REFFLD(SSTIME)
R120 A                                      COLHDG('Start Timestamp')
R120 A            SVENDT    R
R120 A                                      REFFLD(SSTIME)
R120 A                                      COLHDG('End Timestamp')
R120 A            SVDURA    R
R120 A                                      REFFLD(SSCOD8)
R120 A                                      COLHDG('Duration' 'hh:mm:ss')
R120 A            SVETIM    R
R120 A                                      REFFLD(SSCOU7)
R120 A                                      COLHDG('Duration' 'Seconds')
     **=========================================================================
SS07 ** SSJOBBY- Batch Job Run Event Bypass Control
     **=========================================================================
     A            SBACD2    R
     A                                      REFFLD(SSCOD2)
     A                                      COLHDG('Application code')
     A            SBJOBE    R
     A                                      REFFLD(SSDESS)
     A                                      COLHDG('Job Event')
     A            SBJDEP    R
     A                                      REFFLD(SSDESS)
     A                                      COLHDG('Job Dependancy')
     A            SBJBDT    R
     A                                      REFFLD(SSDAT8)
     A                                      COLHDG('JE' 'Bypass Date')
     A            SBJBBY    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('JE' 'Bypass Y/N')
     A            SBDESC    R
     A                                      REFFLD(SSDESM)
     A                                      COLHDG('JE' 'Bypass Desc')
R120 A            SBSTRT    R
R120 A                                      REFFLD(SSTIME)
R120 A                                      COLHDG('Start Timestamp')
R120 A            SBENDT    R
R120 A                                      REFFLD(SSTIME)
R120 A                                      COLHDG('End Timestamp')
R120 A            SBDURA    R
R120 A                                      REFFLD(SSCOD8)
R120 A                                      COLHDG('Duration' 'hh:mm:ss')
R120 A            SBETIM    R
R120 A                                      REFFLD(SSCOU7)
R120 A                                      COLHDG('Duration' 'Seconds')
     **=========================================================================
SS02 ** SSJOBL - PROGRAM JOB LOG FILE
     **=========================================================================
R102 A            BTZONE    R
R102 A                                      REFFLD(SSCOD2)
R102 A                                      COLHDG('Zone Staging')
     A            BTKEY     R
     A                                      REFFLD(SSDESS)
     A                                      COLHDG('Job Event')
     A            BTSEQ     R
     A                                      REFFLD(SSCOU5)
     A                                      COLHDG('Sequence')
     A            BTACD2    R
     A                                      REFFLD(SSCOD2)
     A                                      COLHDG('Application code')
     A            BTOPT     R
     A                                      REFFLD(SSCOD8)
     A                                      COLHDG('Log' 'Option')
     A            BTACT     R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Dupliate' 'Action')
     A            BTSTA     R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Run' 'Status')
     A            BTDAT8    R
     A                                      REFFLD(SSDAT8)
     A                                      COLHDG('Run Date8' 'YYYYMMDD')
     A            BTBPGM    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Running' 'Program')
     A            BTCPGM    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Calling Program')
     A            BTSTRT    R
     A                                      REFFLD(SSTIME)
     A                                      COLHDG('Start Timestamp')
     A            BTENDT    R
     A                                      REFFLD(SSTIME)
     A                                      COLHDG('End Timestamp')
     A            BTDURA    R
     A                                      REFFLD(SSCOD8)
     A                                      COLHDG('Duration' 'hh:mm:ss')
     A            BTETIM    R
     A                                      REFFLD(SSCOU7)
     A                                      COLHDG('Duration' 'Seconds')
     A            BTJOB     R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Job' 'Name')
     A            BTUSER    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('User name')
     A            BTNBR     R
     A                                      REFFLD(SSCOD6)
     A                                      COLHDG('Job' 'Number')
     A            BTSJOB    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Submitted' 'Job' 'Name')
     A            BTSUSR    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Submitter' 'User name')
     A            BTSNBR    R
     A                                      REFFLD(SSCOD6)
     A                                      COLHDG('Submitter' 'Job' 'Number')
     A
     A* SSBTIM Compatibility
     A            BTAPPL    R
     A                                      REFFLD(SSTAPP)
     A                                      COLHDG('Application' 'Code')
     A* Blank = N(CALL),Y=Yes(SBMJOB)
     A            BTSBMJ    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Activated By' 'SBMJOB')
     A            BTPROC    R
     A                                      REFFLD(SSCOD1)
     A                                      COLHDG('Processed Indicator')
     A            BTDURN    R
     A                                      REFFLD(SSCOD8)
     A                                      COLHDG('N-Way Duration' 'hh:mm:ss')
     A            BTNTIM    R
     A                                      REFFLD(SSCOU7)
     A                                      COLHDG('N-Way Average' 'Duration')
     **=========================================================================
SS02 ** SSJOBR - ENVIRONMENT SETTING BY APPLICATION
     **=========================================================================
     ** Processing control
     A            SSJOBN    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('Job name')
     A                                      CHECK(VN)
     A            SSUSRN    R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('User name')
     A                                      CHECK(VN)
     A            SSJBNO    R
     A                                      REFFLD(SSJNBR)
     A                                      COLHDG('Job number')
     A            SSJOB8    R
     A                                      REFFLD(SSDAT8)
     A                                      COLHDG('Job date 8')
     A            SSJBST    R               COLHDG('Job System' 'Start Time')
     A                                      REFFLD(SSTIME)
     A            SSJBET    R               COLHDG('Job System' 'End Time')
     A                                      REFFLD(SSTIME)
     A            SSADAY    R
     A                                      REFFLD(SSCOU1)
     A                                      COLHDG('Number of' 'days')
     A            SSPEOW    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('End of week')
     A            SSPEOM    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('End of month')
     A            SSPEOQ    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('End of quarter')
     A            SSPEOY    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('End of year')
     A            SSPBOW    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Beg of week')
     A            SSPBOM    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Beg of month')
     A            SSPBOQ    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Beg of quarter')
     A            SSPBOY    R
     A                                      REFFLD(SSYON)
     A                                      COLHDG('Beg of year')
     **
     A            SSPEFD    R               COLHDG('Effective' 'Days')
     A                                      REFFLD(SSCOU1)
     A                                      TEXT('Number of effective days -
     A                                      to process')
     A            SSPCLD    R               COLHDG('Calendar' 'Days')
     A                                      REFFLD(SSCOU1)
     A                                      TEXT('Number of calendar days -
     A                                      to process')
     A            SSPLCD    R               COLHDG('Number of days' 'last to cu-
     A                                      rrent')
     A                                      REFFLD(SSCOU1)
     **
     A            SSPDTX    R               COLHDG('Processing date text')
     A                                      REFFLD(SSDESS)
     A            SSWDTX    R               COLHDG('Day of week text')
     A                                      REFFLD(SSCOD9)
     **
     A            SSBYD8    R               COLHDG('Date' 'Beg of year')
     A                                      REFFLD(SSDAT8)
     A            SSEYD8    R               COLHDG('Date' 'End of year')
     A                                      REFFLD(SSDAT8)
     A            SSBQD8    R               COLHDG('Date' 'Beg of quarter')
     A                                      REFFLD(SSDAT8)
     A            SSEQD8    R               COLHDG('Date' 'End of quarter')
     A                                      REFFLD(SSDAT8)
     A            SSBMD8    R               COLHDG('Date' 'Beg of month')
     A                                      REFFLD(SSDAT8)
     A            SSEMD8    R               COLHDG('Date' 'End of month')
     A                                      REFFLD(SSDAT8)
     A            SSBWD8    R               COLHDG('Date' 'Beg of week')
     A                                      REFFLD(SSDAT8)
     A            SSEWD8    R               COLHDG('Date' 'End of week')
     A                                      REFFLD(SSDAT8)
     **
     A            SSYDRM    R               COLHDG('Days remaining' -
     A                                      'in current year')
     A                                      REFFLD(SSCOU3)
     A            SSYDPR    R               COLHDG('Days processed' -
     A                                      'in current year')
     A                                      REFFLD(SSCOU3)
     A            SSQDRM    R               COLHDG('Days remaining' -
     A                                      'in current quarter')
     A                                      REFFLD(SSCOU3)
     A            SSQDPR    R               COLHDG('Days processed' -
     A                                      'in current quarter')
     A                                      REFFLD(SSCOU3)
     A            SSMDRM    R               COLHDG('Days remaining' -
     A                                      'in current month')
     A                                      REFFLD(SSCOU3)
     A            SSMDPR    R               COLHDG('Days processed' -
     A                                      'in current month')
     A                                      REFFLD(SSCOU3)
     A            SSWDRM    R               COLHDG('Days remaining' -
     A                                      'in current week')
     A                                      REFFLD(SSCOU1)
     A            SSWDPR    R               COLHDG('Days processed' -
     A                                      'in current week')
     A                                      REFFLD(SSCOU1)
     **=========================================================================
     A* JOB SCHEDULE - SSJOBS
     **=========================================================================
     A*
     A            JOSTAT    R               COLHDG('Job schedule' 'status')
     A                                      REFFLD(SSCOD1)
     A*SS01                                 VALUES(' ' 'D' 'H')
     A* ' ' = Active
     A*  D  = Deleted
     A*  H  = Hold on schedule
     A            JOSJQN    R               COLHDG('Job' 'queue')
     A                                      REFFLD(SSNAME)
     A            JOSJQL    R               COLHDG('Job' 'queue' 'library')
     A                                      REFFLD(SSNAME)
     A            JOSJOB    R               COLHDG('Job' 'name')
     A                                      REFFLD(SSNAME)
     A            JOSFRQ    R               COLHDG('Job schedule' 'frequency')
     A                                      REFFLD(SSNAME)
     A* nn/nn/nn  =Specific date (in system date format)
     A* *DAY      =Each day
     A* *DAYnn    =Day nn of each month
     A*                 nn = 01 to 31
     A* *DAYccc   =Each ccc day of week
     A* *DAYcccnn =Each nn th ccc of week
     A*                ccc = MON, TUE, WED, THU, FRI, SAT & SUN
     A*                 nn = 01 to 13
     A* *MONTHBEG =Each month beginning
     A* *MONTHEND =Each month end
     A* *MONTHnn  =Each month on nn day
     A* *MONTHCCCn=Each month on n th ccc
     A*                ccc = MON, TUE, WED, THU, FRI, SAT & SUN
     A*                  n = 1 to 5
     A* *QTRBEG   =Each quarter beginning
     A* *QTREND   =Each quarter end
     A* *YEARBEG  =Each year beginning
     A* *YEAREND  =Each year end
     A            JOSEF8    R               COLHDG('Effective' 'date')
     A                                      REFFLD(SSDAT8)
     A            JOSNX8    R               COLHDG('Next' 'run' 'date')
     A                                      REFFLD(SSDAT8)
     A            JOSEX8    R               COLHDG('Expiration' 'date')
     A                                      REFFLD(SSDAT8)
     A            JOSTIM    R               COLHDG('Run' 'time' 'HHMMSS')
     A                                      REFFLD(SSTIM6)
     A            JOSBEF    R               COLHDG('Job schedule' 'beg command')
     A                                      REFFLD(SSDESX)
     A            JOSCMD    R               COLHDG('Job schedule' 'command')
     A                                      REFFLD(SSDESX)
     A            JOSAFT    R               COLHDG('Job schedule' 'end command')
     A                                      REFFLD(SSDESX)
     A            JOSUSR    R               COLHDG('Entered' 'by user')
     A                                      REFFLD(SSNAME)
     A            JOSEN8    R               COLHDG('Entered' 'date')
     A                                      REFFLD(SSDAT8)
     A            JOSENT    R               COLHDG('Entered' 'time' 'HHMMSS')
     A                                      REFFLD(SSTIM6)
     A            JOSDSC    R               COLHDG('Job schedule' 'description')
     A                                      REFFLD(SSDESC)
R123 **=========================================================================
R123 A* SSJOBEP ( EVENT CONTROL PARAMETER )
R123 **=========================================================================
R123 A            SEACD2    R
R123 A                                      REFFLD(SSCOD2)
R123 A                                      COLHDG('Application code')
R123 A            SEJOBE    R
R123 A                                      REFFLD(SSDESS)
R123 A                                      COLHDG('Job Event')
R123 A            SEJDEP    R
R123 A                                      REFFLD(SSDESS)
R123 A                                      COLHDG('Job Dependancy')
R123 A            SEDESC    R
R123 A                                      REFFLD(SSDESM)
R123 A                                      COLHDG('Job Event' 'Description')
R123 A            SEWAIT    R
R123 A                                      REFFLD(SSCOU2)
R123 A                                      COLHDG('Job Wait' 'in Minutes')
R123 A            SEERRD    R
R123 A                                      REFFLD(SSDESN)
R123 A                                      COLHDG('Job Error' 'Description')
R123 A*
R123 **
     **=========================================================================
     A* ACCOUNT NUMBER GEN INFO - SSNINP
     **=========================================================================
     A            SSNIAT    R               COLHDG('Account' 'Type')
     A                                      REFFLD(SSACCT)
     A*SS01                                 VALUES('D' 'S' 'X' 'T' 'L')
     A            SSNINT    R               COLHDG('Number' 'Type')
     A                                      REFFLD(SSCOD1)
     A*W003                                 VALUES('A' 'G')
W003 A*SS01                                 VALUES('A' 'G' 'S')
     A* A=Account number
     A* G=Group number
SS01 A            SSNIBK    R               COLHDG('Bank')
SS01 A                                      REFFLD(SSBANK)
     A*SS01       SSNIBR    R               COLHDG('Branch')
     A*SS01                                 REFFLD(SSBRAN)
TF   A*SS01       SSCURR    R               COLHDG('Currency code')
TF   A*SS01                                 REFFLD(SSCURC)
SS01 A            SSNIBG    R               COLHDG('Generate' 'by Bank')
     A                                      REFFLD(SSYON)
SS01 A            SSNIBP    R               COLHDG('Bank' 'Start Position')
     A                                      REFFLD(SSCOU1)
SS01 A            SSNRNL    R               COLHDG('Running No.' 'Length')
     A                                      REFFLD(SSCOU2)
     A*SS01       SSNIHR    R               COLHDG('High Number')
     A*SS01                                 REFFLD(SSACCN)
SS01 A            SSNILR    R               COLHDG('Last Number')
     A                                      REFFLD(SSACCN)
SS01 A            SSNMOD    R               COLHDG('Account' 'number' 'modulus')
SS01 A                                      REFFLD(SSNAME)
     A*SS01       SSNIBI    R               COLHDG('Branch' 'in number')
     A*SS01                                 REFFLD(SSYON)
     A*SS01                                 VALUES('Y' 'N')
I001 A**I001      SSNIBP    R               COLHDG('Branch' 'position')
     A*SS01                                 VALUES(0 1 2 3)
     A*SS01       SSNIQT    R               COLHDG('Quantity' 'to generate')
     A*SS01                                 REFFLD(SSCOU5)
I001 A*SS01       SSNISS    R               COLHDG('State' 'Seq.no')
I001 A*SS01                                 REFFLD(SSCOU1)
I001 A*SS01                                 VALUES(0 1 2 3)
I001 A*SS01       SSNISC    R               COLHDG('State' 'Code')
I001 A*SS01                                 REFFLD(SSCOU2)
I001 A*SS01       SSNIAS    R               COLHDG('Appl.type' 'Seq.no')
I001 A*SS01                                 REFFLD(SSCOU1)
I001 A*SS01                                 VALUES(0 1 2 3)
I001 A*SS01       SSNIAC    R               COLHDG('Appl.type')
I001 A*SS01                                 REFFLD(SSCOU2)
     **
     **=========================================================================
     A* ACCOUNT NUMBER INVENTORY - SSNINV
     **=========================================================================
     A            SSNIST    R               COLHDG('Status')
     A                                      REFFLD(SSREID)
     A*SS01                                 VALUES('A' 'I' 'U')
     A* A=AVAILABLE
     A* I=IN USE (NOT USED)
     A* U=USED
     A            SSNINN    R               COLHDG('Number')
     A                                      REFFLD(SSACCN)
C012 A*SS01       SSNIPD    R               COLHDG('Product' 'Code')
C012 A*SS01                                 REFFLD(SSPROD)
WA62 A            SSNAUX    R               COLHDG('Auxilary' 'Number')
WA62 A                                      REFFLD(SSACCN)
     A*
     **=========================================================================
     ** System Processing Dates Parameter File- SSPAR1
     **=========================================================================
     A            SP1LS8    R               COLHDG('Last Processing' 'Date')
     A                                      REFFLD(SSDAT8)
     **
     A            SP1PD8    R               COLHDG('Current Processing' 'Date')
     A                                      REFFLD(SSDAT8)
     **
     A            SP1TR8    R               COLHDG('Processing' 'Through Date')
     A                                      REFFLD(SSDAT8)
     **
     A            SP1NB8    R               COLHDG('Next Business' 'Date')
     A                                      REFFLD(SSDAT8)
     **
     A            SP1NUM    R               COLHDG('N of Days' 'To Accrue')
     A                                      REFFLD(SSCOU1)
     A            SP1EOM    R               COLHDG('Days to' 'End of month')
     A                                      REFFLD(SSCOU1)
     **
     **=========================================================================
     A* SERVICES BILLING - SSSBIL
     **=========================================================================
     A            JBTYPE    R               COLHDG('Billing record type')
     A                                      REFFLD(SSCOD1)
     A            JBAPPL    R               COLHDG('Application code')
     A                                      REFFLD(SSCOD2)
     A            JBBRAN    R               COLHDG('Billing branch')
     A                                      REFFLD(SSBRAN)
     A            JBGRUP    R               COLHDG('Billing group')
     A                                      REFFLD(SSGRUP)
     A            JBDAT8    R               COLHDG('Run date-MMDDYY')
     A                                      REFFLD(SSDAT8)
     A            JBCPUU    R               COLHDG('CPU seconds-run')
     A                                      REFFLD(SSCOU7)
     A            JBCPUR    R               COLHDG('CPU seconds-report')
     A                                      REFFLD(SSCOU7)
     A            JBCPUP    R               COLHDG('CPU seconds-print')
     A                                      REFFLD(SSCOU7)
     A            JBBUTI    R               COLHDG('Run time-beg')
     A                                      REFFLD(SSTIM6)
     A            JBEUTI    R               COLHDG('Run time-end')
     A                                      REFFLD(SSTIM6)
     A            JBBRTI    R               COLHDG('Report time-beg')
     A                                      REFFLD(SSTIM6)
     A            JBERTI    R               COLHDG('Report time-end')
     A                                      REFFLD(SSTIM6)
     A            JBBPTI    R               COLHDG('Print time-beg')
     A                                      REFFLD(SSTIM6)
     A            JBEPTI    R               COLHDG('Print time-end')
     A                                      REFFLD(SSTIM6)
     A            JBACTA    R               COLHDG('Active accounts')
     A                                      REFFLD(SSCOU7)
     A            JBACTS    R               COLHDG('Total accounts')
     A                                      REFFLD(SSCOU7)
     A            JBNEWA    R               COLHDG('New accounts')
     A                                      REFFLD(SSCOU7)
     A            JBITMS    R               COLHDG('Total items')
     A                                      REFFLD(SSCOU9)
     A            JBITMP    R               COLHDG('Posted items')
     A                                      REFFLD(SSCOU9)
     A            JBITMU    R               COLHDG('Unposted items')
     A                                      REFFLD(SSCOU9)
     A            JBREJR    R               COLHDG('Rejects reentered')
     A                                      REFFLD(SSCOU7)
     A            JBMANA    R               COLHDG('Maintenance accounts')
     A                                      REFFLD(SSCOU7)
     A            JBMANT    R               COLHDG('Maintenance items')
     A                                      REFFLD(SSCOU7)
     A            JBINQU    R               COLHDG('Inquiry items')
     A                                      REFFLD(SSCOU7)
     A            JBRF01    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP01    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBRF02    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP02    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBRF03    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP03    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBRF04    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP04    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBRF05    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP05    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBRF06    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP06    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBRF07    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP07    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBRF08    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP08    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBRF09    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP09    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBRF10    R               COLHDG('Reports printed')
     A                                      REFFLD(SSCOU7)
     A            JBRP10    R               COLHDG('Report pages')
     A                                      REFFLD(SSCOU7)
     A            JBFICH    R               COLHDG('Reports fiched')
     A                                      REFFLD(SSCOU7)
     A            JBFICP    R               COLHDG('Pages fiched')
     A                                      REFFLD(SSCOU7)
     A            JBTAPS    R               COLHDG('Tapes used')
     A                                      REFFLD(SSCOU7)
     A            JBMEMO    R               COLHDG('Memo post items')
     A                                      REFFLD(SSCOU7)
     A            JBPGMH    R               COLHDG('Programming hours')
     A                                      REFFLD(SSAMT2)
     A            JBCOUR    R               COLHDG('Courier charges')
     A                                      REFFLD(SSAMT2)
     A            JBMINC    R               COLHDG('Minimum charge')
     A                                      REFFLD(SSAMT2)
     A            JBMONC    R               COLHDG('Monthly charge')
     A                                      REFFLD(SSAMT2)
     A            JBCOMM    R               COLHDG('Communication charge')
     A                                      REFFLD(SSAMT2)
     A            JBUD01    R               COLHDG('User defined' 'charge No 1')
     A                                      REFFLD(SSCOU7)
     A            JBUD02    R               COLHDG('User defined' 'charge No 2')
     A                                      REFFLD(SSCOU7)
     A            JBUD03    R               COLHDG('User defined' 'charge No 3')
     A                                      REFFLD(SSCOU7)
     A            JBUD04    R               COLHDG('User defined' 'charge No 4')
     A                                      REFFLD(SSCOU7)
     A            JBUD05    R               COLHDG('User defined' 'charge No 5')
     A                                      REFFLD(SSCOU7)
     A            JBUD06    R               COLHDG('User defined' 'charge No 6')
     A                                      REFFLD(SSCOU7)
     A            JBUD07    R               COLHDG('User defined' 'charge No 7')
     A                                      REFFLD(SSCOU7)
     A            JBUD08    R               COLHDG('User defined' 'charge No 8')
     A                                      REFFLD(SSCOU7)
     A            JBUD09    R               COLHDG('User defined' 'charge No 9')
     A                                      REFFLD(SSCOU7)
     A            JBUD10    R               COLHDG('User defined' +
     A                                        'charge No 10')
     A                                      REFFLD(SSCOU7)
     **
     A*****************************************************************
     ** REFERENCE FILES (QSYSREFDDS)
     A*****************************************************************
     **=========================================================================
     A* PARAMETER MAINTENANCE - SSMNTP (SSAAMNTN)
     **=========================================================================
     A            SSPRST    R               COLHDG('Record' 'status')
     A                                      REFFLD(SSREID)
     A            SSPKYV    R               COLHDG('Record' 'key')
V88  A                                      REFFLD(SSRKEY)
     A            SSPUID    R               COLHDG('User ID')
     A                                      REFFLD(SSNAME)
V5R1 A            SSPSPR    R               COLHDG('Supervisor' 'ID')
V5R1 A                                      REFFLD(SSNAME)
R107 A            SSPSPR2   R               COLHDG('Supervisor' 'ID 2')
R107 A                                      REFFLD(SSNAME)
     A            SSPWID    R               COLHDG('Workstation ID')
     A*SS01                                 REFFLD(SSNAME)
SS01 A                                      REFFLD(SSJWID)
     A            SSPJNO    R               COLHDG('Job number')
     A                                      REFFLD(SSCOD6)
     A            SSPDT8    R               COLHDG('Date of' 'maintenance')
     A                                      REFFLD(SSDAT8)
SS01 A            SSPTIM    R               COLHDG('Time' 'change made')
     A                                      REFFLD(SSTIM6)
1P01 A            SSPRD8    R               COLHDG('Prev.' 'maintenance date')
1P01 A                                      REFFLD(SSDAT8)
1P01 A            SSPRTM    R               COLHDG('Prev.' 'time made')
1P01 A                                      REFFLD(SSTIM6)
     A            SSPPGM    R               COLHDG('Change' 'program' 'name')
     A                                      REFFLD(SSNAME)
     A            SSPSQN    R               COLHDG('Maintenance' 'sequence')
     A                                      REFFLD(SSCOUB)
     A            SSPFIL    R               COLHDG('File' 'name')
     A                                      REFFLD(SSNAME)
R107 A            SSPFTY    R               COLHDG('File' 'Type')
R107 A                                      REFFLD(SSCOD1)
     A            SSPFDN    R               COLHDG('Field' 'name')
     A                                      REFFLD(SSNAME)
V88  A            SSPFD8    R               COLHDG('Map' 'Field' 'name')
     A                                      REFFLD(SSNAME)
V88  A            SSCFLD    R               REFFLD(SSDESC)
     A                                      COLHDG('Customised' -
     A                                      'Description')
V88  A            SSPSIC    R               COLHDG('SIC 1')
     A                                      REFFLD(SSCOD1)
V88  A            SSPSI2    R               COLHDG('SIC 2')
     A                                      REFFLD(SSCOD1)
V88  A            SSPSI3    R               COLHDG('SIC 3')
     A                                      REFFLD(SSCOD1)
V88  A            SSPSI4    R               COLHDG('SIC 4')
     A                                      REFFLD(SSCOD1)
     A            SSPFDB    R               COLHDG('Field' 'length')
     A                                      REFFLD(SSCOU5)
     A            SSPFDD    R               COLHDG('Field' 'digits')
     A                                      REFFLD(SSCOU2)
     A            SSPFDP    R               COLHDG('Field' 'decimal' -
     A                                      'positions')
     A                                      REFFLD(SSCOU2)
     A            SSPFDT    R               COLHDG('Field' 'type')
     A                                      REFFLD(SSCOD1)
M002 A            SSAPCD    R               COLHDG('App' 'code')
ccy  A                                      REFFLD(SSCOD2)
M002 A            SSABNK    R               COLHDG('Account' 'Bank')
     A                                      REFFLD(SSBANK)
M002 A            SSTBNK    R               COLHDG('Maintenance' -
     A                                      'Bank')
     A                                      REFFLD(SSBANK)
     A            SSABRN    R               COLHDG('Account' 'branch')
     A                                      REFFLD(SSBRAN)
     A            SSTBRN    R               COLHDG('Maintenance' -
     A                                      'branch')
     A                                      REFFLD(SSBRAN)
     **
     **=========================================================================
     A* PARAMETER MAINTENANCE CONTROL - SSMNTC
     **=========================================================================
     A            SSPFDS    R               COLHDG('File' 'text')
     A                                      REFFLD(SSDESC)
     A* MAINTENANCE DATE (VARIABLE LENGTH)
     A*R101       SSPDTA    R               VARLEN(40)
R101 A            SSPDTA    R
     A                                      REFFLD(SSMNTD)
     A                                      COLHDG('Field' 'data')
v88  A            SSTRNC    R               REFFLD(SSCODA)
V531 A                                      TEXT('Transaction code')
V531 A                                      COLHDG('Transaction code')
V531 A            SSSPID    R               REFFLD(SSNAME)
V531 A                                      TEXT('Supervisor ID')
V531 A                                      COLHDG('Supervisor ID')
V531 A            SSACNO    R               REFFLD(SSCIFN)
V531 A                                      COLHDG('Account number')
V531 A                                      TEXT('Account number')
V531 A            SSCIFN    R               REFFLD(SSCIFN)
V531 A                                      COLHDG('CIF number')
V531 A                                      TEXT('CIF number')
V531 A            SSACTY    R               REFFLD(SSCOD1)
V531 A                                      TEXT('Account type')
V531 A                                      COLHDG('Account type')
V531 A            SSACCY    R               REFFLD(SSCURC)
V531 A                                      TEXT('Account Currency')
V531 A                                      COLHDG('Account Currency')
     **
R109 A            SSDCID    R               COLHDG('Colleteral ID')
R109 A                                      TEXT('Colleteral ID')
R109 A                                      REFFLD(SSCIFN)
R109 A            SSAPNO    R               COLHDG('Application No')
R109 A                                      TEXT('Application No')
R109 A                                      REFFLD(SSACCN)
R109 A            SSAFNO    R               COLHDG('Facility ID')
R109 A                                      TEXT('Facility ID')
R109 A                                      REFFLD(SSACCN)
R109 A            SSRMNO    R               COLHDG('Remittance No')
R109 A                                      TEXT('Remittance No')
R109 A                                      REFFLD(SSDESS)
     **
     **=========================================================================
     A* BACKUP - SSABCKDS
     **=========================================================================
     A            CBANK     R               COLHDG('Library Name')
     A                                      REFFLD(SSNAME)
     A                                      CHECK(VN)
     A            CFLAG     R
     A                                      REFFLD(SSCOD2)
     A                                      COLHDG('Backup Frequency' 'Flag')
     A*SS01                                 VALUES('DY' 'MO' 'TU' 'WE' -
     A*SS01                                 'TH' 'FR' 'SA' 'SU' 'EW' -
     A*SS01                                 'EM' 'EY' 'EQ' '99')
     A            QVOL      R               COLHDG('Volume Id')
     A                                      REFFLD(SSCOD6)
     A            QOWN      R               COLHDG('Owner ID')
     A                                      REFFLD(SSCODA)
     A            QDENS     R               COLHDG('Density')
     A                                      REFFLD(SSCODA)
     A*C022                                 VALUES('1600   ' '6250   ' -
     A*C022                                 '10000  ' '16000  ' '38000  ' -
     A*C022                                 '43200  ' '*DEVTYPE' -
     A*C022                                 '*FMT3490E')
     A            QACPTH    R               COLHDG('Save Access Paths')
     A                                      REFFLD(SSYENO)
     A*SS01                                 VALUES('*YES' '*NO ')
     A            QSAVEF    R               COLHDG('Save save files')
     A                                      REFFLD(SSYENO)
     A*SS01                                 VALUES('*YES' '*NO ')
     A            QCOPYS    R               COLHDG('Copys of backup')
     A                                      REFFLD(SSCOD1)
     A*SS01                                 VALUES('1' '2' '3')
     A            QDTACP    R               COLHDG('Data compression')
     A                                      REFFLD(SSCOD4)
     A*SS01                                 VALUES('*YES' '*NO ' '*DEV')
     **
     **=========================================================================
     A*  SSFRFN - MBASE ONLINE REFERENCE FILE   *
     **=========================================================================
     A            RFNUSR    R               COLHDG('USER ID')
     A                                      REFFLD(SSCODA)
     A            RFNDT8    R               COLHDG('DATE')
     A                                      REFFLD(SSCOU8)
     A            RFNNUM    R               COLHDG('SEQUENCE NUMBER')
     A                                      REFFLD(SSCOU7)
     **
     A*****************************************************************
     ** MENU SYSTEM FILES (QMNSREFDDS)
     A*****************************************************************
     **=========================================================================
     A* ACCESS - SSACCE
     **=========================================================================
     A            SSAACT    R               COLHDG('Access' 'status')
     A                                      REFFLD(SSREID)
     A            SSAUID    R               COLHDG('User ID')
     A                                      REFFLD(SSNAME)
     A            SSAICD    R               COLHDG('Access code')
     A                                      REFFLD(SSNAME)
     A* *PGM      =PROGRAM ACCESS (RESERVED)
     A* *FILE     =FILE ACCESS (RESERVED)
     A* *FIELD    =FILE/FIELD ACCESS (RESERVED)
     A* *CIF      =CUSTOMER ACCESS
     A* *ACCT     =CUSTOMER ACCOUNT ACCESS
     A* *INSIDE   =INSIDER ACCESS
     A* *IBI      =INTERBRANCH INQUIRY ACCESS
     A* *IBM      =INTERBRANCH MAINTENANCE ACCESS
     A* *IBT      =INTERBRANCH TRANSACTION ACCESS
     A* *STATUS   =DORMANT ACCOUNT ACCESS
     A            SSAWID    R               COLHDG('Access' 'information')
C014 A*                                     REFFLD(SSCODA)
C014 A                                      REFFLD(SSCODB)
     A            SSAACC    R               COLHDG('Access' 'authority')
     A                                      REFFLD(SSCODA)
     A            SSAINF    R               COLHDG('Access' 'authority' -
     A                                      'information')
     A                                      REFFLD(SSCODA)
     A* INSIDER CODE (USER DEFINED)
     A* *BRANCH   =Modulus at branch level
     A* *NONE     =No modulus used
     A* pgm-name  =Modulus checking program name
     **
     **=========================================================================
V88  A*Access Code list checking parameter file SSACCL
     **=========================================================================
V88  A            SLTXCD    R               COLHDG('Transaction' 'code')
V88  A                                      REFFLD(SSCODA)
V88  A            SLTXTP    R               COLHDG('Transaction' 'code' -
V88  A                                      'type')
V88  A                                      REFFLD(SSCOD1)
V88  A            SLASEQ    R               COLHDG('Sequence')
V88  A                                      REFFLD(SSCOU3)
V88  A            SLACOD    R               COLHDG('Access' 'Code')
V88  A                                      REFFLD(SSCODA)
     **
     **=========================================================================
V88  A*Access Code Parameter File  SSACCP
     **=========================================================================
V88  A            SPRCID    R               COLHDG('Record' 'Status')
V88  A                                      REFFLD(SSCOD1)
V88  A            SPACOD    R               COLHDG('Access' 'Code')
V88  A                                      REFFLD(SSCODA)
V88  A            SPASEQ    R               COLHDG('Sequence')
V88  A                                      REFFLD(SSCOU3)
V88  A            SPADSC    R               COLHDG('Description')
V88  A                                      REFFLD(SSDESC)
V88  A            SPAFLT    R               COLHDG('Access' 'Information' -
V88  A                                      'Type')
V88  A                                      REFFLD(SSCODA)
V88  A* *ACCT  = Account Number
V88  A* *YESNO = Yes/No
V88  A* *CHAR  = Character field
V88  A* *DEPT  = Department
V88  A* *BRN   = Branch
V88  A* *BANK  = Bank
V88  A* *REGN  = Region
V88  A            SPAMUL    R               COLHDG('Multi' 'Access' 'List')
V88  A                                      REFFLD(SSCOD1)
V88  A            SPAPGM    R               COLHDG('Access' 'Program')
V88  A                                      REFFLD(SSCODA)
V88  A            SPALOG    R               COLHDG('Access' 'logging')
V88  A                                      REFFLD(SSCOD1)
     **
     **=========================================================================
V507 A* Branch access authority file       - SSBACC
     **=========================================================================
V507 A            SBAUID    R               COLHDG('User ID')
V507 A                                      REFFLD(SSNAME)
V507 A            SBAICD    R               COLHDG('Access code')
V507 A                                      REFFLD(SSNAME)
V88  A            SBATYP    R               COLHDG('Access code' 'Type')
V88  A                                      REFFLD(SSCODA)
M004 A            SBABKN    R               COLHDG('Access bank')
M004 A                                      REFFLD(SSBANK)
V507 A            SBABRN    R               COLHDG('Access branch')
V5001A                                      REFFLD(SSBRAN)
     **
     **=========================================================================
V506 A* Group/Region type parameter file - SSBGRP/SSBCTP
     **=========================================================================
V506 A            SSBTYP    R               COLHDG('Center type')
V506 A                                      REFFLD(SSCODA)
V506 A            SSBCDS    R               COLHDG('Center' 'Description')
V506 A                                      REFFLD(SSDESC)
V506 A            SSBCSS    R               COLHDG('Center short name')
V506 A                                      REFFLD(SSNAMS)
V530 A            SSBIID    R               COLHDG('Internal region ID')
V530 A                                      REFFLD(SSCOD3)
V88  A            SSBRNH    R               COLHDG('Branch' 'calendar' 'use')
V88  A                                      REFFLD(SSBRAN)
      * Value valid in SSBCTP eg
V506 A* *RPT = Report distribution group
V506 A* *AUT = Authority checking group
V506 A* *CLR = Clearing zone
V506 A
V506 A            SSBREG    R               COLHDG('Group/Region')
V506 A                                      REFFLD(SSCODA)
V506 A            SSBDES    R               COLHDG('Group/Region' 'Description')
V506 A                                      REFFLD(SSDESC)
     **
     **=========================================================================
V506 A* Group/Region & branch parameter file - SSBDTL
     **=========================================================================
V506 A            SSBBRN    R               COLHDG('Branch number')
V506 A                                      REFFLD(SSBRAN)
SS02 A            SSBBKN    R               COLHDG('Bank number')
SS02 A                                      REFFLD(SSBANK)
V541 A            SSBCTL    R               COLHDG('Center control code')
V541 A                                      REFFLD(SSCODA)
     **
     **=========================================================================
     A* SSPAR4 - ACCOUNT STATUS
     **=========================================================================
     A            JP4SID    R               COLHDG('System ID code')
     A                                      REFFLD(SSCODA)
     A            JP4APP    R               COLHDG('Application code')
     A                                      REFFLD(SSCOD2)
     A            JP4STS    R               COLHDG('Status code')
     A                                      REFFLD(SSACCS)
     A            JP4DSS    R               COLHDG('Status name')
     A                                      REFFLD(SSNAME)
     A            JP4DSC    R               COLHDG('Status' 'short description')
     A                                      REFFLD(SSDESS)
     A            JP4TXT    R               COLHDG('Status text')
     A                                      REFFLD(SSDESC)
     A* MENU DISPLAY FIELDS
     A            SECRES    R
     A                                      REFFLD(SSCODA)
     A                                      COLHDG('Security response')
     **
     **=========================================================================
     A* SSPAR7 - COST CENTERS(GLPAR7)
     **=========================================================================
     A            G7CNTR    R               COLHDG('Cost center')
     A                                      REFFLD(SSCOST)
     A            G7DESC    R               COLHDG('Description')
     A                                      REFFLD(SSDESM)
     A            G7TEXT    R               COLHDG('Text')
     A                                      REFFLD(SSDESC)
     **=========================================================================
     A* SSPAR8 - BUSINESS UNIT
     **=========================================================================
     A            G8BUSN    R               COLHDG('Business Unit')
     A                                      REFFLD(SSCOST)
     A            G8DESC    R               COLHDG('Description')
     A                                      REFFLD(SSDESM)
     A            G8TEXT    R               COLHDG('Text')
     A                                      REFFLD(SSDESC)
     **=========================================================================
     A* SSPAR9 - Business UNIT/Product Code(GLPAR9)
     **=========================================================================
     A            G9PCNO    R               COLHDG('Product Code')
     A                                      REFFLD(SSPROC)
     A            G9DESC    R               COLHDG('Description')
     A                                      REFFLD(SSDESC)
     A            G9TEXT    R               COLHDG('Text')
     A                                      REFFLD(SSDESC)
     **=========================================================================
     A* SSVATP -  VAT code parameter
     **=========================================================================
     A            VTAPCD    R               REFFLD(SSCOD2)
     A                                      COLHDG('Application code')
     A*ss10            VTPRDC    R               REFFLD(SSCOD2)
ss10 A            VTPRDC    R               REFFLD(SSNAME)
     A                                      COLHDG('Product type code')
     A            VTCURC    R               REFFLD(SSCURC)
     A                                      COLHDG('Currency code')
     A            VTATYP    R               REFFLD(SSCOD1)
     A                                      COLHDG('Type of' 'amount')
     A** TYPE OF AMOUNT FOR CALCULATION
     A* A=Annual fee amount
     A* I=Interest amount
     A* L=Late charge
     A* P=Principal
     A            VTRATN    R               REFFLD(SSRATE)
     A                                      COLHDG('VAT rate' 'number')
     A            VTRATE    R               REFFLD(SSPERD)
     A                                      COLHDG('VAT rate')
     A            VTFLAG    R               REFFLD(SSCOD1)
     A                                      COLHDG('Inc/Exc Flag')
     A** FLAG FOR VAT CALCULATION
     A* I=Include
     A* E=Exclude
ss10 A            VTSTR8    R               REFFLD(SSDAT8)
ss10 A                                      COLHDG('Start Date')
    ä**=========================================================================
    çA* MISSING - RETROFIT
    ä**=========================================================================
     A            SSMACT    R               COLHDG('Account number')
     A                                      REFFLD(SSACCN)
     A            SSMTYP    R               COLHDG('Account Type')
     A                                      REFFLD(SSACCT)
     A            SSFSEQ    R               COLHDG('Seq. No')
     A                                      REFFLD(SSACCN)
     A            SSMNEW    R               COLHDG('New Data')
     A                                      REFFLD(SSDESM)
     A            SSMOLD    R               COLHDG('Old Data')
     A                                      REFFLD(SSDESM)
     A            SSMFLD    R               COLHDG('Field changed')
     A                                      REFFLD(SSDESS)
     **=========================================================================
     A* SS8X901- SS MAINTENANCE LOG
     **=========================================================================
     ** INPUT
     A            SSTRAN    R               COLHDG('Transaction Code')
     A                                      REFFLD(SSCODA)
     A            SSRESP    R               COLHDG('File Key HDVFMT')
     A                                      REFFLD(SSDESP)
     ** INPUT
     A*           SSTRAN    R               COLHDG('Transaction Code')
     A*                                     REFFLD(SSCODA)
     A            SSFNAM    R               COLHDG('PF Description')
     A                                      REFFLD(SSDESC)
     A            SSKTX     R               COLHDG('Key Text')
     A                                      REFFLD(SSDES1)
     A            SSKVL     R               COLHDG('Key Value')
     A                                      REFFLD(SSDESS)
     A            SSYKEY    R               COLHDG('PF KEY - TEXT')
     A                                      REFFLD(SSDESP)
     **=========================================================================
     A* SSCLMG - Combined Limit Group
     **=========================================================================
     A            SSCCDE    R               COLHDG('Combined Limit Group')
     A                                      REFFLD(SSCOU3)
     A            SSCURR    R               COLHDG('Currency code')
     A                                      REFFLD(SSCURC)
     A            SSCAMT    R               COLHDG('Combined Limit' 'Amount')
     A                                      REFFLD(SSACGL)
     **=========================================================================
     A* SSTGRP - Approval Limit Group
     **=========================================================================
     A            SSTCDE    R               COLHDG('Approval Limit Group')
     A                                      REFFLD(SSCOU1)
     A            SSTDES    R               COLHDG('Group Description')
     A                                      REFFLD(SSDESM)
     **=========================================================================
     A* RIOLST - Object List by Lib
     **=========================================================================
     A            RIALIB    R               COLHDG('Library')
     A                                      REFFLD(SSCODA)
     A            RIAOBJ    R               COLHDG('Object')
     A                                      REFFLD(SSCODA)
     A            RIATYP    R               COLHDG('Object Type')
     A                                      REFFLD(SSCOD8)
     A            RIAATR    R               COLHDG('Object Attribute')
     A                                      REFFLD(SSCODA)
     A            RIATXT    R               COLHDG('Object Text')
     A                                      REFFLD(SSDESC)
     A            RIAIDF    R               COLHDG('Object Identifier')
     A                                      REFFLD(SSDESS)
     **=========================================================================
     A* RIOLNK - Object List link
     **=========================================================================
     A            RIBPLB    R               COLHDG('Primary Library')
     A                                      REFFLD(SSCODA)
     A            RIBPOB    R               COLHDG('Primary Object')
     A                                      REFFLD(SSCODA)
     A            RIBLLB    R               COLHDG('Link Library')
     A                                      REFFLD(SSCODA)
     A            RIBLOB    R               COLHDG('Link Object')
     A                                      REFFLD(SSCODA)
     ** *PRIKEY=Primary Key Constraint
     **         (Only one primary key constraint is allowed per PF)
     ** *REFCST=Referential Constraint
     ** *UNQCST=Unique Constraint
     ** *CHKCST=Check Constraint
     A            RIBLTY    R               COLHDG('Linkage Type' -
     A                                      'Constraint Type')
     A                                      REFFLD(SSCODA)
     **=========================================================================
SS06 A* Islamic Concepts Code File - SSPARH
     **=========================================================================
     A            CPHCCD    R               COLHDG('Concept' 'Code')
     A                                      REFFLD(SSCOD2)
     A            CPHCDS    R               COLHDG('Concept' 'Description')
     A                                      REFFLD(SSDESC)
     A            CPHCMX    R               COLHDG('Max. Limit' 'Per Customer')
     A                                      REFFLD(SSAMT4)
     A            CPHCAD    R               COLHDG('Auction Days')
     A                                      REFFLD(SSASEQ)
     A            CPHCTP    R               COLHDG('Concept Code' ' Category')
     A                                      REFFLD(SSCOD2)
     **=========================================================================
SS06 A* Islamic Concepts Code By Application - SSPARJ
     **=========================================================================
     A            CJAPPL    R               COLHDG('App' 'code')
     A                                      REFFLD(SSCOD2)
     A                                      TEXT('Application code')
     A            CJSEQ     R               COLHDG('Application' 'Seq')
     A                                      REFFLD(SSCOU3)
     A            CJCCCD    R               COLHDG('Concept' 'Code')
     A                                      REFFLD(SSCOD2)
     **=========================================================================
SS09 A* User Profile  - SSUPRF dataarea external structure
     **=========================================================================
V540 A*
V540 A            SSPEXP    R               COLHDG('Set password'  'to expired')
V540 A                                      REFFLD(SSCOD5)
V540 A            SSUSRC    R               COLHDG('User class')
V540 A                                      REFFLD(SSCOD7)
V540 A            SSSPCA    R               COLHDG('Special authority')
V540 A            SSGRPF    R               COLHDG('Group profile')
V540 A                                      REFFLD(SSCODA)
V540 A            SSOWNR    R               COLHDG('Owner')
V540 A                                      REFFLD(SSCOD7)
V540 A            SSINPG    R               COLHDG('Initial program')
V540 A                                      REFFLD(SSCODA)
V540 A            SSINLB    R               COLHDG('Initial pgm library')
V540 A                                      REFFLD(SSCODA)
V540 A            SSINMN    R               COLHDG('Initial menu')
V540 A                                      REFFLD(SSCODA)
V540 A            SSMNLB    R               COLHDG('Initial menu library')
V540 A                                      REFFLD(SSCODA)
V540 A            SSLMDV    R               COLHDG('Limit device'  'sessions')
V540 A                                      REFFLD(SSCOD7)
V540 A            SSMXST    R               COLHDG('Maximum storage' 'allowed')
V540 A                                      REFFLD(SSCODB)
V540 A            SSPLMT    R               COLHDG('Highest scheduling' -
V540 A                                      'priority')
V540 A                                      REFFLD(SSCOD5)
V540 A            SSJDSC    R               COLHDG('Job description')
V540 A                                      REFFLD(SSCODA)
V540 A            SSJBLB    R               COLHDG('JOBD library')
V540 A                                      REFFLD(SSCODA)
V540 A            SSMSGQ    R               COLHDG('Message queue')
V540 A                                      REFFLD(SSCODA)
V540 A            SSMQLB    R               COLHDG('Message queue' 'library')
V540 A                                      REFFLD(SSCODA)
V540 A            SSMQDL    R               COLHDG('MsgQ delivery')
V540 A                                      REFFLD(SSCOD7)
V540 A            SSOUTQ    R               COLHDG('Output queue')
V540 A                                      REFFLD(SSCODA)
V540 A            SSQQLB    R               COLHDG('Output queue' 'library')
V540 A                                      REFFLD(SSCODA)
V540 A            SSPTDV    R               COLHDG('Print device')
V540 A                                      REFFLD(SSCODA)
V540 A            SSATPG    R               COLHDG('Attention program')
V540 A                                      REFFLD(SSCODA)
V540 A            SSATLB    R               COLHDG('Attention program' -
V540 A                                      'library')
V540 A                                      REFFLD(SSCODA)
V540 A            SSLMCP    R               COLHDG('Limit capability')
V540 A                                      REFFLD(SSCOD8)
V542 A            SSMLVL    R               COLHDG('Menu access level')
V542 A                                      REFFLD(SSCOD4)
V542 A            SSMNAM    R               COLHDG('Menu name')
V542 A                                      REFFLD(SSCODA)
V542 A            SSCREF        19S 0       COLHDG('Teller cash ref no')
V542 A            SSADFU    R               COLHDG('ATM default' 'user group')
V542 A                                      REFFLD(SSCODA)
V542 A            SSOTDG    R               COLHDG('Online tran' 'dft group')
V542 A                                      REFFLD(SSCODA)
V542 A            SSADMG    R               COLHDG('ADM access group')
V542 A                                      REFFLD(SSCODA)
W007 A            SSTELG    R               COLHDG('Teller access group')
W007 A                                      REFFLD(SSCODA)
     **=========================================================================
SS11 A* Clearing code parameter - SSCLRP
     **=========================================================================
     A            CLPREGN   R               COLHDG('Clearing' 'code')
     A                                      REFFLD(SSCODA)
     A            CLPDESC   R               COLHDG('Description')
     A                                      REFFLD(SSDESC)
     A            CLPDESS   R               COLHDG('Short' 'description')
     A                                      REFFLD(SSDESS)
     A            CLPLDSC   R               COLHDG('Local' 'description')
     A                                      REFFLD(SSDESC)
     A            CLPIREG   R               COLHDG('Internal' 'region ID')
     A                                      REFFLD(SSCOD3)
     A            CLPLIFT   R               COLHDG('Mid-day' 'uplift flag')
     A                                      REFFLD(SSYON )
     A            CLPCUTT   R               COLHDG('Cut-off' 'time')
     A                                      REFFLD(SSTIM6)
     A            CLPCUT2   R               COLHDG('Cut-off' 'time 2')
     A                                      REFFLD(SSTIM6)
     A            CLPCBRN   R               COLHDG('Branch' 'calendar used')
     A                                      REFFLD(SSBRAN)
     A            CLPCBNK   R               COLHDG('Bank' 'calendar used')
     A                                      REFFLD(SSBANK)
     A            CLPCOUN   R               COLHDG('Country' 'code')
     A                                      REFFLD(SSSTA3)
     **=========================================================================
SS11 A* Cheque/clearing code link parameter - SSCLRQ
     **=========================================================================
     A            CLQBANK   R               COLHDG('Bank' 'number')
     A                                      REFFLD(SSBANK)
     A            CLQBRAN   R               COLHDG('Branch' 'number')
     A                                      REFFLD(SSBRAN)
     A            CLQCHQT   R               COLHDG('Cheque' 'type')
     A                                      REFFLD(SSCOD2)
     A            CLQCHQI   R               COLHDG('Cheque' 'internal type')
     A                                      REFFLD(SSCOD2)
     A            CLQREGN   R               COLHDG('Clearing' 'code')
     A                                      REFFLD(SSCODA)
     A            CLQOUBR   R               COLHDG('OW Clearing' 'Branch')
     A                                      REFFLD(SSBRAN)
     A                                      TEXT('Outward Clearing Branch')
     A            CLQCTL1   R               COLHDG('Additional' 'control 01')
     A                                      REFFLD(SSCOD1)
     A            CLQCTL2   R               COLHDG('Additional' 'control 02')
     A                                      REFFLD(SSCOD1)
     A            CLQCTL3   R               COLHDG('Additional' 'control 03')
     A                                      REFFLD(SSCOD1)
     A            CLQCTLA   R               COLHDG('Additional' 'control 10')
     A                                      REFFLD(SSCODA)
     A            CLQCTLB   R               COLHDG('Additional' 'control 11')
     A                                      REFFLD(SSCODA)
     **=========================================================================
     ** SSIRCB - Inter Region Country/Bank
     **=========================================================================
     A            SIIRCN    R               COLHDG('IR Country Code')
     A                                      REFFLD(SSCOD2)
     A            SIIRBK    R               COLHDG('IR Bank')
     A                                      REFFLD(SSBANK)
     A            SIIRDS    R               COLHDG('Description')
     A                                      REFFLD(SSDESM)
     A**********************************************************************
     A* SSNOTP - NUMBER TYPE FILE FOR GL RE-CON
     A**********************************************************************
     A            SNNTYP    R               COLHDG('NUMBER TYPE')
     A                                      REFFLD(SSCODA SILVERLAKE)
     A            SNBATN    R               COLHDG('BATCH NO')
     A                                      REFFLD(SSCOU5 SILVERLAKE)
     **=========================================================================
R102 ** SSJOBC -
     **=========================================================================
     ** Processing control
     A            SSDJOB8   R
     A                                      REFFLD(SSDAT8)
     A                                      COLHDG('Job date 8')
     A            SSCZONE   R
     A                                      REFFLD(SSCOD2)
     A                                      COLHDG('Zone Staging')
     A            SSCZOND   R
     A                                      REFFLD(SSDESM)
     A                                      COLHDG('Zone Stage Desc')
     A            SDCJOBN   R               COLHDG('Job Name')
     A                                      REFFLD(SSNAME)
     A            SSCUSRN   R
     A                                      REFFLD(SSNAME)
     A                                      COLHDG('User name')
     A            SSCJBNO   R
     A                                      REFFLD(SSCOD6)
     A                                      COLHDG('Job number')
     A            SSCJBST   R               COLHDG('Job System' 'Start Time')
     A                                      REFFLD(SSTIME)
     A            SSCJBET   R               COLHDG('Job System' 'End Time')
     A                                      REFFLD(SSTIME)
     A            SSCTIMD   R               COLHDG('Duration' 'hh:mm:ss')
     A                                      TEXT('Time Duration')
     A                                      REFFLD(SSCOD8)
     A            SSCTIMS   R               COLHDG('Duration' 'Seconds')
     A                                      TEXT('Duration Seconds')
     A                                      REFFLD(SSCOD7)
     A            SSINQC    R               COLHDG('Inquiry' 'Code')
     A                                      TEXT('Inquiry Code')
     A                                      REFFLD(SSCOD8)
     A            G9INQC    R               COLHDG('Inquiry' 'Code')
     A                                      TEXT('Inquiry Code')
     A                                      REFFLD(SSCOD8)
R104 **=========================================================================
R104 ** SSJRNF -
R104 **=========================================================================
R104 A*Application code
R104 A            SSJAPP    R
R104 A                                      REFFLD(SSCOD2)
R104 A                                      COLHDG('Application code')
R104 A            SSJAP3    R
R104 A                                      REFFLD(SSCOD3)
R104 A                                      COLHDG('Application code')
R104 A            SSJLIB    R
R104 A                                      REFFLD(SSCODA)
R104 A                                      COLHDG('Library Name')
R104 A            SSJMDE    R
R104 A                                      REFFLD(SSCOD1)
R104 A                                      COLHDG('Journal Mode')
R104 A            SSJNAM    R
R104 A                                      REFFLD(SSCODA)
R104 A                                      COLHDG('Journal Name')
R104 A**          SSJSTS    R
R104 A**                                    REFFLD(SSCOD1)
R104 A**                                    COLHDG('Journaling Status')
R104 A            SSADOQ    R
R104 A                                      REFFLD(SSCODA)
R104 A                                      COLHDG('Out Queue Name')
R104 A            SSADOQL   R
R104 A                                      REFFLD(SSCODA)
R104 A                                      COLHDG('Out Queue Library')
CKW  A            SSPBSQ    R
CKW  A                                      REFFLD(SSCOU4)
CKW  A                                      COLHDG('Batch Number')
     **=========================================================================
     ** SSINDX -
     **=========================================================================
     A
     A            SSENAC    R
     A                                      REFFLD(SSCOUA)
     A                                      COLHDG('ENCODED A/C NUMBER')
     A            SSOLDAC   R
     A                                      REFFLD(SSCODJ)
     A                                      COLHDG('OLD ACCOUNT NUMBER')
     A
     A            SSCLIM    R               COLHDG('CUT OFF LIMIT')
     A                                      REFFLD(SSAMT5 SILVERLAKE)
     ***************************************************************************
T1003A            SSCHME    R               COLHDG('Scheme Code')
T1003A                                      REFFLD(SSCODA)
T1002A            FILLER1A  R               COLHDG('FILLER1A')
T1002A                                      TEXT('FILLER 1 CHAR')
T1002A                                      REFFLD(SSCOD1)
T1002A            FILLER2A  R               COLHDG('FILLER2A')
T1002A                                      TEXT('FILLER 2 CHAR')
T1002A                                      REFFLD(SSCOD2)
T1002A            FILLER10A R               COLHDG('FILLER10A')
T1002A                                      TEXT('FILLER 10 CHAR')
T1002A                                      REFFLD(SSNAME)
T1003A            FILLER20A R               COLHDG('Filler20A')
T1003A                                      TEXT('Filler 20 Char')
T1003A                                      REFFLD(SSDESS)
T1002A            FILLER50A R               COLHDG('FILLER50A')
T1002A                                      TEXT('FILLER 50 CHAR')
T1002A                                      REFFLD(SSDESC)
T1002A            FILLER3N  R               COLHDG('FILLER3N')
T1002A                                      TEXT('FILLER 3 NUM')
T1002A                                      REFFLD(SSCOU3)
K1001**=========================================================================
K1001** Special Exchange Rate by Wealth Grade - SSFXWL
K1001**=========================================================================
K1001A            JFWDS8    R               COLHDG('Effective Start Date')
K1001A                                      TEXT('Effective Start Date')
K1001A                                      REFFLD(SSDAT8)
K1001A            JFWDE8    R               COLHDG('Effective End Date')
K1001A                                      TEXT('Effective End Date')
K1001A                                      REFFLD(SSDAT8)
K1001A            JFWAMN    R               COLHDG('Apply to ' -
K1001A                                      'Minimum Amount')
K1001A                                      TEXT('Apply to Minimum Amount')
K1001A                                      REFFLD(SSAMT4)
K1001A            JFWAMX    R               COLHDG('Apply to ' -
K1001A                                      'Maximum Amount')
K1001A                                      TEXT('Apply to Maximum Amount')
K1001A                                      REFFLD(SSAMT4)
K1002**=========================================================================
K1002** Calendar iBOR - SSCIBR
K1002**=========================================================================
K1002A            IBCURR    R               COLHDG('iBOR Currency Code')
K1002A                                      TEXT('iBOR Currency Code')
K1002A                                      REFFLD(SSCOD5)
K1002A            IBCNCD    R               COLHDG('iBOR Country Code')
K1002A                                      TEXT('iBOR Country Code')
K1002A                                      REFFLD(SSCOD5)
K1002A            IBRSV6    R               COLHDG('Reserve field 6')
K1002A                                      TEXT('Reserve field 6')
K1002A                                      REFFLD(SSCOD5)
K1002A            IBRSV7    R               COLHDG('Reserve field 7')
K1002A                                      TEXT('Reserve field 7')
K1002A                                      REFFLD(SSCOD5)
K1002A            IBRSV8    R               COLHDG('Reserve field 8')
K1002A                                      TEXT('Reserve field 8')
K1002A                                      REFFLD(SSCOD5)
K1002A            IBRSV9    R               COLHDG('Reserve field 9')
K1002A                                      TEXT('Reserve field 9')
K1002A                                      REFFLD(SSCOD5)
K1002A            IBFIL1    R               COLHDG('Filler 1')
K1002A                                      TEXT('Filler 1')
K1002A                                      REFFLD(SSCODA)
K1002A            IBFIL2    R               COLHDG('Filler 2')
K1002A                                      TEXT('Filler 2')
K1002A                                      REFFLD(SSCODA)
K1002A            IBFIL3    R               COLHDG('Filler 3')
K1002A                                      TEXT('Filler 3')
K1002A                                      REFFLD(SSCODA)
K1002A            IBFIL4    R               COLHDG('Filler 4')
K1002A                                      TEXT('Filler 4')
K1002A                                      REFFLD(SSCODA)
K1003**=========================================================================
K1003** PDPA Data Retention - SSPARY
K1003**=========================================================================
K1003A            SSPURC    R               COLHDG('PDPA Purge Code')
K1003A                                      TEXT('PDPA Purge Code')
K1003A                                      REFFLD(SSCODA)
K1003A            SSTRMC    R               COLHDG('Term Code')
K1003A                                      TEXT('Term Code')
K1003A                                      REFFLD(SSCOD1)
K1003A            SSRNUM    R               COLHDG('No. of ' -
K1003A                                      'Year/Month/Day')
K1003A                                      TEXT('No. of Year/Month/Day')
K1003A                                      REFFLD(SSRET3)
K1003A            SSSDSC    R               COLHDG('Short ' -
K1003A                                      'Description')
K1003A                                      TEXT('Short Description')
K1003A                                      REFFLD(SSDESS)
K1003A            SSPPNM    R               COLHDG('Purging ' -
K1003A                                      'Program Name')
K1003A                                      TEXT('Purging Program Name')
K1003A                                      REFFLD(SSCODA)
K1001***************************************************************************
